[{
    "Alabama": [
        {
            "description": "A crowd protested peacefully along Quintard Avenue on June 1 and 2.[3]",
            "loc": "Anniston"
        },
        {
            "description": "A crowd protested peacefully in front of the Clay County courthouse on June 2.[4]",
            "loc": "Ashland"
        },
        {
            "description": "Hundreds of demonstrators held a largely peaceful protest on May 31 in downtown Auburn at Toomer's Corner.[5]",
            "loc": "Auburn"
        },
        {
            "description": "Police said the overnight riots resulted in burglaries at 14 businesses with another 13 businesses that had significant damage, while firefighters responded to more than 22 fires including five at commercial buildings. There were also three house fires linked to the rioting, as well as multiple vehicle and dumpster fires, according to authorities. On June 1, the mayor declared a curfew and an indefinite state of emergency for the city and pledged to remove the Confederate monument at Linn Park.[8][9] The monument was partially removed by city authorities on June 2.[10]",
            "loc": "Birmingham"
        },
        {
            "description": "On May 31, a large crowd gathered peacefully at the Houston County Courthouse, holding signs, chanting, and listening to speakers.[11]",
            "loc": "Dothan"
        },
        {
            "description": "Protesters marched downtown on May 31.[citation needed]",
            "loc": "Gadsden"
        },
        {
            "description": "At least 100 protesters attended a march along U.S. Route 31 to the Hoover Municipal complex on May 30; 20 people were arrested.[6]",
            "loc": "Hoover"
        },
        {
            "description": "Protesters marched through downtown on May 30.[6] On June 1, a protest began at 3:00 pm with speakers, music and an eight-minute moment of silence at the Madison County Courthouse; over 1,000 people joined the protest.[12] The white mayor and a black city councilman asked people to \"protest responsibly and peacefully.\" The mayor \"took a knee\" and begged the protesters to leave in a responsible manner. The protest officially ended at 8:00 p.m.,[12] and police had asked they disperse starting at 6:00pm, but over one hundred refused to leave the area.[13] An activist leader replied, \"It's not about black response. It's about privilege response.\" Police fired tear gas to disperse the crowd.[12] Two people were arrested at the protest. One was charged with carrying a firearm at a demonstration.[14]",
            "loc": "Huntsville"
        },
        {
            "description": "A group protested downtown on June 1.[15]",
            "loc": "Jacksonville"
        },
        {
            "description": "On May 31, a march starting at Mardi Gras Park looped around the city and returned to the park. A part of the group attempted to block I-10, but they were stopped by police, who blocked the road themselves and later dispersed the crowd with tear gas. A police van window was smashed, but a public safety director distributed his phone number asking them to express their concerns.[16][17][18]",
            "loc": "Mobile"
        },
        {
            "description": "Hundreds of people protested on the steps of the Alabama State Capitol on May 30.[19]",
            "loc": "Montgomery"
        },
        {
            "description": "A crowd protested downtown on May 30.[20]",
            "loc": "Opelika"
        },
        {
            "description": "About 50 people demonstrated peacefully on May 29 at the square in downtown Troy.[21][22]",
            "loc": "Troy"
        }
    ]
},
{
    "Minneapolis–Saint Paul": [
        {
            "description": "Despite the announcement of the charges and the new curfew, riots broke out again on Friday night and continued into early Saturday morning, with much of the action taking place adjacent to the Minneapolis police fifth precinct station near Lake Street and Nicollet Avenue.[38] Law enforcement presence was reportedly \"undetectable\", as violence in Minneapolis quickly grew until just before midnight, when police officers, state troopers, and members of the National Guard began confronting rioters with tear gas and mass force.[38] Officials later said that the 350 police officers at the site of rioting near the Minneapolis fifth precinct station were vastly outnumbered by the crowds.[39]",
            "loc": "Background"
        },
        {
            "description": "As the events unfolded that night, the Pentagon placed members of the Military Police Corps from Fort Bragg and Fort Drum on stand-by, preparing for possible deployment to the Twin Cities if requested by Walz.[40] Walz later declined the offer and activated all of the state's National Guard, up to 13,200 troops.[41]",
            "loc": "Events"
        },
        {
            "description": "Thousands of protesters gathered at the Police Officers Federation building in Minneapolis to demand the resignation of Bob Kroll, head of the police union. In previous weeks, other labor union leaders called for Kroll’s removal, with one saying he perpetuated \"a culture of violence\" against the black community. Kroll had characterized the protesters and Black Lives Matter as a \"terrorist movement\".[66]",
            "loc": "Government response"
        },
        {
            "description": "A smaller protest group gathered at the Hennepin County Government Center to demand Freeman's resignation over his poor handling of officer-involved shootings in Minneapolis.[67]",
            "loc": "Arrests"
        },
        {
            "description": "In the weeks following the initial protests, federal law enforcement opened investigations of people who instigated looting and arson. By June 17, 2020, federal charges had been filed against 10 people, 9 of whom had ties to the U.S. state of Minnesota, for rioting or arson during the unrest.[5] Among the arrests announced by U.S. Attorney Erica MacDonald's office were two Minnesota residents for their role in the burning of the Minneapolis police third precinct. A 23-year old man from Saint Paul, who was identified on video inside the precinct and later found in possession of police riot gear, was charged with aiding and abetting the looting and arson.[71] Another man, a 22-year old from Brainerd, Minnesota who authorities arrested in the U.S. state of Colorado, was captured on video lighting and throwing Molotov cocktails.[72] Authorities identified many suspects via videos they posted of themselves at protests on social media websites.[5]",
            "loc": "Curfews"
        },
        {
            "description": "The state imposed nightly curfews in the cities of Minneapolis and Saint Paul beginning on Friday, May 29 to keep people off the streets.[33] After several extensions, curfews ended one week later on June 5.[59]",
            "loc": "Community response"
        },
        {
            "description": "After protests turned violent, more than 7,000 members of the Minnesota National Guard were activated and deployed to the Twin Cities. Their mission was to support local law enforcement, safeguard the state capitol building, and protect the right of people to protest.[80] The deployment was the largest in the state's history.[44]",
            "loc": "Clean up"
        },
        {
            "description": "Each morning, hundreds of residents, some with snow shovels and brooms, went to areas affected by overnight rioting to clean up trash, graffiti, broken glass, and the remnants of damaged buildings. Some residents participating in the clean up told local media they were devastated by the damage, but shared the sense of anger and solidarity over Floyd's death.[81][82]",
            "loc": "Food drives"
        },
        {
            "description": "Residents took action to support the needs of people for food and goods who were affected by the riots. In the areas of heavy rioting, many local stores were closed after being looted and burned, and food pantries were overwhelmed. A small food drive at a middle school in Minneapolis aimed to fill 85 bags of food to help families, but organizers ended up with a line of vehicles stretching 14 city blocks and 20,000 bags of bread, fruit, and other items. A food drive in the Little Earth community resulted in enough packages of food and diapers to serve 1,000 residents and 7,500 people from the nearby neighborhoods. Many organizations, overwhelmed by the volume of donations, had to turn them away.[83]",
            "loc": "Memorial site"
        },
        {
            "description": "A makeshift memorial emerged at the East 38th Street and Chicago Avenue intersection in Minneapolis near where Floyd died. Thousands of visitors protested and grieved at the site, which was described as like a \"shrine\". State and local elected officials that met with community members indicated their support for a more permanent memorial at the intersection.[84] Many visitors left behind flowers by the murals and sculptures created by activists to symbolize the Black Lives Matter movement. The Minneapolis police announced that they would not alter or decommission the memorial site or remove artifacts.[85]",
            "loc": "Public art"
        },
        {
            "description": "Vibrant works of arts appeared all over the Twin Cities that sought to honor George Floyd's memory and show community solidarity. Boarded-up buildings were described as canvasses for artists, and so were walls, sidewalks, and public property.[86] A mural of George Floyd on the side of the Cup Foods grocery store became one of the most recognizable images of the global protest movement that was sparked by his death, and a digital rendering of it served as a backdrop to his casket at his funeral in Houston, Texas.[87][88] In a grassy field near the location where Floyd died, artists erected a symbolic cemetery with 100 gravestone markers of African-Americans, including of Floyd, who were killed by police.[89]",
            "loc": "Safety patrols"
        },
        {
            "description": "Residents awoke many mornings during the heaviest rioting to find nearby restaurants, liquor stores, and other businesses had been set on fire. In Minneapolis, the Longfellow, Powderhorn, and Phillips communities were heavily affected by the events. Reports and videos of residents confronting the people causing damage circulated, as did rumors about who might be responsible for the violence. Some residents felt the city and law enforcement had abandoned them, so they carried bats and sticks to protect their homes and businesses. On Saturday, May 30, Minneapolis city counselors hosted community meetings in public parks and helped residents initiate block-by-block plans to monitor disruptive activity.[43] The American Indian community in Minneapolis organized group patrols of 50 to 100 volunteers each night of the larger protests, which was credited with saving more than 20 businesses along the Franklin Avenue corridor. The effort was organized by leaders of the American Indian Movement and a community development organization, as well as a coffee shop owner.[90]",
            "loc": "Aftermath"
        },
        {
            "description": "Civic unrest after Floyd's death came in the middle of the global COVID-19 pandemic caused by the spread of the SARS-CoV-2 respiratory infection. People wearing protective masks became a common sight at protests. Health officials in Minnesota warned that mass protests could exacerbate the spread of the virus in Minnesota and trigger a surge in the outbreak that has a disproportionate impact on minority communities.[91] The state's health department stood up free testing clinics with the help of community organizations and encouraged people who participated in protests to get tested. Preliminary data showed a decline in daily confirmed cases and hospitalizations of COVID-19 in the weeks following the initial protests.[92]",
            "loc": "COVID-19 pandemic"
        }
    ]
},
{
    "Montana": [
        {
            "description": "About 50 primarily high school and college-age protesters stood in front of the Billings Police Department's downtown station on May 30.[1]",
            "loc": "Billings"
        },
        {
            "description": "Approximately 2,000 protesters marched peacefully from Bogert Park to the Gallatin County Courthouse the afternoon of May 31.[2]",
            "loc": "Bozeman"
        },
        {
            "description": "On June 5, around 100 protesters gathered outside the Butte-Silver Bow Courthouse to support Black Lives Matter. A moment of silence was held to honor George Floyd and others who died from police violence.[3]",
            "loc": "Butte"
        },
        {
            "description": "On May 31, a few hundred people gathered along the Central Avenue West bridge to protest the death of George Floyd.[4][5]",
            "loc": "Great Falls"
        },
        {
            "description": "Over a hundred people protested on May 31.[6]",
            "loc": "Havre"
        },
        {
            "description": "About 150 people in Helena gathered in front of the Montana State Capitol building the afternoon of May 31.[7]",
            "loc": "Helena"
        },
        {
            "description": "On June 6, over 1,000 people held a largely peaceful protest in Depot Park to support Black Lives Matter and George Floyd. Many armed counter-protesters attended the event as well in order to keep the peace, namely to protect the nearby Flathead County Veterans Memorial from being vandalized.[8]",
            "loc": "Kalispell"
        },
        {
            "description": "Hundreds of people peacefully protested outside the Missoula County Courthouse on May 29.[9][10]",
            "loc": "Missoula"
        }
    ]
},
{
    "Mississippi": [
        {
            "description": "On Saturday, May 30, about 50 people protested peacefully with signs and bullhorns along Beach Boulevard in front of the Biloxi Lighthouse. More than 60 demonstrated in the same place on Sunday, May 31, as passing motorists honked horns in solidarity.[1][2]",
            "loc": "Biloxi"
        },
        {
            "description": "On June 6, hundreds of protesters gathered in Jones Park and marched down Highway 90 in support of Black Lives Matter. The protest remained peaceful, despite rumors that bricks were present to rile up emotions.[3]",
            "loc": "Gulfport"
        },
        {
            "description": "About 30 protesters, waving signs and chanting, marched peacefully on May 31 down Hardy Street, escorted by city police cars. An organizer of the event marched with her hands cuffed symbolically behind her back.[4]",
            "loc": "Hattiesburg"
        },
        {
            "description": "On Friday, May 29, About 25 demonstrators peacefully protested in front of the Mississippi State Capitol and marched through downtown Jackson.[5] On June 6, between 3,000 and 5,000 protesters gathered for a Black Lives Matter raly in front of the state capitol. Jackson Mayor Chokwe Antar Lumumba attended the rally. Mississippi Highway Patrol distributed masks to protesters.[6]",
            "loc": "Jackson"
        },
        {
            "description": "On June 2, a peaceful protest took place on North Hills Street, starting with four protesters and growing into the evening.[7]",
            "loc": "Meridian"
        },
        {
            "description": "About 300 people peacefully demonstrated and marched around The Square for a couple of hours on May 30.[8] That same afternoon, Ole Miss university police arrested a white public school teacher for vandalizing a Confederate statue on campus with spray paint.[9]",
            "loc": "Oxford"
        },
        {
            "description": "On May 28 at least 200 people protested outside Petal City Hall on Friday night, demanding that Mayor Hal Marx resign after he made a comment defending the police regarding George Floyd's death and saying \"I didn’t see anything unreasonable.\"[10] One elderly woman walked three miles with symbolic chains around her feet to get to the protest.[11] Protests in Petal continued through the weekend[12] and protesters showed up Tuesday June 2 at the city's Board of Aldermen meeting to demand Marx's resignation.[13]",
            "loc": "Petal"
        },
        {
            "description": "On June 6, thousands of protesters marched from Unity Park to the Amphitheater at Mississippi State University, lying down on their stomachs for eight minutes and forty-six seconds to honor George Floyd.[14]",
            "loc": "Starkville"
        },
        {
            "description": "Several hundred people protested peacefully at the Tupelo Fairpark on May 30.[15]",
            "loc": "Tupelo"
        },
        {
            "description": "On June 5, a large peaceful protest took place as demonstrators marched from the Vicksburg Police Department through the streets of downtown to protest the death of George Floyd. The event was organized in part by the NAACP.[16]",
            "loc": "Vicksburg"
        }
    ]
},
{
    "Minnesota": [
        {
            "description": "This is a list of George Floyd protests in the U.S. state of Minnesota. The first and most notable took place in the Minneapolis–Saint Paul area, after George Floyd was killed during an arrest in Minneapolis on May 25, 2020.",
            "loc": "Background"
        },
        {
            "description": "On May 31, protesters rallied at Bandshell Community Park and marched to the Law Enforcement Center before returning to the park and disbanding.[2]",
            "loc": "Albert Lea"
        },
        {
            "description": "On May 30, between 300 and 500 protesters marched from Paul Bunyan Park to the Bemidji Police Department; the demonstration was peaceful until some protesters attacked a D.A.R.E. truck, which then backed into a crowd of demonstrators and mildly injured an event volunteer. After the protest, mayor Rita Albrecht signed a declaration of a curfew between 8:00 p.m. and 6:00 a.m.[3]",
            "loc": "Austin"
        },
        {
            "description": "On May 29, over 60 people gathered at a busy intersection to support Black Lives Matter and protest the death of George Floyd.[4]",
            "loc": "Bemidji"
        },
        {
            "description": "On May 28, around 100 protesters blocked traffic at a busy intersection to protest the death of George Floyd.[5] On May 30, several hundred protesters temporarily blocked portions of Interstate 35.[6][7] Several highways closed, including Interstate 35, Interstate 394, Interstate 94 and Highway 55.[8] A curfew from 10 p.m. CDT through 6 p.m. CDT Sunday morning was imposed by Duluth city leaders.[9] On May 31, more than 1,000 protesters marched on I-35. Eight properties were damaged including an expletive written on the ground below the Clayton Jackson McGhie Memorial for historical lynching victims.[10]",
            "loc": "Brainerd"
        },
        {
            "description": "On June 6, approximately 250 protesters marched down Chapman Street from Central Avenue to Whiteside Park in support of Black Lives Matter. The protest was peaceful with no incidents of violence. Once arriving at the park, most protesters kneeled in silence for 8 minutes 46 seconds.[11]",
            "loc": "Duluth"
        },
        {
            "description": "On May 29, hundreds of protesters marched through downtown Mankato in a peaceful demonstration. The rally began at Veterans Memorial Bridge and went through Washington park and to the Mankato Public Safety Center.[12]",
            "loc": "Ely"
        },
        {
            "description": "The first George Floyd protests took place in Minneapolis on May 26, the day after his death while under the custody of Minneapolis police officers, and spread to neighboring St. Paul. On May 28, after protests turned violent, Minneapolis Mayor Jacob Frey declared a state of emergency and Minnesota Governor Tim Walz activated the Minnesota National Guard.[13] An analysis of property damage determined that through June 9, nearly 570 businesses in the Twin Cities metropolitan area were damaged by vandalism and looting, 67 were entirely destroyed by fire, and others had extensive fire and water damage.[14] Minneapolis city officials estimated that the cost of riot damages were between $100 million and $150 million.[15] Demonstrations in Minneapolis–St. Paul are ongoing as protesters seek justice for Floyd and reform of policing, and have inspired protests and political action in Minnesota, the United States, and internationally.[16]",
            "loc": "Mankato"
        },
        {
            "description": "On May 31, over 200 protesters demonstrated along Hoffman Drive to show solidarity with George Floyd. They traveled to the Law Enforcement Center, where they spoke with officers from Owatonna and from neighboring counties. They also held a moment of silence for eight minutes and forty-six seconds to honor Floyd.[18]",
            "loc": "Owatonna"
        },
        {
            "description": "On May 29, over 150 protesters marched from Soldiers Field to the Government Center building and back to protest the death of George Floyd.[19] On June 7, protesters marched from Silver Lake to the Olmsted County Government Center.[20]",
            "loc": "Rochester"
        },
        {
            "description": "On May 29, after hundreds of people gathered for a memorial for George Floyd at Lake George Township, a portion of the crowd marched through downtown St. Cloud, stopping at the Stearns County Courthouse to hold a moment of silence for Floyd before turning back to Lake George.[21]",
            "loc": "St. Cloud"
        },
        {
            "description": "On June 1, a group of about 40 protesters gathered in Ojibway Park to rally against police brutality. Another protest took place on June 4 as protesters marched from Colby Lake to Woodbury City Hall.[22]",
            "loc": "Woodbury"
        }
    ]
},
{
    "New Hampshire": [
        {
            "description": "On June 3, about 200 people protested in Bristol.[1]",
            "loc": "Bristol"
        },
        {
            "description": "On June 6, nearly 2,000 people marched to the New Hampshire State House in Concord to protest.[2]",
            "loc": "Concord"
        },
        {
            "description": "On May 31, about 200 people protested in Conway.[3]",
            "loc": "Conway"
        },
        {
            "description": "Hundreds came to a vigil that was held on June 1 in Dover for George Floyd.[4]",
            "loc": "Dover"
        },
        {
            "description": "A protest occurred in Dublin on May 30.[5]",
            "loc": "Dublin"
        },
        {
            "description": "Over 300 town residents and Dartmouth College students protested on the Hanover town green on June 1.[6]",
            "loc": "Hanover"
        },
        {
            "description": "Protesters rallied in Center Square on May 30 in Keene.[5]",
            "loc": "Keene"
        },
        {
            "description": "On May 30, 2020, approximately 800 people rallied in downtown Manchester, beginning their protest at Veterans Park, marching down Elm Street, and ending their march back at the park.[7][8][9] Although the protests were peaceful, a tense moment happened at around 1:30 PM when two men in a pickup truck with a blue Trump 2020 flag attached to it drove up to and argued with protesters, with one of the men exiting the truck and brandishing a handgun.[7][8][9] Shortly thereafter, the two men—aged 43 and 19—were arrested and charged with felony riot and felony criminal threatening.[7][8][9]",
            "loc": "Manchester"
        },
        {
            "description": "Over 1,000 people attended a vigil at Greeley Park in Nashua on Saturday, June 6, 2020.[10]",
            "loc": "Nashua"
        },
        {
            "description": "A protest occurred in Peterborough on May 30.[5]",
            "loc": "Peterborough"
        }
    ]
},
{
    "New Jersey": [
        {
            "description": "On June 2, Attorney General Gurbir Grewal announced expanded utilization of a use-of-force database, proposed a licensing program for law enforcement, and other initiatives.[5]",
            "loc": "Demonstrations"
        },
        {
            "description": "Hundreds protested from 5 pm to 8 pm on June 1.[6] The city announced a curfew starting at 8 pm that same night.[7]",
            "loc": "Asbury Park"
        },
        {
            "description": "About 100 people protested near Tanger Outlets on May 31.[8]",
            "loc": "Atlantic City"
        },
        {
            "description": "On June 7, about 1,000 people marched, kneeled, and came together in Stephen R. Gregg Park. The protest also included a celebration of “Black Bayonne,” which included music and poetry from speakers.[9]",
            "loc": "Bayonne"
        },
        {
            "description": "On June 9, about 100 people marched from the high school down Main Street to City Hall.",
            "loc": "Bogota"
        },
        {
            "description": "May 31: Over 100 protesters gathered at an intersection in Bordentown City for a candlelight vigil and rally to show that “all lives cannot matter until black lives matter.”[10]",
            "loc": "Bordentown"
        },
        {
            "description": "June 8: About 300 protesters gathered for a protest near Windward Beach Park.[11]",
            "loc": "Brick"
        },
        {
            "description": "June 2: Protesters marched from Grover Cleveland Park to the gazebo.[12]",
            "loc": "Caldwell"
        },
        {
            "description": "Hundreds demonstrated in a peaceful march to protest police brutality in the city on May 30. Camden County Police marched alongside demonstrators. The police chief helped hold a \"Standing in Solidarity\" banner at the front of the march.[13]",
            "loc": "Camden"
        },
        {
            "description": "On June 5, Cape May County NAACP hosted a protest at Superior Court, 9 N Main St, Cape May Court House.[14]",
            "loc": "Cape May"
        },
        {
            "description": "On June 5, hundreds of people protested by symbolically lying in the street for nearly nine minutes, blocking traffic on Haddonfield Road in Cherry Hill.[15]",
            "loc": "Cherry Hill"
        },
        {
            "description": "On June 12, about 50 protesters marched from Greenfield Madison Avenue Park in Rahwah to the Clark Municipal Building where they called on Clark Mayor Sal Bonaccorso to apologize for remarks stating \"I am pro-black for all the good black people that I know in my life,\" and other off-color remarks. The mayor addressed the crowd, only saying that he was sorry if anything he said offended anyone.[16]",
            "loc": "Clark"
        },
        {
            "description": "On June 2, over 400 protesters gathered at Clifton Town Hall before marching down Clifton Avenue and Main Avenue to Passaic City Hall.[9]",
            "loc": "Clifton"
        },
        {
            "description": "On June 2, a protest occurred in Cranford.[9]",
            "loc": "Cranford"
        },
        {
            "description": "On June 12, about 200 people protested at the township's municipal center.",
            "loc": "East Brunswick"
        },
        {
            "description": "On June 6, hundreds of protesters marched from City Hall to the Union County Courthouse. Among those marching was the mother of Eric Garner, who was killed by police officers in a similar manner to George Floyd.[17]",
            "loc": "Elizabeth"
        },
        {
            "description": "More than 1,000 people rallied in Mackay Park on May 30 before peacefully marching to the Englewood Police Station.[18]",
            "loc": "Englewood"
        },
        {
            "description": "On May 31, hundreds of people protested in a march that began and ended at Franklin Middle School at Hamilton Street Campus.[19] On June 4, more than 500 people marched from Middlebush Park to protest in front of the Franklin Township Police Department.[20]",
            "loc": "Franklin"
        },
        {
            "description": "On June 8, about 70 protesters marched in Franklin Township, Gloucester County past a group of counterprotestors with All Lives Matter and Trump signs who mockingly re-enacted George Floyd's death, with one man kneeling on the neck of another. The mayor and police chief of Franklin Township condemned the display. The state Department of Corrections suspended an employee at Bayside State Prison who was confirmed to among the group and PBA Local 105, the New Jersey corrections officer union, issued a condemnation. FedEx fired an employee who participated in the counterdemonstration.[21] Peaceful\nprotesters returned to Franklinville on June 13.[22]",
            "loc": "Franklinville"
        },
        {
            "description": "June 6: Around 1,000 protesters marched from the county justice building to the Old Hunterdon County Courthouse.[24]",
            "loc": "Flemington"
        },
        {
            "description": "On May 30, about 35 people displayed signs along a highway in a demonstration called \"March on Route 9\".[25] June 2: About 300 gathered at the Monmouth County Hall of Records  on Main Street. The protest was coordinated with the Freehold Police Department, who declined to \"take a knee\" when the crowd chanted. Angry words were exchanged, but the protest remained peaceful.[26][27]",
            "loc": "Freehold Township"
        },
        {
            "description": "On May 31, a protest occurred. Police Chief John Polillo addressed the crowd.[9]",
            "loc": "Glassboro"
        },
        {
            "description": "On May 31, more than 100 protesters assembled together.[28]",
            "loc": "Glen Ridge"
        },
        {
            "description": "On June 2, more than 1000 protesters marched through the borough to the Raritan Bridge and Highland Park High School to hear community leaders speakers.[29][30]",
            "loc": "Highland Park"
        },
        {
            "description": "On June 2, a Black Lives Matter protest marched from Hightstown High School to the center of town and back. Police officers \"took a knee\" when requested.[31]",
            "loc": "Hightstown"
        },
        {
            "description": "On June 4, hundreds of protesters gathered in front of the Hackensack courthouse.[32]",
            "loc": "Hackensack"
        },
        {
            "description": "On June 1, about 50 protesters marched on Main Street between the Municipal Building and the Civil War Memorial. One counter-protester appeared.[34]",
            "loc": "Hackettstown"
        },
        {
            "description": "On May 31, more than 300 protestors marched through downtown Haddonfield in protest of police brutality.[35]",
            "loc": "Haddonfield"
        },
        {
            "description": "Protestors variously estimated at \"more than 1,000\" and \"10,000\" peacefully marched from Maxwell Place Park to Pier A Park on June 5. A group of protesters gathered at Hoboken City Hall. Most businesses had boarded their windows in fear; one business displayed a sign that read \"United\" and handed out free pizza and soda to demonstrators. Mayor Ravi Bhalla addressed the rally.[36][37]",
            "loc": "Hoboken"
        },
        {
            "description": "On June 1, hundreds marched to the South District police precinct organized by the \"Black Men United Coalition.\" Another organizer said that if looters can change the narrative surrounding protests around the country, \"bad cops\" can do the same for law enforcement.[38]",
            "loc": "Jersey City"
        },
        {
            "description": "On June 6, over 100 people participated in a protest in honor of George Floyd. The March had started at Clifton Avenue Grade School and ended at the Red square between 3rd and 4th street. It has started at 1 p.m. and ended around 3 p.m.. Police officers had supported the protest and were on standby if any violent behavior were to occur.",
            "loc": "Lakewood"
        },
        {
            "description": "On May 31, hundreds of protesters gathered at the Pier Village shopping center to chant and speak out about police injustice. At one point, they broke the chanting to kneel in silent unison in front of police.[39]",
            "loc": "Long Branch"
        },
        {
            "description": "On May 31, approximately 150 protesters waved signs along Millburn Avenue.[40]",
            "loc": "Millburn"
        },
        {
            "description": "On May 30, nearly 75 demonstrators gathered near City Hall.[9]",
            "loc": "Millville"
        },
        {
            "description": "On June 7, over 100 protesters in Monroe Township went to Thompson Park; a park shared by Jamesburg and Monroe. The protests were peaceful.",
            "loc": "Monroe Township"
        },
        {
            "description": "On June 6, an estimated 1000 people peacefully marched through the streets of Montclair and afterwards, in Crane Park, there were several people who spoke passionately to the crowd.\n[41]",
            "loc": "Montclair"
        },
        {
            "description": "On May 30, approximately 200 to 300 people drove and marched peacefully through Morristown and neighboring Morris Township.[42]",
            "loc": "Morristown"
        },
        {
            "description": "A crowd of some 12,000 protesters marched peacefully down Market Street on May 30 at a rally organized by \"People's Organization for Progress.\"[18][43]",
            "loc": "Newark"
        },
        {
            "description": "On May 30, about 300 protesters shouted \"Black Lives Matter!\" and \"No Justice, No Peace!\" at Feaster Park where the shooting of Barry Deloatch occurred in 2011.[44]",
            "loc": "New Brunswick"
        },
        {
            "description": "On June 6, approximately 300 to 400 protestors gathered on the Newton Green after hundreds marched from Memory Park along Spring Street.[45][46]",
            "loc": "Newton"
        },
        {
            "description": "On June 1, protesters met at the corner of Route 47 and Route 9 chanting “Black Lives Matter” and “I can't breathe.\"[47]",
            "loc": "Nutley"
        },
        {
            "description": "On June 2, protesters gathered in Somers Point and peacefully marched over the 9th Street Bridge towards Ocean City.[47]",
            "loc": "Ocean City"
        },
        {
            "description": "On June 14, a planned \"drive-through\" protest was planned at the (temporarily closed by Covid-19) Garden State Plaza Mall, but the police blocked all entrances and interrogated people driving up to the mall.",
            "loc": "Paramus"
        },
        {
            "description": "A rally intended for George Floyd on June 3 was attended by family members of Jameek Lowery who died after an encounter with the Paterson Police in 2019.[49][50]",
            "loc": "Paterson"
        },
        {
            "description": "On June 2, thousands protested in downtown Princeton against racism and police brutality, and called for systemic change at an event that included speeches, chanting, and marching.[51]",
            "loc": "Princeton"
        },
        {
            "description": "On May 31, protesters held a rally at City Hall demanding more transparency changes in training and more minority representation at the police department.[52]",
            "loc": "Rahway"
        },
        {
            "description": "On  June 10, two thousand people marched from the train station to the YMCA, where speakers included the Ridgewood Chief of Police, New Jersey Attorney General Gurbir Grewal, and the Bergen County Sheriff.[53]",
            "loc": "Ridgewood"
        },
        {
            "description": "On June 1, protesters met at the corner of Route 47 and Route 9 chanting “Black Lives Matter” and “I can't breathe.\"[47]",
            "loc": "Rio Grande"
        },
        {
            "description": "On June 2, protesters gathered in Somers Point and peacefully marched over the 9th Street Bridge towards Ocean City.[47]",
            "loc": "Somers Point"
        },
        {
            "description": "Daily protests have taken place outside the offices of Rep. Tom Malinowski on N. Bridge Street. Small groups start there and walk through neighborhoods and major thoroughfares in the county seat.[54]",
            "loc": "Somerville"
        },
        {
            "description": "More than 500 protesters gathered at the Crossroads North Middle School on June 2. The large group marched along Georges Road to Route 522 and back again.[55]",
            "loc": "South Brunswick"
        },
        {
            "description": "On June 2, about 200 protesters gathered at a shopping center on Route 37 and marched peacefully with police to the Ocean County courthouse.[47][56]",
            "loc": "Toms River"
        },
        {
            "description": "Several groups including Black Lives Matter gathered at the New Jersey Statehouse on May 30. Later that evening, violence and looting erupted in Downtown Trenton when various businesses were broken into and multiple police vehicles where set on fire or stolen.[57]",
            "loc": "Trenton"
        },
        {
            "description": "Roughly 1,000 demonstrators gathered at the Wayne Township Municipal Building on June 6.[58]",
            "loc": "Wayne"
        },
        {
            "description": "On June 6, West Orange Youth Caucus organized a protest that 3,000 people attended and demanded proactive policing reforms in their community. Mayor Robert Parisi was booed off stage.",
            "loc": "West Orange"
        }
    ]
},
{
    "Missouri": [
        {
            "description": "On May 31, over 100 protesters came to Freedom Corner to protest for Black Lives Matter.[1]",
            "loc": "Cape Girardeau"
        },
        {
            "description": "On June 7, around 2,000 protesters marched from the Boone County Courthouse in support of Black Lives Matter and George Floyd.[2]",
            "loc": "Columbia"
        },
        {
            "description": "One June 7, over 300 people marched from the United Nations Peace Plaza to the Harry S. Truman Courthouse to protest the death of George Floyd. At the courthouse, the protesters held a moment of silence for eight minutes and forty-six seconds.[3]",
            "loc": "Independence"
        },
        {
            "description": "Hundreds of protesters marched from the Country Club Plaza to the Westport the evening of May 29, where police used pepper spray.[4] Some protesters sat in the middle of the street, closing several streets near the intersection of J.C. Nichols Parkway and Emmanuel Cleaver II Boulevard for hours.[5] Some protesters blocked a window and picked up a type 3 traffic barricade, leading police to believe they would use it to commit violence.[6] On May 30, protestors broke glass windows and vandalized Country Club Plaza business including, Foot Locker, Victoria's Secret, H&M, The North Face, Cafe Trio, Season's 52, P.F. Chang's and other locations.[7][8] That same night 5 protestors set a police car on fire.[9] As of June 4, there have been more than 230 arrests at the protest.",
            "loc": "Kansas City"
        },
        {
            "description": "On June 1, between 1,500 and 2,000 protesters marched through the streets, arm in arm with police officers, to the City of O'Fallon Justice Center to support Black Lives Matter and George Floyd.[10]",
            "loc": "O'Fallon"
        },
        {
            "description": "On June 7, hundreds of protesters marched through downtown in support of Black Lives Matter. Protesters knelt in silence outside the Rolla Police Station for nine minutes and then read out the names of black victims of police violence and lynchings.[11][12]",
            "loc": "Rolla"
        },
        {
            "description": "On May 30 and 31, hundreds of protesters marched down Battlefield Road, carrying signs with messages protesting racial injustice. At the intersection of Glenstone and Battlefield, a group lay down on the road for several minutes screaming \"I can’t breathe!\" At least two protesters said they felt supported on Sunday by the Springfield police. One protester was arrested on Sunday by the police at his request to create awareness, but was later released.[13]",
            "loc": "Springfield"
        },
        {
            "description": "On June 3, hundred of protesters walked along First Capitol Drive and on Route 94 in support of George Floyd. Mayor Dan Borgmeyer attended the rally and spoke in support of the protesters.[14]",
            "loc": "St. Charles"
        },
        {
            "description": "On May 30, around 1,500 protesters marched downtown.[15] Protesters shut down part of Interstate 64 and Interstate 70, some setting off fireworks.[16] Protesters also blocked traffic in the downtown. One protester died after being dragged by a FedEx truck in the early morning hours of May 30 as it tried to slowly drive through North Broadway and O'Fallon Street.[17][18] On the night of Monday, June 1, four St. Louis police officers were shot during protests. A spokeswoman for the department said the officers were \"conscious and breathing\" and their \"injuries are believed to be non-life threatening.\"[19][20] On the same night David Dorn, a 77-year-old retired St. Louis police captain, was shot and killed while he was trying protect a pawn shop from being looted.[21][22] Four police officers were shot during violent protests just after midnight on Tuesday, June 2.[23][24]",
            "loc": "St. Louis"
        }
    ]
},
{
    "Nevada": [
        {
            "description": "On June 4, almost 50 people peacefully protested the death of George Floyd near the Boulder City Police Department, despite the event having been officially postponed by the organizer. There was a brief verbal quarrel with a counter-protester who stated \"All Lives Matter.\"[1]",
            "loc": "Boulder City"
        },
        {
            "description": "On June 6, almost 60 people protested outside the Nevada Legislature in support of Black Lives Matter; a pro-police counter-protest was held as well, but both protests were peaceful.[2]",
            "loc": "Carson City"
        },
        {
            "description": "At least a dozen protesters gathered together in a peaceful event on June 4.[3]",
            "loc": "Elko"
        },
        {
            "description": "On June 8, approximately 70 people held a protest in Millennium Park to support Black Lives Matter and George Floyd. A smaller pro-Second Amendment protest was held nearby, which exchanged tense words with the George Floyd protesters. Three men in Ku Klux Klan-like hoods were spotted nearby.[4]",
            "loc": "Fallon"
        },
        {
            "description": "On May 29, 2020, approximately 200 to 300 people rallied in the area of Las Vegas Boulevard and Tropicana Avenue. Hundreds of protesters gathered on the strip leading to the police arresting 80 people, including two journalists.[5] Some protesters threw water bottles and rocks at police.[6][7][8] 12 police officers were injured during the gathering.[9] The following day, crowds marched to the Regional Justice Center while a separate crowd grew near the Container Park in Downtown Las Vegas.[10] On June 2, the Las Vegas Metropolitan Police announced investigations into two separate shootings involving officers at the 2800 block of Las Vegas Boulevard South and the federal courthouse.[11]",
            "loc": "Las Vegas"
        },
        {
            "description": "On June 4, about 100 people peacefully marched the streets to City Hall to protest the death of George Floyd. Once at City Hall, the protesters took a knee, then lied down on their stomachs while shouting \"I can't breathe\" for eight minutes and forty-six seconds.[12]",
            "loc": "Mesquite"
        },
        {
            "description": "On June 7, about 100 protesters gathered at the Martin Luther King Jr. statue near the North Las Vegas Justice Court, where they listened to speakers discuss George Floyd and the importance of fighting for racial equality.[13][14]",
            "loc": "North Las Vegas"
        },
        {
            "description": "On May 30, 2020 at least 1,000 people participated in a protest in downtown Reno. Protesters drew graffiti, ignited a small fire, and burned a flag. Police vehicle windows were smashed as well as windows of a commercial building. People broke into City Hall and started a fire inside.[15] While no arrests have been made,[16] the city government issued a mandatory curfew, effective immediately.[17] Mayor Hillary Schieve declared a state of emergency,[18] and Governor Steve Sisolak activated the Nevada National Guard.[19]",
            "loc": "Reno"
        }
    ]
},
{
    "Nebraska": [
        {
            "description": "On May 31, a peaceful protest took place along the corner of N-370 and Galvin Road. Police officers joined the protesters arm in arm, with a Bellevue Police Department sergeant speaking out against corrupt officers.[1]",
            "loc": "Bellevue"
        },
        {
            "description": "In the northwest Nebraska town of Chadron, dozens of students and others voiced their solidarity with the Black Lives Matter movement.[2] The protesters carried signs and held a lie-in on June 3, 2020.[3]",
            "loc": "Chadron"
        },
        {
            "description": "A group estimated at 300 people marched towards Pioneer Park in the center of the small town, on June 1, 2020.[4] Officials said that people in a passing car sprayed protesters with \"a foul-smelling liquid that might have been urine.\"[5]",
            "loc": "Grand Island"
        },
        {
            "description": "An estimated 50 people, many of them students, and some young families, gathered June 2, 2020, in the center of Harvard, to protest the killing of George Floyd and to call attention to the work that needs to be done in their own community.[6]",
            "loc": "Harvard"
        },
        {
            "description": "On Saturday, May 30, people gathered near downtown Kearney to protest the death of George Floyd.[7]  The peaceful protesting continued with over 100 participants on Sunday, May 31, when protestors gathered at the Museum of Nebraska Art, marched to the main intersection of the town, and back.  The May 31 protests included recognition of Omaha resident, James Scurlock, who was murdered at a protest in Omaha the previous night. Small groups of protestors continued to gather throughout the first week of June.[8]",
            "loc": "Kearney"
        },
        {
            "description": "On the morning of Friday, May 29, people gathered at the State Capitol to protest.[9] In the early morning hours of May 31, people gathered at around 27th and O Streets to protest.[10] Eight police officers were injured with one requiring advanced medical treatment, several businesses and police vehicles were damaged.[11] Tear gas and rubber bullets were used, and arrests were made.[10] On May 31, Lincoln Journal-Star reporter Chris Dunker was tackled and detained by police while live-streaming.[12]",
            "loc": "Lincoln"
        },
        {
            "description": "About 300 people gathered peacefully in Norfolk on the weekend following the death of George Floyd.[5] Dozens gathered again on 13th and Norfolk Avenue on June 3, 2020, to show solidarity for the Black Lives Matter movement and to protest the death of Floyd and the fatal shooting of James Scurlock in Omaha.[13]",
            "loc": "Norfolk"
        },
        {
            "description": "Thousands of people protested on Friday, May 29 outside Crossroads Mall in West Omaha. Protests were peaceful until Omaha Police fired tear gas at protestors at 8:00pm.[14] Deputy Chief Ken Kanger stated that protestors were still peaceful as of 9:45 p.m[14] A small number of people broke the law, and 18 arrests were made due to failure to disperse. Police confined protestors in a parking lot and fired pepper balls at them because they were yelling.[14][15] The protesters relocated downtown and quickly became a riot, damaging several buildings throughout the night. Some protesters threw objects such as shoes and water bottles at police. At one point protesters surrounded a police vehicle. Two officers were injured during the riots.[16][17] Tear gas and pepper balls were used.[14]",
            "loc": "Omaha"
        },
        {
            "description": "On May 31, dozens of protesters marched from Guadalupe Center through the streets of downtown Scottsbluff to protest the death of George Floyd. A candlelight vigil was also held in Centennial Park.[20]",
            "loc": "Scottsbluff"
        }
    ]
},
{
    "Massachusetts": [
        {
            "description": "This is a list of George Floyd protests in Massachusetts, United States. Protests and demonstrations have occurred throughout the state, with protests occurring every day since May 28th in Boston.",
            "loc": "Demonstrations"
        },
        {
            "description": "More than sixty people peacefully gathered across from the police station on Saturday, May 30.[3] On June 12, local teens organized a march of more than 200 people that began at Amherst Regional High School and ended at Sweetser Park with a speak-out session for Black teenagers.[4]",
            "loc": "Amherst"
        },
        {
            "description": "About one-hundred people rallied at the Hyannis Village Green on May 30. Vigils were held outside the West Barnstable train station on May 30 and at the Falmouth Village Green on May 31.[5]",
            "loc": "Barnstable"
        },
        {
            "description": "A group of several hundred protesters gathered in Peters Park on Thursday, May 28, in what began as a peaceful demonstration, but escalated after several dozen protesters gathered outside the nearby Precinct 4 police station. Several protesters were pepper sprayed & maced.[6][7] The following day, a second large group of protestors clashed with city police, injuring four officers and resulting in ten arrests.[8] On Sunday, May 31, three large protests were held in the city, with the total number of protesters being in the thousands. Though all three began peacefully, violence broke out by nightfall, with police driving squad cars through crowds and firing tear gas without dispersal instruction.[9] Some protesters threw plastic water bottles and set off fireworks, while police used pepper spray and batons to keep crowds away from Boston Common.[10] Some stores in Downtown Crossing were damaged and had goods stolen, twenty-one police cruisers were burned or damaged, seven officers were hospitalized (with more being treated for injuries in the streets), and over forty arrests were made.[11][12]",
            "loc": "Boston"
        },
        {
            "description": "On the evening of June 2, hundreds of protesters gathered throughout the city. The protest began as a \"peace rally\" outside of the middle school, but protesters clashed with police outside of the city police's headquarters by nightfall. Protesters threw water bottles and fireworks, while police deployed tear gas. Several businesses were damaged or looted, including a Dunkin' Donuts that was broken into and set on fire.[18] Both Massachusetts State Police and National Guard forces were deployed to aid the city police, and the confrontation resulted in the MBTA Commuter Rail bypassing Brockton station.[19][20]",
            "loc": "Brockton"
        },
        {
            "description": "Protests were held on Saturday June 6 and Sunday June 7, with thousands gathering on Sunday in Cambridge Common[21], and a smaller crowd gathering on Saturday in Central Square.[22]",
            "loc": "Cambridge"
        },
        {
            "description": "Organizers held a \"peace walk\" on Sunday, May 31, marching throughout the city before ending at Government Center. The walk remained peaceful the whole time. However, an unaffiliated person did vandalize the WLNE-TV news van with the expression RIP George.[23]",
            "loc": "Fall River"
        },
        {
            "description": "On Thursday, May 28, a group of about thirty protesters peacefully gathered and crowded along sidewalks in the city.[24]",
            "loc": "Framingham"
        },
        {
            "description": "On May 30, residents from Greenfield and beyond gathered for a \"Justice for George Floyd\" rally that followed a motorcade that began in surrounding town Erving, running through Millers Falls and Turners Falls, and finally arriving at the Greenfield Common.[25]  On June 6, approximately 2,000 people marched a mile and a half from Greenfield Common to the Greenfield Police Station; for nine minutes, protestors laid on the ground or kneeled to honor Floyd.[26]",
            "loc": "Greenfield"
        },
        {
            "description": "On June 2, over 1,000 people participated in a peaceful march in Holyoke, beginning at City Hall, going on High Street, and ending in front of the police station on Appleton Street.[27]",
            "loc": "Holyoke"
        },
        {
            "description": "More than 200 people took part in a march from the Pawtucketville neighborhood across the Howe Bridge and to Lowell City Hall on June 3.[28]",
            "loc": "Lowell"
        },
        {
            "description": "A group of about twenty-five people began peacefully marching around the city in the early afternoon on Saturday, May 30. The crowd gradually grew to a size of almost one hundred protesters, until one of the leaders asked the crowd to disperse at around 9:30 pm and begin again the next day. A second, smaller crowd gathered and resumed protesting the following morning.[29]",
            "loc": "New Bedford"
        },
        {
            "description": "On Sunday, May 31, hundreds of people peacefully protested at the lawn of Newton City Hall. Mayor of Newton Ruthanne Fuller, School Committee Chairwoman Ruth Goldman, and City Council President Susan Albright were also in attendance.[30] On Thursday, June 4, hundreds of people participated in a second peaceful protest starting at the West Newton police station, in which the participants blocked traffic on Washington Street by kneeling in both directions on the street, chanting “George Floyd, say his name,” “Breonna Taylor, say her name,” and “Hands up, don't shoot.”[31] The demonstrators then marched down Washington Street and eventually reached City Hall in Newton Centre, where they concluded their protest.\nOn June 7, a protest started on the Boston College campus in Chestnut Hill, near the Chestnut Hill Reservoir. This protest targeted the Newton Police Department, and continued along Commonwealth Avenue to City Hall, some 3 miles down the road.",
            "loc": "Newton"
        },
        {
            "description": "On June 1, more than 1,000 people flooded Center Street protesting against police brutality outside the city's police station. A police cruiser's windshield was smashed, the flag in front of the police station was found burned, and some protesters wrote in chalk and spray paint on the police station resulting in multiple protestors being pepper-sprayed.[32] On June 6, \"thousands of people\" gathered again at the Northampton Police Station to protest police brutality. Both the Northampton Police Chief and the Mayor of Northampton offered to kneel with protest organizers, but were denied.[33] Despite a large presence of police departments of nearby localities and the Massachusetts State Police, the protest resulted in no violence and no arrests; once the protest mostly dissipated, noted local paper Daily Hampshire Gazette, the day ended with a dance party in the downtown streets.[34]",
            "loc": "Northampton"
        },
        {
            "description": "On May 31, scores of people protested at Waban Park on Martha's Vineyard. The mother of Danroy Henry, who was shot by Pleasantville police in 2010, said \"nothing has changed\" since then.[35]",
            "loc": "Oaks Bluff"
        },
        {
            "description": "On June 2, nearly 4,500 people held a vigil at Quincy Center in honor of George Floyd before taking part in an hour-long march down Hancock Street.[36]",
            "loc": "Quincy"
        },
        {
            "description": "A peaceful crowd gathered on May 29 in front of the police station in Salem.[37] Another protest was held in the town common on June 6.[38]",
            "loc": "Salem"
        },
        {
            "description": "On June 6, protestors met at the middle of the Iron Bridge and kneeled for nine minutes to honor Floyd.[26]",
            "loc": "Shelburne Falls"
        },
        {
            "description": "Several hundred people peacefully protested outside of the city police's headquarters on Friday, May 29.[39] On June 6, more than 100 people gathered at Court Square, where a prayer was said, to peacefully walk towards and demonstrate at the Springfield police station. More demonstrators added to the gathering at street intersections.[40]",
            "loc": "Springfield"
        },
        {
            "description": "A protest was planned to take place on the evening of June 4. Following the looting that occurred in the Brockton protest a few days earlier, many Taunton businesses boarded up their doors and windows in preparation,[41] and several helicopters and National Guard forces remained on standby around the city once the protest began. A group of about six-hundred people gathered outside of the First Parish Church across from the city's police station in the early afternoon, before most relocated to the nearby city green space, where many encouraged police officers to take a knee in solidarity. Once the officers did so, most protesters dispersed without incident.[42]",
            "loc": "Taunton"
        },
        {
            "description": "On June 1, thousands of people peacefully participated in a march from the City Hall commons area to the courthouse.[43] Hours later, a group of protesters in the Main South neighborhood met a police barricade, which led to the crowd being dispersed into two directions. A group that continued down main street were said to have set off fireworks and thrown rocks at officers, leading to tear gas and rubber bullets being fired into a crowd of about seventy people. Multiple people were taking into custody and at least one business was reported looted.[44] On June 6, hundreds gathered in Worcester Common to demonstrate.[45]",
            "loc": "Worcester"
        }
    ]
},
{
    "Michigan": [
        {
            "description": "There have been a series of George Floyd protests in Michigan. Following the death of George Floyd in police custody, protests spread from Minneapolis to other parts of the United States, including Michigan. Protests broke out in Detroit on the night of May 29 and spread to over 15 other cities over the following days.",
            "loc": "Lower Peninsula"
        },
        {
            "description": "Hundreds of protesters gathered on the central square of the University of Michigan on May 30, with a series of activists and community members using a megaphone to speak about racial injustice and police violence. That day and for several days beforehand, protesters also marched through the streets of Ann Arbor.[1] These protests were related to an event in neighboring Ypsilanti on May 26, in which a police officer had been filmed punching an Ypsilanti woman and then taking her into custody where she was held for several days.[2]",
            "loc": "Ann Arbor"
        },
        {
            "description": "On June 5, Over 200 protesters showed up in front of the Huron County building to raise awareness for the Black Lives Matter protests occurring nationwide and worldwide following the murder of George Floyd by Minneapolis police officer Derek Chauvin.[3] Bad Axe police chief David Rothe and Huron County sheriff Kelly Hanson were seen marching alongside the protesters. Police presence was able to maintain peace despite numerous individuals showing up to oppose the protest until crowds started to disperse at around 6 PM. The event, coordinated by multiple local and national civic groups, was described as being well organized, peaceful, and focused.",
            "loc": "Bad Axe"
        },
        {
            "description": "About 100 people marched from Clisbee Park to the police station on Broadway at 3pm on June 13, 2020.[4][5][6]",
            "loc": "Cassopolis"
        },
        {
            "description": "On June 7, hundreds of demonstrators surrounded the Dearborn Historical Museum in Dearborn to peacefully protest against racism and police brutality.[7] Most protesters wore masks to protect against the spread of COVID-19. The crowd listened to speakers prior to marching down Brady Street and across Michigan Avenue while chanting \"No justice, no peace\". Demonstrators also celebrated the removal of the statue of former Dearborn mayor Orville Hubbard, known for his support of racism and segregation. The statue's removal came days after the statue had a Black Lives Matter T-shirt placed over it. Moving forward, protesters look forward to removing his name from streets, ballrooms, and buildings nearby. Speakers at the protest included Debbie Dingell, the U.S. representative for Michigan's 12th congressional district, Rashida Tlaib, the U.S. representative for Michigan's 13th congressional district, and Abdullah Hammoud, the state representative for Michigan's 15th district.",
            "loc": "Dearborn"
        },
        {
            "description": "Hundreds protested in downtown Detroit starting on May 29. Some protesters were seen throwing items at police officers and taunting them.[8] At least 61 people were arrested.[9] On the night of May 29 an unknown assailant fired shots into a vehicle downtown around 11:30 pm; a 21-year-old Eastpointe man in the vehicle was hit and died from his injuries at a local hospital.[10] It was initially thought that this man was 19 years old and that the assailant fired from a vehicle; this was later proven otherwise.[11][12][13] On Sunday night, mayor Mike Duggan imposed a curfew from 8 pm to 5 am Monday[14] and more than 100 people were arrested.[15] On June 1, a ten-mile march was attended by several hundred protesters that spanned from downtown Detroit to the city's southwest boundary.[16] Protesters ignored Detroit's 8pm curfew with authorities taking no actions against protesters, allowing the demonstrations to end peacefully.[16]",
            "loc": "Detroit"
        },
        {
            "description": "Hundreds of protesters shut down Miller Road in the Flint Township on May 30.[17] Genesee County Sheriff Chris Swanson spoke to the crowd saying he wanted to stand in solidarity with the protesters.[18] On June 1, hundreds gathered for a peace rally at Flint City Hall. One protester said: \"Justice for George, this is all for George.\"[19]",
            "loc": "Flint"
        },
        {
            "description": "Thousands of demonstrators marched in downtown Grand Rapids on Saturday, May 30.[20][21] The protesters initially gathered at Rosa Parks Circle for a silent protest while other demonstrators moved to the headquarters of the Grand Rapids Police Department where interactions intensified.[20] That same day, Grand Rapids police chief Eric Payne spoke to protesters stating \"I've heard you my entire career. Black lives do matter\", with clashes later intensifying with protesters beginning to throw objects at police.[20] Riot police dispersed demonstrators with tear gas and flash bangs.[22] A viral video from the protests showed Grand Rapids Police pepper spraying a protester and then immediately firing a tear gas canister into his shoulder.[23][24] Into the early morning hours of May 31, looting and fires began to spread through downtown Grand Rapids.[21] Mayor of Grand Rapids Rosalynn Bliss enforced a 7pm-5am curfew for the city beginning that day until June 2, calling for support from the Michigan National Guard.[25] Citizens also arrived downtown during the day to assist with clean-up efforts following the riots.[26] Only a few protesters were arrested on Sunday for violating the city's curfew.[25]",
            "loc": "Grand Rapids"
        },
        {
            "description": "Two protests on May 30 in Kalamazoo brought in thousands of protesters with both protests shutting down major traffic intersections and were peaceful.[31][32] On June 1, peaceful protests occurred into the evening.[33] Vandalism then began to occur overnight, damaging a number of businesses in the city.[33] Kalamazoo officials established a 7pm curfew on June 2.[33] Protests occurred again that day, with about 100 protesters staying past the 7pm curfew to confront a National Guard barricade on Michigan Avenue.[33] Assistant Chief Vernon Coakley Jr. and City Manager Jim Ritsema spoke with protesters for about forty minutes after the curfew, attempting to have them march away from the site with no success.[33] Tear gas was then deployed and the protest dispersed, with Coakley later stating that he \"felt awful\" for firing chemical agents upon a peaceful demonstration.[33]",
            "loc": "Kalamazoo"
        },
        {
            "description": "On May 31, crowds of about 200 people marched from Bluegrass Road and Mission Street in Mount Pleasant until they reached Broadway Street as part of a peaceful protest against racism and police brutality.[42] Once there, protesters laid down before chanting \"I can't breathe\". On June 1, community members (including hundreds of students and faculty at Central Michigan University) participated in a peaceful protest. The protest started at Bovee University Center and ended at the Isabella County Sheriff's Office.[43] Protesters chanted about the injustices they were condemning and their desire for justice and peace. The protesters had the full support of the university and coordinated with police prior to the protest, arranging for police escorts throughout the march.",
            "loc": "Mount Pleasant"
        },
        {
            "description": "On June 9, hundreds of protesters (estimates range from 500 to 1000) marched from the Washtenaw County's sheriff office in Pittsfield Township to the Arborland shopping center to demand justice for George Floyd and for Sha'Teina Grady El, a woman from nearby Ypsilanti Township that was caught on camera being hit 3 times by a deputy during an arrest the previous month.[44] Prior to arriving at Arborland, the demonstrators stopped at the intersection of Washtenaw Avenue and Carpenter Road to kneel and chant \"Say his name, George Floyd\", \"Breonna Taylor\", and \"No justice, no peace\" as part of a march to emphatically denounce police brutality. The director of public safety at Pittsfield Township's police department, Matt Harshberger, and the department's public safety community coordinator, Ritchie Coleman, also participated in the kneeling. Organizers of the protest urged demonstrators to vote and helped people register to vote at a makeshift booth they had set up.",
            "loc": "Pittsfield Township"
        },
        {
            "description": "Hundreds of demonstrators showed up outside of the Municipal Office Complex on June 5 to protest the death of George Floyd, racial injustice, and police brutality.[45] The protesters gathered at Pine Grove Park and headed toward downtown Port Huron. The organizers made an effort to help unregistered voters to be able to vote in the upcoming 2020 presidential election.",
            "loc": "Port Huron"
        },
        {
            "description": "On May 31, protesters began a 72-hour occupation of the area outside the Saginaw Police Department in a demonstration called \"Stand with the Ghost of George Floyd.\"[46] On June 2, the demonstrators marched from Hoyt Park to the Saginaw County Governmental Center building, blocking the Court Street Bridge in the process. They demanded reforms to law enforcement, which included de-militarization and mandatory mental illness and de-escalation training for police officers.[47]",
            "loc": "Saginaw"
        },
        {
            "description": "On June 6, an estimated 5000-10000 peaceful protesters marched eastbound on Hall Road in Sterling Heights while chanting \"Black Lives Matter\", \"Hands up, don't shoot\", and \"No justice, no peace\".[48] Sterling Heights' police chief Dale Dwojakowski stated that the protest went through four or five jurisdictions and no arrests were made; however, police refused to join protesters in kneeling. The protest was organized by three high school girls from Chippewa Valley High School who, along with Eastpointe Mayor Monique Owens, made sure to urge protesters to vote to ensure lasting change. The protest came in the aftermath of Shelby Township police chief Robert J. Shelide being placed on leave for inflammatory social media posts; he called for \"body bags\" for \"vicious subhumans\" involved in nationwide protests over George Floyd's murder at the hand of Minneapolis police officers. Protesters widely condemned his comments at the demonstration, though Dwojakowski declined to answer if he felt Shelide deserved to be fired for them.",
            "loc": "Sterling Heights"
        },
        {
            "description": "On June 6, hundreds gathered in a peaceful protest in Traverse City to have open conversation on unity and racial inequality.[49] The protest started with a nine-second moment of silence to commemorate the almost nine minutes that Minneapolis police officer Derek Chauvin kneeled on George Floyd's neck, leading to Floyd's death. Both organizers and law enforcement spoke on not being afraid to have conversations on race and not being silenced in fear of confrontation. Traverse City police chief Jeff O'Brien stated \"I used to think there's no problem here, but there really is a problem. This issue really is our nation's original sin and we've got to get over that. We have to make sure that equality prevails.\" He went on to acknowledge that change would have to begin with law enforcement officers holding each other accountable to eliminate the origin of racial inequality and showing loyalty and commitment to the rule of law over loyalty to fellow officers. The protest started at Open Space Park and moved to Grandview Parkway.[50] Speakers asked each demonstrator to support the cause with their vote for their city government.",
            "loc": "Traverse City"
        },
        {
            "description": "On June 1, police blocked off traffic on Big Beaver Road as hundreds of protesters marched to the Troy police station while chanting \"Black Lives Matter\" and the names of people recently killed by police.[51] The organizers of the march addressed the crowd, imploring them to vote in the upcoming 2020 presidential election and to continue the momentum of the George Floyd protests as well as the Black Lives Matter movement as a whole. The march was peaceful, although Troy police announced via its Twitter account that a 68 year old Troy man was charged with felonious assault for intentionally striking a protester with his car. The protester did not appear to sustain any injuries. On June 5, roughly 1500 demonstrators, including students from Troy High School, Troy Athens High School, and the International Academy East, marched from Troy Athens High School to City Hall to protest the killing of George Floyd by an ex-Minneapolis police officer and called for greater police reform.[52] The mayor of Troy, Ethan Baker, stated the police department's use of force, training, hiring and community relations will be reviewed to determine if any policy changes would be necessary.",
            "loc": "Troy"
        },
        {
            "description": "On June 2, more than 100 protesters led a peaceful march along Van Dyke Avenue in Warren to protest George Floyd's murder, racism, and police brutality.[53] Protesters chanted \"Black Lives Matter\", \"Say his name, George Floyd\" and \"I can't breathe\" while marching as cars and bystanders cheered them on; police escorts and the city's mayor and police commissioner were also present. Warren's mayor Jim Fouts called the video of officer Derek Chauvin kneeling on Floyd's neck \"shocking\" and stated \"If that happened in Warren, it would be unacceptable and the officers would be removed.\"",
            "loc": "Warren"
        },
        {
            "description": "On May 28, about 100 protesters gathered at the Washtenaw County Sheriff's Office to protest the incarceration of Ypsilanti woman Sha'Teina Grady El after a police officer had been filmed punching her on May 26, the day after George Floyd's death.[2] These protests were closely linked to the protests in neighboring Ann Arbor that week.[54] Protests continued in Ypsilanti over the subsequent week, with contention over the significant participation by Ypsilanti Police Chief Tony DeGiusti.[55]",
            "loc": "Ypsilanti"
        },
        {
            "description": "On May 28, about 100 protesters gathered at the Washtenaw County Sheriff's Office to protest the incarceration of Ypsilanti woman Sha'Teina Grady El after a police officer had been filmed punching her on May 26, the day after George Floyd's death.[2] These protests were closely linked to the protests in neighboring Ann Arbor that week.[54] Protests continued in Ypsilanti over the subsequent week, with contention over the significant participation by Ypsilanti Police Chief Tony DeGiusti.[55]",
            "loc": "Upper Peninsula"
        },
        {
            "description": "On June 3, hundreds of demonstrators of all ages and races marched across the Portage Lake Lift Bridge in Houghton while chanting \"No justice, no peace\", \"Black Lives Matter\", and \"Say his name, George Floyd\" in protest of police brutality.[56] The protest was entirely peaceful, and organizers worked with local police departments to make sure the proceedings went on safely and civilly; the police handed out flowers as a peace offering.",
            "loc": "Houghton"
        },
        {
            "description": "A number of protesters gathered outside Marquette's post office on May 29.[57] On May 30, a protest march started at Northern Michigan University and proceeded towards the city's downtown; a protester briefly stood on the hood of a city police SUV, but no arrests were reported.[58] On May 31, over 150 people took part in another protest that covered 20 blocks and ended at a county sheriff's office.[59] On June 1, about 200 protesters marched on the streets to peacefully protest against racial injustice.[60]",
            "loc": "Marquette"
        },
        {
            "description": "On June 1, about 200 people protested on the corner of Ashmun and Portage in downtown Sault Ste. Marie.[61]",
            "loc": "Sault Ste. Marie"
        }
    ]
},
{
    "Maryland": [
        {
            "description": "Maryland has seen a series of George Floyd protests with hundreds to thousands of participants marching in demonstrations statewide.",
            "loc": "Background"
        },
        {
            "description": "On May 29, 2020, Maryland Governor Larry Hogan stated thought it was a tragic situation but that it is not \"a fair comparison\" to the death of Freddie Gray.[3] Hogan also said that Donald Trump's \"inflammatory rhetoric isn't going to help.\"[4] Marilyn Mosby defended her decision to charge officers in the Gray case after a quick investigation, despite criticism from Michael O. Freeman, the County attorney of Hennepin County, Minnesota.[5]",
            "loc": "Government"
        },
        {
            "description": "On May 30, over 100 protesters held a rally and march through Main Street.[7][8] On June 5, approximately 200 people protested at the Alex Haley Memorial outside the Annapolis Market House chanting the names of Floyd and other black Americans killed by police violence.[9]",
            "loc": "Annapolis"
        },
        {
            "description": "On May 29, protesters at the Inner Harbor blocked traffic on Light Street near 7:00 pm. The demonstration continued to Baltimore City Hall.[11] On May 30, hundreds of protesters gathered outside Baltimore City Hall on Saturday night, for the second night. Protesters were mainly peaceful, with some reports of arrests and a police car window smashed. A car caravan protest also occurred.[12][13]",
            "loc": "Baltimore"
        },
        {
            "description": "On June 1, teens were hanging racial justice posters when they were accosted by a bicyclist, later identified as Anthony Brennan III by the Maryland-National Capital Park Police.[20][21] In footage of the encounter, the man is seen to grapple with a girl over her posters and to use his bicycle as a weapon to ram the person filming the encounter. Park Police had requested the help of the public in identifying the unknown assailant.  The suspect was arrested and charged with three counts of second-degree assault.[22][23]",
            "loc": "Bel Air"
        },
        {
            "description": "On June 2, students from Walt Whitman High School organized a rally of hundreds through downtown Bethesda to protest the death of George Floyd.[24]",
            "loc": "Bethesda"
        },
        {
            "description": "On June 2, thousands of protesters peacefully marched from The Mall in Columbia through downtown in the late afternoon, holding a vigil and reading off the names of victims of police brutality. Calvin Ball III, the Executive of Howard County, was among the protesters.[25]",
            "loc": "Columbia"
        },
        {
            "description": "On May 31, over 100 peaceful protesters marched on the streets of Germantown. Montgomery County police facilitated the protest with some officers taking a knee in solidarity.[26]",
            "loc": "Germantown"
        },
        {
            "description": "About 100 people gathered in downtown Hagerstown on May 31 to protest the death of George Floyd. On June 7, another protest with more than 100 protesters marched past The Maryland Theater holding signs and chanting before gathering for speakers at Fairgrounds Park.[27]",
            "loc": "Hagerstown"
        },
        {
            "description": "On June 2, dozens of Leisure World residents protested along Georgia Avenue while practicing social distancing.[28]",
            "loc": "Leisure World"
        },
        {
            "description": "On June 3, protesters marched alongside police offers from the Pocomoke City Police Department. Demonstrators marched from the Pocomoke City Police Department to Cypress Park, where a prayer and vigil honoring George Floyd was held.[29]",
            "loc": "Pokomoke City"
        },
        {
            "description": "On June 4, dozens of protesters held a peaceful demonstration in downtown Salisbury to protest the death of George Floyd and demand action from police and city officials.[30]",
            "loc": "Salisbury"
        }
    ]
},
{
    "Maine": [
        {
            "description": "On June 7, over 1,000 protesters marched around Capitol Park and the Augusta Police Department. They also lied down in front of the state house for nine minutes in memory of George Floyd.[1]",
            "loc": "Augusta"
        },
        {
            "description": "May 31: A group gathered at the University of Maine to promote a message of racial equality.[2] June 1: Hundreds gathered at the Bangor Public Library and Peirce Park. Harlow Street was closed so the crowd could listen to speakers.[3][4]",
            "loc": "Bangor"
        },
        {
            "description": "May 31: Around 200 people gathered at Post Office Square, protesters peacefully gathered. A man tried to drive his car into the group of protesters, however there were no injuries reported.[5]",
            "loc": "Belfast"
        },
        {
            "description": "June 3: A gathering formed at the Camden Village Green  to express grief and outrage over the killing of George Floyd. Political, religious and law enforcement officials were asked to speak.[6]",
            "loc": "Camden"
        },
        {
            "description": "June 1: About 40 protesters marched down Herschel Street in Caribou against the killing of George Floyd.[7]",
            "loc": "Caribou"
        },
        {
            "description": "June 6: Hundreds marched from Gowen Park to the police station where the city's curfew has been called \"unconstitutional\" by the ACLU.[16]",
            "loc": "Lewiston"
        },
        {
            "description": "June 4: Roughly 300 people marched from South Portland High School to the South Portland Police station.[17] Organized by students of the high school, several speakers in the community were invited to address the crowd – including the Chief of Police, Timothy Sheehan.",
            "loc": "Portland"
        }
    ]
},
{
    "Louisiana": [
        {
            "description": "On May 31, dozens of protesters walked peacefully through downtown Alexandria chanting for \"justice, peace, and equality.\"[1] On June 2, another crowd held a protest at the Rapides Parish Courthouse, and on June 3, several hundred protesters marched to the Alexandria Public Safety Complex.[2]",
            "loc": "Alexandria"
        },
        {
            "description": "May 30: A vigil was held at a church.[3] May 31: hundreds marched to the Louisiana State Capitol building.[4] Additional protests took place on Siegen Lane on the evenings of May 31, June 1, and June 2.[5][6][7]",
            "loc": "Baton Rouge"
        },
        {
            "description": "May 31: Several hundred people peacefully protested at a rally held at the corner of University Avenue and Johnston Street by the campus of the University of Louisiana at Lafayette.[8] After listening to speeches in Girard Hall, the crowd lined the sidewalks for a demonstration before marching to the Lafayette police station at the end of University Avenue.[9]",
            "loc": "Lafayette"
        },
        {
            "description": "May 31: About 300 people attended a peaceful protest rally at the corner of Broad Street and Enterprise Boulevard.[10]",
            "loc": "Lake Charles"
        },
        {
            "description": "May 31: Hundreds of people gathered peacefully for a rally at the Monroe Civic Center, organized by the local NAACP chapter. After hearing some speeches, about half of the attendees left on an unplanned march through the downtown area and in front of the Ouachita Parish Courthouse.[11]",
            "loc": "Monroe"
        }
    ]
},
{
    "Puerto Rico": []
},
{
    "Kentucky": [
        {
            "description": "People protested outside the Bowling Green Police Department the evening of May 29.[4] During the protest, a 24-year-old man hit a protester with his pickup truck and was arrested;[4] police stated that he \"had plenty of room... to avoid hitting protesters,\" and that when they asked if his vehicle had hit the protester, the man replied, \"Probably so, there were protesters blocking the fucking road, they deserved to be hit, anyone would.\"[4] He was arrested, charged with wanton endangerment in the first degree (a felony in Kentucky), and taken to Warren County Regional Jail.[4][5]",
            "loc": "Bowling Green"
        },
        {
            "description": "About 140 people attended a peaceful protest on June 4, with some hecklers calling the group \"race traitors\" and displaying the Confederate flag.[6]",
            "loc": "Corbin"
        },
        {
            "description": "Dozens attended an \"uneventful\" protest happened on May 31. City officials enacted a curfew.[7]",
            "loc": "Covington"
        },
        {
            "description": "On June 6, hundreds of protesters walked for two miles along Dixie Highway to the Elsmere Police Department to support George Floyd and Breonna Taylor.[8]",
            "loc": "Elsmere"
        },
        {
            "description": "On May 31, several hundred protesters gathered downtown for the third night in a row. At one point late Sunday, dozens of officers \"took a knee\" with protesters who were chanting \"Kneel with us! Kneel with us!\"[9] On June 5, the sixth day of protests in downtown Lexington, members of the Kentucky football team, wearing Black Lives Matter T-shirts and led by their head coach, Mark Stoops marched to demand racial justice and equality.[10] On June 7, a fight occurred at the intersection of East Maxwell and South Limestone when a white male passenger got out of an Uber vehicle and confronted protesters.[11] On June 12, Students, faculty, and staff  from the University of Kentucky Colleges of Medicine, Dentistry, Pharmacy, Nursing, Health Sciences, Public Health and Social Work all got on one knee in remembrance of George Floyd, Breonna Taylor, and Ahmad Arbery and to show support to end systemic racism.[12]",
            "loc": "Lexington"
        },
        {
            "description": "On May 28, protesters demanded justice for the fatal shooting of Breonna Taylor. Some 500 to 600 demonstrators marched through the city that evening.[13] Later during the protest, seven people were shot by an unknown shooter or shooters, with one victim critically injured.[14] During the night of May 29, more protests took place, attended by hundreds of people. A woman suffered a heart attack as a result of tear gas inhalation,[failed verification] and two journalists were injured by rubber bullets fired by police officers.[15] On May 30, the governor called in the National Guard.[16] African-American David McAtee was shot and killed by law enforcement just after midnight June 1. Officials said that the Louisville Metro Police Department and Kentucky National Guard were returning fire after being fired at from the crowd.[17][18] Mayor Greg Fischer stated that Louisville police officers were wearing body cameras, but none of them were on.[19] Fischer called this an \"institutional failure,\"[a] stating that \"[t]his is the entire reason we have those cameras,\" and fired Steve Conrad, chief of police, effective immediately.[19] On the 12th day of protests, current and former Public Defenders marched through downtown chanting \"no justice, no peace\" to protest racial injustice in criminal justice system.[20]",
            "loc": "Louisville"
        },
        {
            "description": "On June 6, a crowd of about 250 people marched down Main Street and gathered at Fountain Park in Morehead in a peaceful protest. The speakers told their stories and allies spoke of the need for allies to support blacks in the community.[6]",
            "loc": "Morehead"
        }
    ]
},
{
    "Wyoming": [
        {
            "description": "Approximately 300 protesters marched peacefully through downtown Casper.[1]",
            "loc": "Casper"
        },
        {
            "description": "On Friday evening, May 29, about 125 protesters attended a candlelight vigil near the steps of the state capitol.[2] There were protests held on May 30 and 31.[3]",
            "loc": "Cheyenne"
        },
        {
            "description": "On June 7, hundreds of protesters gathered in City Park, where they were surrounded by armed ex-police and military officers, but with no active police presence. The protesters held a moment of silence to honor George Floyd before marching peacefully around the park.[4]",
            "loc": "Cody"
        },
        {
            "description": "Approximately fifty people held a protest on June 2.[5]",
            "loc": "Gillette"
        },
        {
            "description": "Over 150 people protested peacefully at Town Square on May 31.[6]",
            "loc": "Jackson"
        },
        {
            "description": "Over 100 protesters marched through Laramie on June 2.[5] On June 4, hundreds of protestors walked the streets of downtown Laramie, with more events planned throughout the upcoming week.[7]",
            "loc": "Laramie"
        },
        {
            "description": "About 100 protesters gathered at a park on June 1.[8]",
            "loc": "Riverton"
        },
        {
            "description": "About 10 people protested peacefully on Dewar Drive.[9][10]  One protested admitted he thought he would be pelted with eggs, but stated that people had been honking their horns or waving their hands to show support.[9]  One protester, however, stated that there was some resistance, and that they were followed after they were done protesting.[10]  On the other side of the street, near the Rock Springs Chamber of Commerce, another protest began with protesters holding signs saying \"All Lives Matter\" and \"Support Our Police.\"[9]  One of the protesters claimed that they were not protesting the protestors.[9]",
            "loc": "Rock Springs"
        },
        {
            "description": "On June 5, about 500 people peacefully marched from the Sheridan County Fulmer Public Library to the Sheridan County Courthouse and back in support of Black Lives Matter. There was some animosity with some counter-protesters.[11]",
            "loc": "Sheridan"
        }
    ]
},
{
    "West Virginia": [
        {
            "description": "As many as 50 protesters met at the corner of Robert C. Byrd Drive and Neville Street on Sunday, May 31, for a peaceful demonstration.[1]",
            "loc": "Beckley"
        },
        {
            "description": "A group of protesters marched around the West Virginia State Capitol complex on May 30.[2] Hundreds of people protested police brutality outside of Charleston City Hall and the Charleston Police Department on May 31.[3]",
            "loc": "Charleston"
        },
        {
            "description": "There were two protests in Huntington on May 30, one at Ritter Park and a second one at Pullman Square.[2]",
            "loc": "Huntington"
        },
        {
            "description": "A large group marched through the streets of downtown Fairmont with police on the scene on May 30.[2] Hundreds filled the streets.[4]",
            "loc": "Fairmont"
        },
        {
            "description": "Protesters gathered on the downtown campus of West Virginia University on May 30.[2]",
            "loc": "Morgantown"
        },
        {
            "description": "On May 31, a crowd of protesters peacefully marched through downtown Parkersburg. Although they did not have a permit to protest, no arrests were made.[5]",
            "loc": "Parkersburg"
        },
        {
            "description": "On June 6, protesters peacefully demonstrated against police brutality outside the Weirton Community Center.[6]",
            "loc": "Weirton"
        },
        {
            "description": "Hundreds of people participated in a protest on May 31 in downtown Wheeling.[7]",
            "loc": "Wheeling"
        }
    ]
},
{
    "Washington (state)": [
        {
            "description": "Protests over the death of George Floyd have been ongoing in the state of Washington since May 29, 2020.",
            "loc": "Protests"
        },
        {
            "description": "On May 29, a vigil occurred at the Bellingham Public Library where a memorial was set up. A march took place in Bellingham the following day. On June 2, a small gathering took pace at the library memorial while several hundred protesters gathered at Railroad Avenue and Holly Street.[14]",
            "loc": "Bellingham"
        },
        {
            "description": "On May 29, a vigil occurred at the Bellingham Public Library where a memorial was set up. A march took place in Bellingham the following day. On June 2, a small gathering took pace at the library memorial while several hundred protesters gathered at Railroad Avenue and Holly Street.[14]",
            "loc": "Cascades"
        },
        {
            "description": "On June 6, about 7,000 protesters gathered at Maritime Heritage Park in solidarity with Black Lives Matter.[15]",
            "loc": "Eastern Washington"
        },
        {
            "description": "On May 30, more than 50 protested in dismal weather at the intersection of Highway 20 and Beeksma Drive.[34]",
            "loc": "Oak Harbor"
        },
        {
            "description": "On May 30, over 150 gathered at the Washington State Capitol in Olympia.[35] In the days following the protest a fake advertisement circulated around social media titled \"Get Paid to be a Professional Anarchist,\" featuring Antifa symbolism and listing the contact information for the Thurston County Democrats.[36] On June 5, a photograph of an Olympia Police officer posing with a group of armed civilians making a hand gesture associated with the Three Percenters group was shared on Twitter and Facebook. The police department announced it would investigate the photograph, for which Interim Police Chief Aaron Jelcick apologized.[37]",
            "loc": "Olympia"
        },
        {
            "description": "On May 30, over 150 gathered at the Washington State Capitol in Olympia.[35] In the days following the protest a fake advertisement circulated around social media titled \"Get Paid to be a Professional Anarchist,\" featuring Antifa symbolism and listing the contact information for the Thurston County Democrats.[36] On June 5, a photograph of an Olympia Police officer posing with a group of armed civilians making a hand gesture associated with the Three Percenters group was shared on Twitter and Facebook. The police department announced it would investigate the photograph, for which Interim Police Chief Aaron Jelcick apologized.[37]",
            "loc": "Olympic Peninsula"
        },
        {
            "description": "More than 200 people protested peacefully for four hours outside Renton City Hall.[42][43] Protesters laid on the ground face down for nine minutes.[42] Firearms including shotguns and semiautomatic rifles were displayed in public during protests in Renton on June 2.[44]",
            "loc": "Renton"
        },
        {
            "description": "More than 200 people protested peacefully for four hours outside Renton City Hall.[42][43] Protesters laid on the ground face down for nine minutes.[42] Firearms including shotguns and semiautomatic rifles were displayed in public during protests in Renton on June 2.[44]",
            "loc": "San Juan Islands"
        },
        {
            "description": "As of June 8, 2020[update] there were eleven straight days of \"major protests\" in Seattle and Washington State, according to The Seattle Times and other news outlets.[46][47] Associated Press reported the ongoing protests were \"among the largest the city has seen in years\".[48]",
            "loc": "Seattle"
        },
        {
            "description": "At least 55 people were arrested in Seattle during the May 30 riots.[120]",
            "loc": "May 30 riots"
        },
        {
            "description": "After meeting with Mayor Jenny Durkan on June 6, Black Lives Matter Seattle-King County called for a statewide general strike and silent protest march on June 12. The demands of the protest would be for police to keep their body cams on during protests and stop the sweeps of homeless camps, and for the City of Seattle to divest $100 million of the police budget used for militarization of police and invest the money into social services, to drop their lawsuit against King County over the inquest process, to require that \"'Community Oversight' be a part of the police contract bargaining process,\" and to develop and fund a Black Commission to address racial issues going forward.[73]",
            "loc": "Continued protests"
        },
        {
            "description": "On June 6, about 4,000 people gathered at Cromwell Park, next to the King County courthouse in Shoreline, Washington. Students from the Black Student Union at Shorewood High School gave speeches.[77]",
            "loc": "Shoreline"
        },
        {
            "description": "On June 6, about 4,000 people gathered at Cromwell Park, next to the King County courthouse in Shoreline, Washington. Students from the Black Student Union at Shorewood High School gave speeches.[77]",
            "loc": "Skagit Valley"
        },
        {
            "description": "In neighboring Lake Forest Park, Washington, local activist group Lake Forest Park for Peace resumed their weekly protests on June 6, in support of Black Lives Matter. The group had held weekly protests since 2002 against wars in Afghanistan and Iraq but had gone on hiatus due to the COVID-19 pandemic.[78]",
            "loc": "Snohomish County"
        },
        {
            "description": "Hundreds marched in Tacoma on May 30.[97] The Washington National Guard was deployed to protect the City-County building in Tacoma on June 4 through June 8.[98]",
            "loc": "Tacoma"
        }
    ]
},
{
    "Wisconsin": [
        {
            "description": "Over one thousand people gathered in downtown Appleton on May 30 and 31 for a peaceful protest down College Avenue to Houdini Plaza and the Appleton Police Department.[1]",
            "loc": "Appleton"
        },
        {
            "description": "Hundreds marched from Phoenix Park to Owen Park through downtown Eau Claire on May 31.[2]  On June 5 another rally was held in Phoenix Park followed by a march of reportedly thousands through the streets of downtown Eau Claire. [3]",
            "loc": "Eau Claire"
        },
        {
            "description": "On the evening of May 30 and the afternoon of May 31, there were peaceful protests held in downtown Green Bay. However, on the evening of the 31st, a Marathon gas station was looted, and several shots were fired. The police began firing rubber pellets at the protesters, at which point, the crowd began throwing rocks at the police. Police dispersed the crowd with gas.[4][5] On June 7, an estimated 1000-2500 people showed up to march across the Walnut Street Bridge and protest police brutality after the killing of George Floyd, making it the largest protest in recent Green Bay history.[6] The crowds were so big that the intended path for the protest, walking from Leicht Memorial Park to the Green Bay Police Department, needed to be scrapped.  Organizers stated that activists from groups that were not previously familiar with one another united as a form of grieving and solidarity in the hope to achieve wide-scale police reform. The protest was completely peaceful, with no arrests or incidents of looting and vandalism reported. Activists later took to City Hall looking to remove a curfew put in by Green Bay police, mayor Eric Genrich and the majority of city council members; the curfew was set to curb looting and vandalism that had occurred at times from previous protests.",
            "loc": "Green Bay"
        },
        {
            "description": "Between 100 and 125 demonstrators peacefully marched through downtown Kenosha on May 31.[7] Members of the City Council supported the peaceful protests while condemning the violent ones in Milwaukee.[8]",
            "loc": "Kenosha"
        },
        {
            "description": "On the evening of May 29 and 30, 2020, there were peaceful protests held in downtown La Crosse.[9] June 3: Nearly 700 protesters marched from Riverside Park and to City Hall.[10] Demonstrators kneeled for nine minutes and speakers talked about their own local experiences of racism.[11] In response the Lac Crosse Police Department launched a \"transparency tab\" on their website to better inform the public on how they operate.[12]",
            "loc": "La Crosse"
        },
        {
            "description": "On May 30, there was a peaceful demonstration at the State Capitol with around 1000 attendees. As the evening progressed, it evolved into a minor riot with some storefronts on State Street being damaged, and a conflict with police that was met with tear gas. A neighborhood curfew was declared by Mayor Satya Rhodes-Conway.[13]",
            "loc": "Madison"
        },
        {
            "description": "On the early afternoon of June 3, a peaceful protest was held on Stephenson Island, which is on the state line between Wisconsin and Michigan and alongside US HWY 41. Close to 100 protestors attended.[14] Some local businesses were boarded up and closed for the day, and another business had volunteer personal in army camouflage, armed with semi-automatic rifles standing-by. Many drove by flipping the bird and swearing at protestors but no violence erupted.[15]",
            "loc": "Marinette"
        },
        {
            "description": "In Milwaukee, as of June 9, protesters have been demonstrating for 12 days. [16]",
            "loc": "Milwaukee"
        },
        {
            "description": "On the afternoon of May 29, approximately 150 to 200 people participated in a protest near the Marathon County Courthouse in downtown Wausau.[21]",
            "loc": "Wausau"
        }
    ]
},
{
    "Richmond, Virginia": [
        {
            "description": "Humberto Cardounel\nMark Herring\nDavid R. Hines\nJeffrey S. Katz\nRalph Northam\nAnthony S. Pike\nLevar Stoney\nWilliam C. Smith",
            "loc": "Background"
        },
        {
            "description": "Richmond, Virginia has seen a series of George Floyd protests. The city was the first city in the Southeastern United States to see a riot over the killing of George Floyd. Richmond has seen arson, looting, and vandalism particularly to confederate monuments along Monument Avenue.",
            "loc": "Demonstrations"
        },
        {
            "description": "On May 25, 2020, George Floyd, a 46-year-old black man, was killed in Minneapolis, Minnesota, during an arrest for allegedly using a counterfeit bill.[1] Floyd was apprehended by Derek Chauvin, a white now ex-police officer, who knelt on Floyd's neck for almost nine minutes while Floyd was handcuffed. While Chauvin knelt on Floyd's neck, Floyd was begging for his life and repeatedly saying \"I can't breathe\".[2][3]\nChauvin was on patrol with three other Minneapolis Police officers: J. Alexander Kueng, Thomas Lane, Tou Thao. Kueng, Lane, and Thao further restrained Floyd, while also preventing bystanders from intervening on the arrest.[4][5]:6:24 During the final three minutes Floyd was motionless and had no pulse[6][7]\nwhile Chauvin ignored onlookers' pleas to remove his knee, which he did not do until medics told him to.[8]:7:30",
            "loc": "May"
        },
        {
            "description": "Despite the city-wide curfew, protests continued into the early morning hours of June 1. Approximately 100 to 200 protesters were arrested.[26] Police reports indicated that there was less damage sustained than previous nights.[27] It was reported that several dumpsters, cars, and additional buildings were set on fire.[28]",
            "loc": "June"
        }
    ]
},
{
    "Virginia": []
},
{
    "Utah": [
        {
            "description": "More than 100 people gathered and marched in downtown Cedar City on Sunday, May 31. During the two-hour event, participants walked through downtown, waving signs with phrases like “Black Lives Matter” and shouting chants such as “no justice, no peace” and “say his name: George Floyd.” [1]",
            "loc": "Cedar City"
        },
        {
            "description": "A protest with over 400 participants occurred on Friday, June 5.[2]",
            "loc": "Moab"
        },
        {
            "description": "On June 2, more than 100 protesters gathered at the Historic Cache County Courthouse to protest police brutality. Two police officers supported the protesters and brought them refreshments.[3]",
            "loc": "Logan"
        },
        {
            "description": "Around 1,000 people attended the \"Take a Knee\" protest in front of the Ogden City Municipal Building after turnout was only expected to reach 70 to 200; police barricaded numerous streets due to this higher-than-anticipated turnout. It was largely peaceful, with protestors opting to utilize verbal chants and speeches rather than violence. After the conclusion of the protest, protestors shook hands with police officers.[4]",
            "loc": "Ogden"
        },
        {
            "description": "On June 1, an estimated 300 people gathered at Dozier Field in a demonstration, where they took a knee for eight minutes and forty-six seconds in honor of George Floyd.[5]",
            "loc": "Park City"
        },
        {
            "description": "A small car caravan organized by Utah County Against Police Brutality raised awareness on May 30 for George Floyd and Bernardo Palacios, the latter of whom was killed by Salt Lake City Police on May 23.[6] Later that afternoon evening, between \"dozens\"[7] and \"hundreds\"[8] of protesters demonstrated in front of the Provo Police Department building downtown.[8]",
            "loc": "Provo"
        },
        {
            "description": "Two separate protests, organized by the Southern Utah Black Lives Matter chapter, were held on May 30. Troy Anderson, the founder of the Southern Utah chapter, addressed a crowd of about 50 to 60 people at 10 in the morning outside the city offices; Anderson spoke with Saint George's mayor afterwards. Later that evening, a crowd of approximately 200 protestors took a \"kneel-in\" along the city's main boulevard.[9] Nearly 1,000 people gathered on June 4th and lay in the streets silently for 8'46\".[10]",
            "loc": "Saint George"
        },
        {
            "description": "On May 29, around 150 to 200 people protested downtown at 900 South and State Street.[11] Beginning on Saturday morning, downtown was packed as hundreds drove and marched peacefully from the Salt Lake City police headquarters to the state capitol on capitol hill, where about a thousand people gathered.[12][13] Protesters sprayed graffiti on parts of the Utah State Capitol Building. The protests downtown later turned violent as protesters overturned a SLCPD police cruiser and set it ablaze. Far-right extremist groups arrived carrying firearms.[12] A man who identified himself as Brandon McCormick drove his vehicle into the crowd and aimed a bow and arrow at protesters, reportedly fired off an arrow, after responding to a stranger who asked him if he calls himself an American with: \"Yes, I'm American. All lives matter.\"[14][15] This prompted other protesters to tackle him to the ground and overturn his car, which caught on fire. Governor Gary Herbert activated the National Guard, deploying 200 soldiers and a Black Hawk helicopter.[16] Mayor Erin Mendenhall was on board the military helicopter and imposed the city's first citywide curfew[17] from Saturday night to Monday morning. Police from thirteen other cities and from the county sheriff were brought into Salt Lake City, using a high school as a staging area. Highway patrol troopers and U.S. marshals were stationed at capitol hill. Police used armored vehicles and tear gas and fired rubber bullets at protesters.[12][13] All the graffiti at the capitol was removed as the curfew continued through all of Sunday. After it lifted on Monday morning, troops and military vehicles continued to be stationed at several locations downtown.[18] Hundreds gathered for a largely peaceful protest at the police headquarters. Mendenhall issued another curfew order, this time only at night times but lasting a week. Herbert declared an emergency closing the capitol to the public, and the capitol remained under heavy guard.[17]",
            "loc": "Salt Lake City"
        }
    ]
},
{
    "Vermont": [
        {
            "description": "On June 5, about 300 people marched through the streets in support of Black Lives Matter and held a moment of silence for eight minutes and forty-six seconds to honor George Floyd.[1]",
            "loc": "Bellows Falls"
        },
        {
            "description": "On May 30, hundreds of protesters lined Main Street \"one end to the other\" with many slogans and the names of African Americans killed by the police.[2]",
            "loc": "Brattleboro"
        },
        {
            "description": "On May 30, around 1,200 people protested in Battery Park and moved toward the Burlington Police Department.[3][4]",
            "loc": "Burlington"
        },
        {
            "description": "On June 5, a group of around 300 protesters gathered at Five Corners to honor George Floyd, with some taking a knee and others lying down on their stomachs with their hands behind their backs.[1][5]",
            "loc": "Essex Junction"
        },
        {
            "description": "On May 30, roughly 375 people congregated on and around College Park and the Cross Street Bridge.[6]",
            "loc": "Middlebury"
        },
        {
            "description": "On May 30, hundreds of people protested at the intersection of State and Main Streets.[4]",
            "loc": "Montpelier"
        },
        {
            "description": "On June 7, around 100 protesters marched from the downtown police station to Gardner Memorial Park along Route 5 to protest police violence.[1]",
            "loc": "Newport"
        },
        {
            "description": "On June 7, approximately 600 people came to Main Street Park for a youth-led peaceful gathering to protest racial injustice and police brutality.[7]",
            "loc": "Rutland"
        },
        {
            "description": "On June 2, people protested at Taylor Park in St. Albans. One man was arrested.[8]",
            "loc": "St. Albans"
        },
        {
            "description": "On June 3, four arrests were made during a protest on June 3, 2020, where more than 100 people gathered in front of the St. Johnsbury Police Station.[9]",
            "loc": "St. Johnsbury"
        }
    ]
},
{
    "Texas": [
        {
            "description": "Dozens marched around the city after gathering at the Abilene Police Department for a protest on May 31.[3]",
            "loc": "Abilene"
        },
        {
            "description": "A crowd of more than 100 marched from City Hall to Sam Houston Park starting around 10am on May 31.[5] There were some conflicts with \"armed individuals\" and an opposing group that \"came to protect the city and community from destruction.\"[6]",
            "loc": "Amarillo"
        },
        {
            "description": "On Monday, June 1, the first protests over Floyd's death occurred. As night fell, rioting began, with businesses near AT&T Stadium looted. Police arrested six people.[7] Two hundred protestors gathered at Arlington City Hall on Tuesday, June 2.[8]",
            "loc": "Arlington"
        },
        {
            "description": "Several dozen protesters demonstrated in front of the Austin Police Department headquarters the night of May 29–30, with nine ultimately arrested.[9] On May 30, thousands of protesters again gathered outside police headquarters. They then climbed on to I-35, stopping traffic on both sides.[10] Demonstrators in Austin were also protesting over the killing of Mike Ramos on April 24, 2020, by Austin police officers.[11] On May 29, Travis County District Attorney Margaret Moore announced that the shooting will go to a grand jury.[citation needed] On May 30, a sixteen year old protester was hospitalized after being shot by police in the head with a \"beanbag\" round.[12][13] On May 31, a twenty year old protester was critically injured, after being shot with \"less-lethal munition\".[14] The protester, named Justin Howell, suffered a fractured skull and brain damage.[14] Volunteer medics picked up Howell's injured body, trying to get the police to give Howell medical attention.[14] The police responded by firing \"less-lethal munition\" at the medics carrying Howell.[14]",
            "loc": "Austin"
        },
        {
            "description": "On June 3, around 100 people peacefully protested at Linear Park before marching towards the Brownsville Police Department and the Cameron County Courthouse.[15]",
            "loc": "Brownsville"
        },
        {
            "description": "Hundreds of people protested outside the City Hall building and marched their way towards downtown Corpus Christi on May 31.[16]  Social media posts falsely claimed the protest was more violent than it actually was.[17]",
            "loc": "Corpus Christi"
        },
        {
            "description": "Almost a thousand people protested in front of the Dallas Police Headquarters on May 29.[18] The gathering and march organized was by the Next Generation Action Network. On the night of the 29th, some demonstrators broke windows, looted businesses, and set fires to dumpsters, trash cans, and patrol cars. Several police cruisers were damaged in the Deep Ellum neighborhood and downtown Dallas. One group of protesters then walked onto the freeway and blocked traffic on Interstate 35, shutting down traffic and torching a parked car. A man with a machete was badly injured by a mob. Video shows the man being beaten by 10-15 men. Objects used in the attack included a skateboard and several medium-sized rocks.[19][20][21] Mayor Eric Johnson said that while the protests were largely respectful, the looting and destruction of property could not be allowed.[22] On the night of June 1, nearly 700 peaceful demonstrators reached a police line on Margaret Hunt Hill Bridge, before mace and other crowd control agents were fired at them. A police line subsequently advanced behind the protestors, preventing them from leaving.[23] 674 people were ultimately charged with misdemeanors by the Dallas Police Department.[24]",
            "loc": "Dallas"
        },
        {
            "description": "Thousands of people marched around Denton on June 1 and subsequent days.[25]",
            "loc": "Denton"
        },
        {
            "description": "Over 100 people protested outside of City Hall on May 30, despite the event having been officially postponed beforehand due to safety concerns.[26]",
            "loc": "Edinburg"
        },
        {
            "description": "On the night of May 29, the headquarters of the El Paso Police Department on Raynor Street was vandalized with graffiti reading \"RIP George Floyd\" and \"No Justice No Peace\".[27] Two days later, on the night of Sunday, May 31, hundreds of protesters gathered in Memorial Park and knelt for an eight-minute moment of silence before marching to the El Paso Police Department.[28] El Paso Police had asked on Twitter for \"the public's support in making this a peaceful assembly as a tribute and in honor of Mr. George Floyd\", and El Paso native Khalid encouraged the public to stay safe.[29]",
            "loc": "El Paso"
        },
        {
            "description": "Community activists marched from the historic Tarrant County Courthouse to the Fort Worth Convention Center without incident on May 29.[30] About 200 peaceful protesters gathered downtown on May 30.[31][32]",
            "loc": "Fort Worth"
        },
        {
            "description": "On May 30, a group of 100 or more protested the death of George Floyd in Galveston.[33] On June 6, surfers took part in a worldwide Paddle Out, a Hawaiian ritual for celebrating, mourning and remembering a life. Other events took place in France, Senegal, Australia, Califonria, New Jersey and New York.[34]",
            "loc": "Galveston"
        },
        {
            "description": "Hundreds of protesters attended a rally on June 1 against police brutality, including the city's mayor and police chief.[35]",
            "loc": "Frisco"
        },
        {
            "description": "Dozens protested the killing of George Floyd in Georgetown on June 3.[36]",
            "loc": "Georgetown"
        },
        {
            "description": "A protest occurred on 3rd and Harrison avenue in Harlingen.[37]",
            "loc": "Harlingen"
        },
        {
            "description": "May 29: Large numbers protested in George Floyd's hometown. Mayor Sylvester Turner made calls for unity and peace.[38] Over 200 people were arrested[when?], most with obstructing a roadway.[39] According to police reports four officers suffered minor injuries[when?] and eight police vehicles were damaged.[39] Houston police explained that they were investigating a video that appeared to show a female protester being trampled by a police officer on a horse.[40][41]",
            "loc": "Houston"
        },
        {
            "description": "On Sunday afternoon, June 8, thousands of people of Keller and surrounding communities packed the pavilion at Bear Creek Park for a demonstration in honor of George Floyd.  Organizers Charles Banks and Myles Britton and others addressed the crowd, after which around 3,000 protesters, per a Keller Police Department estimate, marched from Bear Creek Park to Keller Town Center.[45]",
            "loc": "Keller"
        },
        {
            "description": "Hundreds of people gathered at the City Hall building on May 30 and June 1 to peacefully protest in wake of the murder of George Floyd and police reform. There was a smaller protest on June 4 to make the public aware of police brutality and systemic racism.[46][47]",
            "loc": "Laredo"
        },
        {
            "description": "Hundreds of protesters attended a rally in Lewisville, which ended after police used tear gas. 9 people were arrested for obstructing a road.[48][49]",
            "loc": "Lewisville"
        },
        {
            "description": "Nearly 200 people took a stand against racism and police brutality at Tim Cole Memorial Park on May 30.[50][51]",
            "loc": "Lubbock"
        },
        {
            "description": "On May 31, nearly 100 people demonstrated and marched at the city hall in Lufkin. Protests lasted for about an hour. No injuries or property damage were reported.[52]",
            "loc": "Lufkin"
        },
        {
            "description": "June 5: Hundreds of students from the Mansfield High School participated in a peaceful protest.[53]",
            "loc": "Mansfield"
        },
        {
            "description": "On June 9, around 50 people held a peaceful protest outside the Harrison County Courthouse to honor George Floyd and oppose police brutality. The event, which was organized by the group Marshall Against Violence, began with a moment of silence for two minutes and fifty-three seconds, representing the amount of time Floyd was left lying on the ground after being suffocated.[54]",
            "loc": "Marshall"
        },
        {
            "description": "On June 5, protesters marched from Archer Park to city hall in support of Black Lives Matter. One man was arrested after wielding a chainsaw at protesters and yelling racial slurs.[55][56]",
            "loc": "McAllen"
        },
        {
            "description": "May 30: Hundreds marched and shared their thoughts on police violence downtown.[57]",
            "loc": "Odessa"
        },
        {
            "description": "On June 1, approximately 50 people held a peaceful protest in Reagan Park. They lit candles and sat on one knee for eight minutes and forty-six seconds.[58]",
            "loc": "Palestine"
        },
        {
            "description": "On May 30, around three dozen people formed a peaceful protest at the downtown square; another took place on June 3.[59] On June 18, more protesters demonstrated at the Lamar County Courthouse, where they chanted and sang against systemic racism.[60]",
            "loc": "Paris"
        },
        {
            "description": "On June 2 and June 3, crowds of demonstrators marched in Plano.[61]",
            "loc": "Plano"
        },
        {
            "description": "On May 31, one person stood alone on the corner of Red Bud Lane and Forest Creek Drive with a sign that read \"End Systemic Racism.\" On June 1, 40 demonstrators had gathered there. These protests have continued nightly.[62]",
            "loc": "Round Rock"
        },
        {
            "description": "Roughly 300 people marched from The Bosque on the Concho, a public park, along Irving Street to City Hall on May 31.[63]",
            "loc": "San Angelo"
        },
        {
            "description": "Several thousand people protested peacefully downtown outside the San Antonio Public Safety Headquarters.[64] Members of the This Is Texas Freedom Force, an armed right-wing group, stood guard in front of the Alamo and the adjacent Alamo Cenotaph memorial.[65] The initially peaceful protests later erupted into riots, with police firing rubber bullets and deploying tear gas in order to disperse crowds; several businesses and city sites were damaged, resulting in the arrests of three San Antonio residents and one resident of nearby Uvalde.[66] Three officers were reported injured following the protests.[67]",
            "loc": "San Antonio"
        },
        {
            "description": "On Saturday afternoon, June 7, Hundreds of people turned out for a peaceful march for racial equality in Southlake Town Square.\nThe event, organized by a Carroll High School group called the Progressive Activism Club, was spurred by the recent death of George Floyd while in Minneapolis police custody. \n[68]",
            "loc": "Southlake"
        },
        {
            "description": "On Saturday afternoon, May 30, 70 to 100 protesters gathered peacefully at the State Line Post Office to listen to speeches, then marched to downtown before returning northward to a parking lot at State Line and Arkansas Boulevard, where the crowd grew and passing motorists honked in support.[69]",
            "loc": "Texarkana"
        },
        {
            "description": "On Saturday, June 6 at 10 AM, about 200 people gathered in Snider Plaza to peacefully march to demonstrate their solidarity with the Black Lives Matter movement and to protest the murder of George Floyd. As they gathered the protesters were harassed by an individual who blasted bagpipe music and yelled ‘shame on you.’ The protesters marched down Milton and Airline Avenues to Burleson Park, near the campus of Southern Methodist University. Once gathered at the park in a large circle, the protesters together in silence knelt on one knee for 8 minutes and 46 seconds to mourn the murder of George Floyd and many other black men and women. A few pro-life activists were part of the protest, including an African-American man who sang a civil rights anthem, and then was redirected by the crowd to commemorate George Floyd.",
            "loc": "University Park"
        },
        {
            "description": "On Saturday, June 6, people gathered outside the Raymond Gould Community Center to unite in protesting George Floyd's murder. Speakers included the head of the Beaumont chapter of the NAACP as well as several Vidorians. Many of those present also acknowledged Vidor's own violent past. One account described “some 150 to 200 people standing in the sun, in the draining humidity and heat of Southeast Texas, ‘to come together in love and unity and to bind together under God,’ as [organizer Maddy] Malone told the crowd. ‘My generation is reaching to break the cycle.’”[70]",
            "loc": "Vidor"
        }
    ]
},
{
    "Tennessee": [
        {
            "description": "On June 1, about 200 people held a candlelight vigil for George Floyd on State Street in both Bristol, Tennessee and Bristol, Virginia.[1] The protests were largely peaceful and held across the Tri-Cities region of Southwest Virginia and East Tennessee.[2]",
            "loc": "Bristol"
        },
        {
            "description": "Over 200 participated in a protest in Clarksville that shut down a major highway but remained peaceful.[3]",
            "loc": "Clarksville"
        },
        {
            "description": "Dozens protested in downtown Cleveland in front of the Bradley County courthouse and headquarters of the Cleveland Police Department on May 31. The protest was peaceful, and included protesters discussing police brutality issues with local law enforcement.[4]",
            "loc": "Cleveland"
        },
        {
            "description": "Hundreds protested at Miller Park followed by a march across the Walnut Street Bridge at mid-day on May 30.[5] On May 31, protesters marched from Coolidge Park to the Hamilton County Courthouse. After protesters removed some light fixtures and tore down a flag near the courthouse, the National Guard, the Tennessee Highway Patrol and Chattanooga Police Department began arresting people and dispersing the crowds with tear gas.[6] On June 3, during the fifth day of peaceful protests, police arrested a man standing on a rooftop along the route of the march with multiple firearms including an AK-47 and six beers.[7]",
            "loc": "Chattanooga"
        },
        {
            "description": "Almost 200 protestors showed up to protest peacefully at Jackson City Hall on May 30.[8]",
            "loc": "Jackson"
        },
        {
            "description": "Hundreds of protesters demonstrated on Friday evening in front of police headquarters and then marched through downtown Knoxville.[9]",
            "loc": "Knoxville"
        },
        {
            "description": "Silent demonstrations of around 40 people protesting the deaths of Floyd, Breonna Taylor in Kentucky, and Ahmaud Arbery, led to \"verbal confrontations\" with Memphis police and two counter-protesters from the Facebook group Confederate 901.[10] On May 27, protesters shut down Union Avenue near McLean Boulevard.[11] Just after midnight Saturday night, police in riot gear clashed with a large crowd on Beale Street. Shelby County Commissioner Tami Sawyer, who was on scene, tweeted: “Memphis police have threatened to use lethal force if we don’t leave the parking lot. They have arrested our friends. We’re not leaving.\"[12][13] On Sunday Evening May 31, the fifth straight day of protests, more riot police attempted to disperse a crowd of 100 that were occupying Main Street.[14] A curfew went into effect in Memphis, TN, on Monday, June 1, from 22:00 to 06:00, and was extended the following day to June 8.[15]",
            "loc": "Memphis"
        },
        {
            "description": "On May 31, a group of about 50 protesters marched toward a building on the Middle Tennessee State University campus named after Nathan Bedford Forrest but were stopped by police in armored vehicles. Police accused protesters of vandalizing an armored car and throwing a brick through the window of a local business. A 12-year-old girl was injured by tear gas.[16] Mayor Shane McFarland issued a state of emergency order. A curfew was in effect as of 6:30pm.[17]",
            "loc": "Murfreesboro"
        },
        {
            "description": "Thousands gathered at a protest occurred May 30, 2020[when?] afternoon in downtown Nashville; protesters peacefully demonstrated in Legislative Plaza and then marched to a police department.[18] In the evening, the crowd damaged a police car, threw rocks and sprayed graffiti; at least 5 were arrested. Mayor John Cooper declared a state of emergency and called in the national guard after a spate of arsons, including the burning of Nashville's courthouse.[19][20][21]",
            "loc": "Nashville"
        }
    ]
},
{
    "South Dakota": [
        {
            "description": "On June 1, on both sides of Sixth Avenue Southeast, over 50 protesters gathered to protest the death of George Floyd.[1]",
            "loc": "Aberdeen"
        },
        {
            "description": "Hundreds of people peacefully marched on June 5, 2020 in a demonstration to support Justice for Black Lives. The protest travelled throughout various government buildings downtown, including the courthouse, post office, and police department. The Brookings Police were supportive and closed intersections for the demonstration.[2]",
            "loc": "Brookings"
        },
        {
            "description": "On June 10, over 100 vehicles took part in a \"Drive for George Floyd,\" parading through the streets of Huron with slogans supporting Floyd and Black Lives Matter.[3]",
            "loc": "Huron"
        },
        {
            "description": "On June 3, 2020, a crowd of peaceful demonstrators marched through downtown Mitchell in solidarity of social justice change for the African American community.[4]",
            "loc": "Mitchell"
        },
        {
            "description": "At least 30 people gathered on June 4, 2020, on the steps of the steps of the South Dakota State Capitol with signs in support of the Black Lives Matter movement.[5]",
            "loc": "Pierre"
        },
        {
            "description": "A small group. including two law enforcement officials, joined together for a protest on June 4, 2020.[6]",
            "loc": "Pine Ridge"
        },
        {
            "description": "George Floyd's uncle Selwyn Jones spoke at an event held at Memorial Park on May 29. He said his nephew was \"was always smiling and laughing.”[7] The rally ended with a performance by Native American musicians.[8] The Chief of Police expressed regrets that he could not attend the memorial.[9] On June 3, a small group protestors gathered in Rapid City, waving flags and holding signs in support of Black Lives Matter and George Floyd.[10]",
            "loc": "Rapid City"
        },
        {
            "description": "A protest march was held in downtown Sioux Falls on May 31, ending outside the Sioux Falls and Minnehaha County Law Enforcement Center. George Floyd's uncle spoke about the beautiful protest and thanked the protestors for honoring his nephew. The event organizers for the downtown event emphasized nonviolence to honor George Floyd. However, some protestors later traveled to Sioux Empire Mall, and began to throw rocks and break windows. Some protestors asked the rock throwers to stop and even formed a line in front of the police to quell the actions against police, but without success. Gov. Kristi Noem declared a state of emergency, from 10pm on May 31, to 7am on June 1. Seventy members of the National Guard were activated.[11] SWAT and National Guard teams then assisted in enforcing curfew, but rioting and looting continued at the mall and other nearby stores.[12]",
            "loc": "Sioux Falls"
        }
    ]
},
{
    "South Carolina": [
        {
            "description": "On June 3, up to 500 people peacefully marched in the streets downtown to support Black Lives Matter and George Floyd, walking twice around the Anderson County Courthouse.[1]",
            "loc": "Anderson"
        },
        {
            "description": "The city issued a curfew after protests resulted in vandalism of public property and statues and some protesters threw rocks at police and citizens. Additionally, several businesses and restaurants had glass windows busted. Two men wearing MAGA hats were assaulted. At one point, police in riot gear used tear gas to stall protesters. Protesters halted traffic on Interstate-26.[2] The following day, a group of 200 protesters formed in Marion Square.[3] One protester, identified as Gee Jordan, was arrested in Marion Square after praising police officers, having stated \"I love each and every one of you. [...] I am not your enemy. You are not my enemy.\"[4][5] He was charged with \"disobeying lawful order\" and has since been released from jail on bond.[4][5] Charleston Police Chief Luther Reynolds defended the arrest, stating that \"We specifically asked for [the protesters], numerous times, to disperse. We said if you don't, you will be arrested\".[5][6]",
            "loc": "Charleston"
        },
        {
            "description": "On May 30, 2020, protesters marched from the South Carolina Statehouse to the city of Columbia police station.[7] Several businesses and restaurants in the nearby business district were vandalized. Mayor Stephen K. Benjamin announced a mandatory 6 p.m. curfew for the city. Four police officers were injured, one critically. Later that night shots were fired at police, and the shooters were arrested. The officers did not return fire.[8] Three police cruisers were tourched in Columbia, and protesters unsuccessfully attempted to burn down several buildings.",
            "loc": "Columbia"
        },
        {
            "description": "On June 10, around fifty doctors and nurses held a moment of silence for eight minutes and forty-six seconds outside the MUSC Health Florence Medical Center to honor George Floyd.[9]",
            "loc": "Florence"
        },
        {
            "description": "On June 4, over 1,000 protestors peacefully marched down S.C. 160 to protest George Floyd's killing and support Black Lives Matter.[10][11]",
            "loc": "Fort Mill"
        },
        {
            "description": "On May 30, two protests were held at Peace Center and Falls Park. Not affiliated with Black Lives Matter, the first event was attended by Mayor Knox White. About 300 people marched at the second protest, some arrests were made.[12]",
            "loc": "Greenville"
        },
        {
            "description": "Hundreds of protesters attended a rally downtown on the morning of May 31.[13][14] Protesters initially blocked the entrance to the Myrtle Beach Police Station in what felt like a \"standoff\" but when officers joined in and the Chief addressed the crowd cheered.[15] Mayor Brenda Bethune declared a civil emergency due to a \"credible threat\" against police related to the protest. A curfew was set to start at 7pm May 31.[16][17]",
            "loc": "Myrtle Beach"
        },
        {
            "description": "On June 4, around 100 protesters marched from Park Circle down to East Montague Avenue to rally against police brutality.[18]",
            "loc": "North Charleston"
        },
        {
            "description": "On May 30, a peaceful protest was held at Fountain Park.[19]",
            "loc": "Rock Hill"
        },
        {
            "description": "On May 30, a peaceful protest was held outside the Sumter Police Department to voice support for George Floyd.[20]",
            "loc": "Sumter"
        }
    ]
},
{
    "Rhode Island": [
        {
            "description": "A protest of more than 1000 persons was held beginning at Colt State Park and ending at Independence Park on June 6.[1]",
            "loc": "Bristol"
        },
        {
            "description": "On June 11, about 50 people marched to Harrison Mill Pond from Eccleston Field and lied face down on the sidewalk with their hands behind their backs for eight minutes and forty-six seconds.[2]",
            "loc": "Burrillville"
        },
        {
            "description": "About 100 people participated in a rally in support of Black Lives Matter at East Ferry Landing on June 16.[3]",
            "loc": "Jamestown"
        },
        {
            "description": "On May 30, nearly 1,000 people protested at the State House lawn at a peaceful rally organized by Black Lives Matter Rhode Island.[4] Later that night the building was vandalized.[4] On June 1, rioters set a police car on fire and looted several stores. Some rioters also broke into the Providence Place Mall and stole items. At least 65 people were taken into custody.[5][6][7]",
            "loc": "Providence"
        },
        {
            "description": "On June 7, around 300 people rallied in support of Black Lives Matter by the Narragansett Seawall.[15]",
            "loc": "Narragansett"
        },
        {
            "description": "More than 100 people converged on Liberty Square in Newport on June 1, 2020 to honor George Floyd.[16] The protests took places only blocks away from the Newport waterfront, a major center of the American slave trade. A second protest was held in Newport on June 6, with several thousand protesters in attendance.[17] A third protest was held at Miantonomi Memorial Park on June 13.[18]",
            "loc": "Newport"
        },
        {
            "description": "A protest was held in the village of Wakefield on June 8.[19] A second youth-led protest was held on June 16, with a group of several hundred protestors kneeling on Kingstown Road for eight minutes and 46 seconds.[20]",
            "loc": "South Kingstown"
        },
        {
            "description": "On June 5, around 50 people gathered on the steps of the post office to peacefully protest.[21]",
            "loc": "Westerly"
        },
        {
            "description": "A group of protesters in Woonsocket gathered with the Police Chief outside the police station demanding change. The protest was held by the Woonsocket Alliance to Champion Hope, also known as The Watch Coalition.[22] Protestors also marched, chanted and carried signs though the town.[23]",
            "loc": "Woonsocket"
        }
    ]
},
{
    "Philadelphia": [
        {
            "description": "On this day, Police Staff Inspector Joseph Bologna was videoed lunging at a journalist, and hitting a security guard. He was also involved in other controversial incidents on June 1 and June 2.[23]",
            "loc": "Events"
        },
        {
            "description": "Hundreds of protesters blocked traffic on Interstate 676 (Vine Street Expressway) and led to the shutdown of the Benjamin Franklin Bridge. This prompted police to fire rubber bullets and tear gas on the protesters. Police arrested two dozen arrested after a second group of protesters attempted to shut down the Benjamin Franklin Parkway, and restrained others while pepper spraying them in the eyes. A curfew went into effect at 6 p.m.[21]",
            "loc": "Context"
        },
        {
            "description": "Protesters in Fishtown reported being harassed and threatened by a group of 50 to 70 armed white men, one of whom destroyed a protester's sign while using homophobic slurs.[24]",
            "loc": "May 30"
        },
        {
            "description": "On this day, Police Staff Inspector Joseph Bologna, who was also involved in controversial incidents on May 31 and June 2, attacked a student protester with a baton, and the incident was caught on video. Bologna was later suspended and charged with aggravated assault.[25][23]",
            "loc": "May 31"
        },
        {
            "description": "On this day, Police Staff Inspector Joseph Bologna was videoed lunging at a journalist, and hitting a security guard. He was also involved in other controversial incidents on June 1 and June 2.[23]",
            "loc": "June 1"
        },
        {
            "description": "On this day, Police Staff Inspector Joseph Bologna was videoed lunging at a journalist, and hitting a security guard. He was also involved in other controversial incidents on June 1 and June 2.[23]",
            "loc": "June 2"
        },
        {
            "description": "In the early morning, the statue of former Philadelphia mayor Frank Rizzo was removed from the steps of the Municipal Services Building and placed in secure storage at the Department of Public Property. Current mayor Jim Kenney commented, \"The statue is a deplorable monument to racism, bigotry, and police brutality for members of the Black community, the LGBTQ community, and many others. The treatment of these communities under Mr. Rizzo's leadership was among the worst periods in Philadelphia's history.\"[29] More peaceful protests occurred in the city on June 3, with streets in Center City Philadelphia closed and a curfew in effect at 6 p.m.[30]",
            "loc": "June 3"
        }
    ]
},
{
    "Pennsylvania": []
},
{
    "Portland, Oregon": [
        {
            "description": "Demonstrators gathered at Southeast Stark Street and 12th Avenue on June 9. There were approximately 500 people outside the Multnomah County Justice Center by 9pm.[47]",
            "loc": "Background"
        },
        {
            "description": "On June 10, an afternoon rally to disband the Portland Police was held in Terry Schrunk Plaza. In the evening a ride leaving Irving Park was organized by Portland's chapter of Black Girls Do Bike.[48][49] Several thousand people marched from Southeast Stark Street and 12th Avenue to Unthank Park.[50] Protesters failed to create an autonomous zone similar to Seattle's Capitol Hill Autonomous Zone.[51]",
            "loc": "Demonstrations"
        },
        {
            "description": "Approximately 1,000 people demonstrated on June 11 after an already-planned city budget meeting led to historic levels of public comment, with one city commissioner, Chloe Eudaly, voting \"no,\" stating that the proposed cuts to the police bureau fell short of what demonstrators were calling for. A unanimous vote was required to pass the budget.[52][53] \"While my colleague can take a principled 'no' stance on passing this budget, I as a Black woman cannot,\" Commissioner Hardesty responded in a statement. \"I do not want to let this detract from the very real steps taken, but it is an important reminder on what performative allyship looks like.\"[54]",
            "loc": "May 28–29"
        },
        {
            "description": "For the 17th day, protesters assembled in various parts of the Portland area on June 13. The main march, with at least 1,000 people, went from Revolution Hall, the starting point for most of the marches, and went to Cleveland High School, including a stretch of Southeast Division St. from 11th to 26th. The Clinton Street Theater displayed a quote from Malcolm X on its marquee as protesters marched past.[55]",
            "loc": "May 30–31"
        },
        {
            "description": "About 1,000 demonstrators marched to Jefferson High School on June 14, the 18th day of protests. A statue of Thomas Jefferson was toppled from its pedestal.[56]",
            "loc": "June 1–2"
        },
        {
            "description": "At a second city budget vote on the issue, commissioners voted 3-1 to cut PPB funding by $15 million. This would terminate the Gun Violence Reduction Team and cut funding for school resource officers and transit police, while reallocating nearly $5 million to Portland Street Response, which would respond to calls concerning homeless people instead of police. Commissioner Chloe Eudaly again voted \"no\".[57]",
            "loc": "June 3–4"
        },
        {
            "description": "The group Care Not Cops, who wanted more money cut from PPB funding, later that day demonstrated outside of Mayor Wheeler's apartment in Northwest Portland. By midnight, they had been joined by hundreds of people, who began blocking off the streets at Northwest Glisan and 10th Avenue with impromptu. Just after 5:30 a.m. police cleared the scene; a police spokesman said there were only about 50 protesters left by that time. Mayor Wheeler helped in cleaning up the debris.[58]",
            "loc": "June 5–6"
        },
        {
            "description": "A statue of the first U.S. president, George Washington, on Northeast Sandy Boulevard and 57th Avenue was toppled by demonstrators on June 18.[59]",
            "loc": "June 7–8"
        },
        {
            "description": "The Facebook and Twitter accounts associated with the Pacific Northwest Youth Liberation Front (or PNW Youth Liberation Front) have served as \"information hubs\" for sharing protest plans. The group does not have identifiable leaders and describes itself as a \"decentralized network of autonomous youth collectives dedicated to direct action towards total liberation\".[60] The groups' Facebook and Twitter accounts were created in February 2017, and have 3,600 and 11,000 followers, respectively, as of early June 2020. The group has used a black flag emoji, which is sometimes interpreted as anarchist symbolism.[60]",
            "loc": "June 9–10"
        },
        {
            "description": "Ted Wheeler tweeted, \"Burning buildings with people inside, stealing from small and large businesses, threatening and harassing reporters. All in the middle of a pandemic where people have already lost everything. This isn't calling for meaningful change in our communities, this is disgusting.\"[61] Sara Boone, chief of Portland Fire & Rescue, attributed the protests and violence to Floyd's death and \"a system that allows people of color to 'feel fear every day.'\"[62] The city implemented a curfew from 8pm on May 30 to 6am on May 31.[63][64] On May 31, Wheeler extended the curfew for another night (8pm to 6am).[26][65] He said the demonstration has been \"co-opted by rioters and looters\", and Jami Resch, chief of the Portland Police Bureau, called the rioters a \"group of selfish individuals\".[28]",
            "loc": "June 11–12"
        },
        {
            "description": "On May 30, TriMet paused bus and MAX Light Rail service to and from downtown and the Rose Quarter after the demonstrations started.[66] The following day, the agency stopped bus, MAX, and Portland Streetcar[67] service starting at 3:30pm, and said in a statement: \"Our hearts at TriMet are heavy following the violence that damaged our city overnight, along with the emotions that are so raw here and across the nation. While TriMet appreciates the First Amendment right to protest, we hope that it is done without violence or vandalism.\"[66] The Oregon Department of Transportation (ODOT) blocked the interchanges into the city along I-5, I-84, I-405, and U.S. Route 26.[29][68] Willamette Week's Matthew Singer said ODOT's move was \"without precedent in recent memory\".[67] Motorized scooter services (including Lime and Spin) were temporarily suspended in select parts of Northwest and Southwest Portland, the Central Eastside, and the Lloyd District.[67]",
            "loc": "June 13–14"
        },
        {
            "description": "On June 1, Gov. Kate Brown activated 50 National Guard and 100 state police troopers. Wheeler extended the same curfew for a third night.[31][32] Billy J. Williams, United States Attorney for the District of Oregon, said at a press conference: \"What I saw at the Justice Center ... was sickening. This has to stop and in order for that to happen in the city of Portland, we need help. We need bodies, we need more numbers to do something to stop this ridiculous violence. This just cannot keep up.\"[69]",
            "loc": "June 15–16"
        },
        {
            "description": "The city's curfew was lifted on June 2.[35][70] Elected officeholders (including Wheeler, Williams, Multnomah County District Attorney Rod Underhill, and Multnomah County Sheriff Mike Reese), law enforcement officials, and black demonstrators and community leaders met for the first time.[71][72] The Hawthorne Bridge's west-bound lanes were closed for security purposes on the evening of June 2.[36] Resch said, \"I want to recognize the thousands of demonstrators who came downtown in a peaceful manner and exercised their First Amendment rights. There are many thousands of you who are not involved in the violence and destruction and I thank you. I still hear your message and I know the others who are engaging in criminal acts do not represent you.\"[39]",
            "loc": "June 17–18"
        },
        {
            "description": "The Oregon Convention Center's (OCC) spires were illuminated yellow as a \"beacon of hope for our suffering and silenced communities of color\". Metro, which operates the venue, said, \"Our venues are located in areas with deep legacies of racial injustices and we support peaceful demonstrations to stand together to dismantle systemic racism and hatred.\" Additionally, the OCC's executive director said the venue \"is an economic driver for our state and the spires have become as much of a staple in the skyline at the White Stag on Burnside. We will continue to shine bright in community solidarity, providing a beacon of hope for Oregonians.\"[73]",
            "loc": "Organizers"
        },
        {
            "description": "On June 5, Wheeler pledged to \"limit the ways police respond\" by restricting use of sonic weapons and tear gas \"if police had a viable alternative\".[45][74] On June 8, Resch announced she would be stepping down; Resch was replaced by Chuck Lovell.[75][76] On June 17, City Council reduced the police bureau's budget by about $16 million, or six percent.[77]",
            "loc": "Responses"
        },
        {
            "description": "Rev. Mondainé of Portland's NAACP chapter spoke against looting and vandalism.[78] Some restaurant owners expressed support for the protesters via social media and by contributing to organizations working to assist people of color and combat police brutality, among other causes. Le Pigeon sustained damage during the demonstrations; owner Gabriel Rucker said, \"To the person that smashed my window last night I hear you and I hope you find a voice that screams louder than broken glass. To the person who broke my window last night I love you and if you were hungry I would cook you a meal.\"[79]",
            "loc": "Government"
        },
        {
            "description": "The Portland Committee on Community-Engaged Policing organized a Zoom conference. More than 320 people participated, and committee members passed a resolution asking elected and law officials to \"stand against white supremacy and police violence\". Furthermore, the resolution says, \"We must do more than make symbolic statements against racism. We must change the outcomes of policing, reducing incidents of violence, and the targeting of communities of color and other marginalized groups.\"[80] On June 1, the organization SOLVE organized a volunteer cleanup effort in downtown in collaboration with local businesses.[81] Hundreds of volunteers filled approximately 150 trash bags, while social distancing because of the COVID-19 pandemic.[82]",
            "loc": "Community"
        }
    ]
},
{
    "Oregon": [
        {
            "description": "1,000 peaceful protesters lined Ellsworth Street in Downtown Albany on June 2, calling for racial justice. After 2 hours the group moved to city hall where they knelt for 9 minutes of silence in memory of George Floyd.[3]",
            "loc": "Albany"
        },
        {
            "description": "Hundreds gathered for two different protests on May 31, one starting at Lithia Park, the other at Ashland Plaza. The two groups eventually merged marching in downtown Ashland.[4][5]",
            "loc": "Ashland"
        },
        {
            "description": "A small group protested in front of the Post Office on May 29. On May 31, another protest was held in front of the Maritime Museum where George Floyd protesters were met with a counter protest.[6][7] A 16-year-old high school student from Warrenton organized a protest that drew about fifty people in front of the Astorial post office on Thursday, June 4.[8] \nOn June 6 over four hundred people marched the across town and back to the Post Office, confronting a counter protest led by the want-to-be celebrity activist Haley Adams. The protestors outnumbered the counter protesters by over three hundred people.",
            "loc": "Astoria"
        },
        {
            "description": "On June 5, hundreds of people marched from Sunset High School to the Nike World Headquarters in Beaverton, in an event led by the school's Black Student Union.[9]",
            "loc": "Beaverton"
        },
        {
            "description": "Hundreds attended a Justice for George Floyd rally in downtown Bend.[10]",
            "loc": "Bend"
        },
        {
            "description": "About 50 people gathered to honor the memory of George Floyd on June 2.[13]",
            "loc": "Brookings"
        },
        {
            "description": "At least 10 people gathered on a corner in downtown Burns with signs of support for George Floyd and the Black Lives Matter movement.[14][better source needed]",
            "loc": "Burns"
        },
        {
            "description": "Protestors gathered around city hall with signs in support and recognition of the Black Lives Matter movement, flashing the signs toward passing vehicles. Many drivers honked their horns and shook their fists as an act of solidarity for the group. Activists could be seen chanting around the sidewalks of downtown Corvallis, eventually making their way to the local police station. Most chants were designed to remember the memory of George Floyd and highlight the perceived racial inequities seen throughout the country. The protest was entirely peaceful in its nature, taking place over the course of two hours and involved around 50 protestors. There were few signs of involvement from law enforcement throughout the protest, limited to a single sheriff's vehicle driving past the crowd.[15] On May 31, about 2000 people chanted \"No Justice, No Peace\" outside the Benton County Courthouse. American Sign Language interpreters translated the passionate speeches.[16]",
            "loc": "Corvallis"
        },
        {
            "description": "A crowd of 200[17] to 300 people gathered on May 29 to protest downtown. Some protesters disrupted traffic and knocked trash and newsstands into the street in the downtown. Rioters crowded on to Highway I-105 and began setting fire to a nearby road sign. That night, fires were set and windows were smashed. Around 11 p.m., they created a bonfire in the street, consisting of throwing in traffic cones, newspapers, signs from local businesses, and other items.[18] No arrests were made.[19] Protests in Eugene continued for ten straight days, as of June 7.[20] A protest on June 5 drew about 300 people.[8]",
            "loc": "Eugene"
        },
        {
            "description": "300 assembled beneath the large flag pole located between Maple and Laurel Streets on June 2 to protest police brutality against Blacks.[24]",
            "loc": "Forest Grove"
        },
        {
            "description": "300 to 500 protesters gathered in front of the Josephine County Court House to protest the killing of George Floyd on June 2. Across the street a group of 50, some armed, stood in front of the Josephine County Republican Headquarters.[25]",
            "loc": "Grants Pass"
        },
        {
            "description": "On June 3, more than 100 protesters marched from Clackamas High School to Happy Valley City Hall.[26]",
            "loc": "Happy Valley"
        },
        {
            "description": "On June 1, about 60 protesters stood on an intersection, holding signs reading “Black Lives Matter”, “No Justice, No Peace”, “All lives don’t matter until black lives matter”, and other messages.[27]",
            "loc": "Hermiston"
        },
        {
            "description": "Approximately 400 people assembled in the plaza at the Hillsboro Civic Center on June 5 to protest police brutality.[28]",
            "loc": "Hillsboro"
        },
        {
            "description": "200 gathered at Sugarman's Corner on the night of May 31 to protest the killing of George Floyd. Across the street hundreds of armed anti-antifa counter protesters gathered. Rumors had circulated on local social media that out of town antifa buses loaded with bricks would arrive that night. This included a message screenshot from Oregon Air National Guard 173rd Fighter Wing Commander Col. Jeff Edwards which stated \"\"Team Kingsley, for your safety I ask you to please avoid the downtown area this evening. We received an alert that there may be 2 busloads of ANTIFA protesters en route to Klamath Falls and arriving in downtown around 2030 tonight.\" The busloads of antfia never did arrive. Police stood in the street to keep the two groups, one chanting \"George Floyd\" and the other chanting \"USA\" and \"Go Home\", separated. Police only made a single citation. Dozens continued to gather and protest Floyd's death every night at Sugrman's Corner.[29]",
            "loc": "Klamath Falls"
        },
        {
            "description": "A group of 20 gathered in front City Hall on Saturday, May 31, lead by an 11-year-old who \"wanted to bring home the fight for racial equality.[30]\nFollowing her lead, about five hundred people gathered in front of the City Hall and Library on Tuesday, June 2nd.[31]",
            "loc": "La Grande"
        },
        {
            "description": "Hundreds demonstrated in Lebanon, Oregon on the weekend of June 13.[11][32]",
            "loc": "Lebanon"
        },
        {
            "description": "A George Floyd vigil was held along US Highway 101 at D River State Park on June 1.[33]",
            "loc": "Lincoln City"
        },
        {
            "description": "More than 1000 protesters marched through the streets of Medford, on June 1, with some demonstrators lying in the street for 9 minutes to honor George Floyd.[34][35] Phoenix, Oregon's Mayor Chris Luz drove his yellow maid-cleaning service close to protesters, then got into a heated confrontation with protesters and a legal observer. A protester brought it up in a Phoenix commissioners meeting on June 15, and city councilor Sarah Westover said \"I can’t believe the actions that you took, nudging teenagers with your car, intimidating, and threatening them for expressing their opinions. I think this is unacceptable behavior, and I want to call on the mayor to resign tonight.\" Another councilor asked Luz to apologize, he didn't reply. The Medford police opened in investigation into the mayor's actions. Armed militia members were standing outside the commissioners meeting.[36][37][38][39]",
            "loc": "Medford"
        },
        {
            "description": "A group of at least 60 protestors at the intersection of Pacific Ave. and Main St. in downtown Monmouth, rallied and chanted in support of the Black Lives Matter movement.[40]",
            "loc": "Monmouth"
        },
        {
            "description": "Hundreds of people gathered along Adams and Second streets in McMinnville on June 2, in a peaceful protest against systemic racism and police brutality, holding signs as a constant stream of car horns blared.[41]",
            "loc": "McMinnville"
        },
        {
            "description": "A protest was held in Newberg on Thursday, June 4.[8]",
            "loc": "Newberg"
        },
        {
            "description": "Hundreds gathered in front of Newport City Hall to protest in support of Black Lives Matter at noon on June 3. The group marched to the Lincoln County Courthouse and back to Newport City Hall.[42]",
            "loc": "Newport"
        },
        {
            "description": "Hundreds marched in the eastern border city of Ontario, an exurb of Boise, Idaho, on June 4. Mayor Riley Hill expressed a desire to listen to the protesters, and to make Ontario a city that \"unites instead of divides.\" He stated that the city's demographics have changed a great deal over four decades. Police chief Steven Romero praised the protesters for their peaceful disposition despite taunts from individuals along the march.[43][44][8]",
            "loc": "Ontario"
        },
        {
            "description": "Around 150 Black Lives Matters protesters came out on May 31 in front of the Crook County Courthouse, along with a similar number of counterprotestors.[45]",
            "loc": "Pendleton"
        },
        {
            "description": "Dozens demonstrated on Saturday June 13, and there were four arrests.[11]",
            "loc": "Portland"
        },
        {
            "description": "More than 200 demonstrators marched around the Oregon State Capitol Building on May 30. A police spokesman claimed the reason they used tear gas to break up the protest is because hard objects and \"explosive devices\" were thrown. The mayor issued an indefinite nightly curfew because \"there was no reason to take a chance on a few \"misguided individuals\" destroying public and private property.\"[46] Protests continued through the week, with a protest on Saturday June 6 drawing thousands to the streets in downtown.[47]",
            "loc": "Prineville"
        },
        {
            "description": "Several hundred protesters rallied at the capitol on the afternoon of June 13.[22][11]",
            "loc": "Salem"
        },
        {
            "description": "About a dozen people demonstrated in Seaside.[8]",
            "loc": "Seaside"
        },
        {
            "description": "Dozens of protesters gathered at Springfield City Hall on June 8 as City Council considered, and decided against, cutting its expensive police body camera program.[48]",
            "loc": "Springfield"
        },
        {
            "description": "Hundreds of people marched through town protesting racism on June 3. They held signs that said \"Black Lives Matter\" in a community where very few black people live.[49]",
            "loc": "St. Helens"
        },
        {
            "description": "Hundreds of protesters gathered at Tualatin Lake of the Commons before marching downtown on June 2.[50]",
            "loc": "Tualatin"
        }
    ]
},
{
    "Oklahoma": [
        {
            "description": "On May 31, approximately 150 people peacefully marched from the HFV Wilson Community Center through the streets of downtown Ardmore and back to protest the death of George Floyd, shouting \"I can't breathe\" and \"no justice, no peace.\"[1]",
            "loc": "Ardmore"
        },
        {
            "description": "On June 5, hundreds of protesters marched through downtown Bartlesville to protest the death of George Floyd.[2]",
            "loc": "Bartlesville"
        },
        {
            "description": "On June 6, around 1,000 demonstrators marched from Central Park down Main Street and back to support Black Lives Matter and George Floyd. Before marching from Central Park, they held a moment of silence for eight minutes and forty-six seconds to honor Floyd's memory.[3]",
            "loc": "Broken Arrow"
        },
        {
            "description": "On June 6, a crowd of peaceful protesters demonstrated in front of the Edmond Police Department and marched through the streets to protest the death of George Floyd. They also protested the death of teenager Isaiah Lewis, who had been killed by Edmond police officers a year prior.[4]",
            "loc": "Edmond"
        },
        {
            "description": "A few dozen protesters peacefully demonstrated on Tuesday, June 2, by marching to the courthouse square at noon, chanting and waving signs for about an hour. Before the protesters dispersed, a city councilman appeared and invited them to attend that evening's city council meeting and speak during the public comment time.[5]",
            "loc": "Enid"
        },
        {
            "description": "One thousand people gathered and then marched around Lawton City Hall on May 31.[6]",
            "loc": "Lawton"
        },
        {
            "description": "Hundreds of protesters gathered in Norman on June 1, 2020 for a peaceful protest.[7]",
            "loc": "Norman"
        }
    ]
},
{
    "Columbus, Ohio": [
        {
            "description": "Protesters(no centralized authority)",
            "loc": "Background"
        },
        {
            "description": "Authorities:",
            "loc": "Timeline"
        },
        {
            "description": "The George Floyd protests are an ongoing series of protests and civil disturbances that initially started in the Minneapolis–Saint Paul metropolitan area of Minnesota, United States, before spreading nationwide. In Columbus, Ohio, unrest began on May 28, 2020, two days after incidents began in Minneapolis. The events are a reaction to the killing of George Floyd shortly after Minneapolis Police Department (MPD) officer Derek Chauvin knelt on his neck for 8 minutes and 46 seconds during an arrest the day before.",
            "loc": "May"
        },
        {
            "description": "The George Floyd protests are an ongoing series of protests and civil disturbances that initially started in the Minneapolis–Saint Paul metropolitan area of Minnesota, United States, before spreading nationwide. In Columbus, Ohio, unrest began on May 28, 2020, two days after incidents began in Minneapolis. The events are a reaction to the killing of George Floyd shortly after Minneapolis Police Department (MPD) officer Derek Chauvin knelt on his neck for 8 minutes and 46 seconds during an arrest the day before.",
            "loc": "May 28"
        },
        {
            "description": "Harvard University basketball player Seth Towns, who had just recently graduated from the Ivy League school and will play for Ohio State University as a graduate student, was detained at the rally.[26]",
            "loc": "May 29"
        },
        {
            "description": "In the morning of May 30, business owners began to clean up their vandalized businesses. One business reported that they hadn't had a problem with vandalism like this in their 40 years of operating. Bricks, rocks, pieces of granite, water bottles, and other debris lined the streets, while few storefronts were left untouched. Most windows were smashed, with graffiti on signs, walls, and windows across downtown. Milestone 229, at Bicentennial Park, had planned to reopen June 1, though the building was looted, stifling their reopening plans and causing significant damage.[27] As well, it was announced in the morning that COTA, the city's local transit agency, would reroute all of its buses on May 30 around downtown, with no buses traveling through the affected areas.[28]",
            "loc": "May 30"
        },
        {
            "description": "Protests began to drop in violence around May 31, and the city has begun making changes to support racial equality. On June 1, the city declared racism a public health crisis, and Police Chief Thomas Quinlan and other officers marched with protesters for the first time. Mayor Ginther also created an independent review system for police aggression that has taken place during the protests. On June 2, Ginther joined Quinlan in the protests. The city-wide curfew was lifted on June 6.",
            "loc": "May 31"
        },
        {
            "description": "The events began amid the COVID-19 pandemic, which has affected the city of Columbus along with the rest of the United States and most of the world. The protests have involved large numbers of people in close proximity, creating fears the virus will spread and create new outbreaks.[10] On June 3, Columbus Public Health identified a person who attended protests in downtown Columbus, despite feeling coronavirus symptoms on May 27, one day before protests had started downtown.[11]",
            "loc": "June"
        },
        {
            "description": "In the morning of May 30, business owners began to clean up their vandalized businesses. One business reported that they hadn't had a problem with vandalism like this in their 40 years of operating. Bricks, rocks, pieces of granite, water bottles, and other debris lined the streets, while few storefronts were left untouched. Most windows were smashed, with graffiti on signs, walls, and windows across downtown. Milestone 229, at Bicentennial Park, had planned to reopen June 1, though the building was looted, stifling their reopening plans and causing significant damage.[27] As well, it was announced in the morning that COTA, the city's local transit agency, would reroute all of its buses on May 30 around downtown, with no buses traveling through the affected areas.[28]",
            "loc": "June 1"
        },
        {
            "description": "On June 19, Franklin County (containing most of the city of Columbus) announced it is replacing Columbus Day as a paid holiday for its government employees with Juneteenth, celebrating the abolition of slavery in the U.S. The change will go into effect June 2021.[87]",
            "loc": "June 2"
        },
        {
            "description": "Mayor Ginther lifted the week-long curfew, based on peaceful protests, dialogues between protesters and police, no significant violent acts by either side, and no curfew arrests since June 3. A recent federal lawsuit was filed against the city over the curfew, because violence had decreased; the city and plaintiffs reached an agreement and the lawsuit will be dismissed.[58][31]",
            "loc": "June 3"
        },
        {
            "description": "June 4 was noted as significantly calmer than previous days of protest. The protest sites in the morning and early afternoon were largely empty. About 100 people protested on High Street by the Statehouse, while others painted murals - the Huntington Center has a large plywood wall around it, and encouraged the Greater Columbus Arts Council to recruit paid artists to paint on it, in addition to protesters' statements and art.[52]",
            "loc": "June 4"
        },
        {
            "description": "Also on June 5, about 500 medical workers (students, researchers, doctors, and nurses) participated in a demonstration at the Ohio State University's James Cancer Hospital. The event was a part of the nationwide \"White Coats for Black Lives\" movement, part of the larger Black Lives Matter movement. The protesters knelt for the 8 minutes, 46 seconds that George Floyd was pinned down for at his death. \"White Coats\" events were also held at other Central Ohio hospitals that day, including OhioHealth's Riverside Methodist Hospital, Grant Medical Center, Doctors Hospital, and Dublin Methodist Hospital.[56]",
            "loc": "June 5"
        },
        {
            "description": "About 20 employees of local chain Northstar Cafe walked out on June 6. Service and bar staff walked out of its Short North location in protest of a company policy giving a 50% discount to police and firefighters. An early response to the Floyd protests on June 3 removed the longstanding policy, though it was reinstated on June 5. In addition to the walkout, the location's kitchen manager quit immediately over the policy, though he had given a two-weeks' notice prior.[59]",
            "loc": "June 6"
        },
        {
            "description": "On June 7, City Council members including its president called for charges for some protesters to be dismissed. The officials want charges for violating curfew and failing to disperse to be dismissed; the city attorney announced some curfew charges already have been.[63]",
            "loc": "June 7"
        },
        {
            "description": "About 100 protesters marched west on Broad Street from downtown into Franklinton in support of the movement. In addition, an event was held at the Franklin County Court of Common Pleas in Columbus, involving numerous public defenders kneeling for eight minutes and 46 seconds.[64]",
            "loc": "June 8"
        },
        {
            "description": "June 9, the 13th day of protests, was the hottest day of the year so far. Crowds were smaller, though several online events were scheduled, along with additional protests into the coming weekend.[65] Also that day, about 300 Ohio State University faculty signed a letter to the school's administration, asking it to cut ties with the Columbus police.[66]",
            "loc": "June 9"
        },
        {
            "description": "On June 5, the family of a Columbus protester posted on Instagram that she had died on May 30 as the result of an asthma attack brought on by tear gas at a protest downtown two days prior. The protester, Sarah Grossman, was a 22-year-old, and a recent Ohio State University graduate. The city of Columbus responded that it was looking into her death, and anticipated the results of autopsy reports, expected to take eight weeks.[79][80] On June 10, the family released a statement that at this time, there is no evidence that the pepper spray led to her death.[81]",
            "loc": "June 10"
        }
    ]
},
{
    "Ohio": []
},
{
    "North Dakota": [
        {
            "description": "Hundreds gathered to share solidarity for the life of George Floyd at Peace Park on May 30. A witness said she saw the passenger of a pickup truck displaying a Confederate Flag and Trump 2020 regalia point a gun at the protesters.[1]",
            "loc": "Bismarck"
        },
        {
            "description": "Hundreds of protesters gathered along Third Avenue on June 2 to protest for justice for George Floyd and equality in the judicial system.[2]",
            "loc": "Dickinson"
        },
        {
            "description": "Black Lives Matter protesters marched from Island Park past the Police Station and then south on 25th Street, as reported on May 30. The protests began peacefully but became violent after 6:00 PM. Several businesses in downtown Fargo were damaged, including the historic Hotel Donaldson.[3] Nearby Moorhead, Minnesota's African-American Mayor Johnathan Judd pressed the flesh in the crowd of thousands asking people to get more involved in their community.[4]",
            "loc": "Fargo"
        },
        {
            "description": "Hundreds of protestors marched though downtown Grand Forks on June 4, in honor of George Floyd.[5]",
            "loc": "Grand Forks"
        },
        {
            "description": "On June 5, approximately 20 protesters held a rally on First Avenue to protest the death of George Floyd, chanting slogans such as \"Hands up, don't shoot.\"[6]",
            "loc": "Jamestown"
        },
        {
            "description": "On May 31 dozens of protestors gathered with signs as show of support for George Floyd and the Black Lives Matter movement.[7]",
            "loc": "Minot"
        },
        {
            "description": "On June 7, almost 50 high school students were escorted by police officers as they peacefully marched through the streets of Rugby to protest the death of George Floyd.[8]",
            "loc": "Rugby"
        },
        {
            "description": "On June 7, between 70 and 85 protesters gathered in Valley City Park and marched across the bridge and through the streets in support of Black Lives Matter.[9]",
            "loc": "Valley City"
        }
    ]
},
{
    "New York City": [
        {
            "description": "On May 25, 2020, George Floyd, an African-American man, was killed by a white police officer in Minneapolis, Minnesota. A video of the incident depicting the officer kneeling on Floyd's neck for an extended period, attracted widespread outrage leading to local, national, and international protests and demonstrations.[2]",
            "loc": "Background"
        },
        {
            "description": "On May 28, nearly 100 protesters assembled in Union Square and marched to City Hall, blocking traffic in Lower Manhattan.[9] While mostly peaceful, there were conflicts between protesters and police, leading to dozens of arrests as protesters threw objects and an officer was punched in the face.[9][10][11]",
            "loc": "May 28"
        },
        {
            "description": "Peaceful protests continued the next day, May 29, around Foley Square in Manhattan. Another group came together around the Adam Clayton Powell Jr. State Office Building in Harlem.[12] As the day went on, the protests became more violent. Groups moved to the Manhattan District Attorney's office and then over the Brooklyn Bridge.[13]",
            "loc": "May 29"
        },
        {
            "description": "On May 30, de Blasio condemned the violence of the night before by both police and protesters.[12]  Cuomo spoke with de Blasio and announced an independent review by Attorney General Letitia James of actions taken during the protests that occurred on May 29.[73] The following day, the mayor announced another investigation of police actions to be carried out by Corporation Counsel Jim Johnson and Department of Investigation Commissioner Margaret Garnett.[23] Cuomo and de Blasio, along with other public officials have largely condemned looting and violence which has taken place while supporting the right to peacefully protest.[20]",
            "loc": "May 30"
        },
        {
            "description": "Several gatherings and marches took place on May 31, including large groups which moved from Manhattan to Brooklyn and Brooklyn to Manhattan. Though mostly peaceful during the day, events in Manhattan took a turn for the violent at night.[26]",
            "loc": "May 31"
        },
        {
            "description": "On June 1, there were protests in Restoration Plaza in Bedford–Stuyvesant, as well as around Radio City Music Hall, and blocking traffic on FDR Drive. In Washington Square Park, Police Chief Terence Monahan took a knee with protesters and addressed the crowd to show solidarity.[35][34] At nightfall, a peaceful candlelight vigil took place at Astoria Park in Queens.[36]",
            "loc": "June 1"
        },
        {
            "description": "The following day, on June 2, the governor criticized handling of demonstrations the night before: \"The NYPD and the mayor did not do their job last night\" calling the video evidence of the looting \"a disgrace.\"[34] Cuomo offered to send in the National Guard, but de Blasio opposed the idea.[34] The mayor signed a Declaration of Emergency, Executive Order No. 119, imposing an even earlier curfew of 8:00 pm, in effect from June 3 through June 8.[79] The order exempts from the curfew \"police officers, peace officers, firefighters, first responders and emergency medical technicians, individuals travelling to and from essential work and performing essential work, people experiencing homelessness and without access to a viable shelter, and individuals seeking medical treatment or medical supplies.\"[80] The curfew also stopped Citi Bike rentals, ride shares, scooters, and restricted car traffic in Manhattan below 96th Street.[79][38]",
            "loc": "June 2"
        },
        {
            "description": "On the evening of June 3, there were more protesters remaining after curfew than the night before, and police were quicker to take action.[41] One group peacefully marching in Brooklyn was met by a line of police in riot gear in Cadman Plaza at about 8:45 pm. The demonstrators chanted and raised their arms for about 10 minutes while other police in riot gear surrounded them, using a technique called kettling, before moving in, striking protesters with batons, and making arrests.[42][41][43] Another group marched from Gracie Mansion towards Central Park after curfew, leading to about 60 arrests there.[44] Jumaane Williams, the New York City Public Advocate, expressed outrage at the actions police were taking against peaceful protesters.[44] In Brooklyn, two NYPD officers were reportedly shot and one was stabbed in the neck while guarding against looting during a protest.[45]",
            "loc": "June 3"
        },
        {
            "description": "On June 4, Terrence Floyd spoke at a memorial for his brother, George Floyd, at Cadman Plaza in Brooklyn, which was attended by more than 10,000 people.[46][47][48] Floyd addressed the crowd briefly, after being overcome by emotions and brought to tears. “My brother is gone, but the Floyd name lives on,” he said. “I’m just thankful about the movement that’s going on.”[49] He also added “I’m proud of the protest, but I’m not proud of the destruction..My brother wasn’t about that”, condemning the violence and looting that had occurred at some protests.[47] Several other community leaders spoke at the memorial, including Brooklyn clergyman Kevin McCall, State Attorney General Letitia James, Public Advocate Jumaane Williams, Brooklyn Borough President Eric Adams, and Mayor Bill de Blasio, whose appearance marked the first time he spoke to protesters in person.[48] Thousands of attendees marched across the Brooklyn Bridge into Manhattan after the memorial, using the bridge's Manhattan-bound roadway and the raised pedestrian walkway. Cars in the Brooklyn-bound roadway honked their horns and raised their fists in solidarity with the protesters.[47]",
            "loc": "June 4"
        },
        {
            "description": "More than 1,000 people demonstrated on June 5 at the Metropolitan Detention Center in Sunset Park, Brooklyn. Two days earlier, an inmate died after being pepper sprayed by guards.[58][52] Another 500 rallied in Columbus Circle.[55] Though the protests were mostly peaceful during the day, there were again some conflicts after curfew. Around 40 arrests were made around Grand Army Plaza in Brooklyn.[55] The Times reported on groups of volunteers setting up \"jail support\" sites, providing medical supplies, hand sanitizer, shoelaces, food, and advice to people as they were released after being arrested.[52]",
            "loc": "June 5"
        },
        {
            "description": "Peaceful protests continued on June 6, with the 8:00 pm – 5:00 am curfew still in effect. At the end of the day, there were only four arrests and 24 summonses issued.[59]",
            "loc": "June 6"
        },
        {
            "description": "The citywide curfew ended on June 7, a day earlier than expected, after arrests had reduced significantly in the preceding days.[60][59] According to the Times, marches that day \"were largely jubilant, with the police taking a more passive role with protesters, and protesters in turn avoiding clashes with the police.\"[61]",
            "loc": "June 7"
        },
        {
            "description": "The following day, on June 2, the governor criticized handling of demonstrations the night before: \"The NYPD and the mayor did not do their job last night\" calling the video evidence of the looting \"a disgrace.\"[34] Cuomo offered to send in the National Guard, but de Blasio opposed the idea.[34] The mayor signed a Declaration of Emergency, Executive Order No. 119, imposing an even earlier curfew of 8:00 pm, in effect from June 3 through June 8.[79] The order exempts from the curfew \"police officers, peace officers, firefighters, first responders and emergency medical technicians, individuals travelling to and from essential work and performing essential work, people experiencing homelessness and without access to a viable shelter, and individuals seeking medical treatment or medical supplies.\"[80] The curfew also stopped Citi Bike rentals, ride shares, scooters, and restricted car traffic in Manhattan below 96th Street.[79][38]",
            "loc": "June 8"
        },
        {
            "description": "As of June 9, prosecutors are considering charges against up to 40 officers related to their actions during the protests.[19] As of June 12, police department officials have declined to specify how many complaints it has received about police actions during the protests.[74]",
            "loc": "June 9"
        },
        {
            "description": "There were several controversial interactions between police and protesters, including examples of alleged excessive force. Governor Andrew Cuomo and de Blasio announced investigations into several reported instances of police violence, but police actions have drawn criticism from several stakeholders and reporters.[38][8] The Black, Latino and Asian Caucus of the New York City Council released a statement 30 which said the NYPD \"[acted] with aggression towards New Yorkers who vigorously and vociferously but nonetheless peacefully advocated for justice\".[8]",
            "loc": "June 10"
        },
        {
            "description": "On May 30, de Blasio condemned the violence of the night before by both police and protesters.[12]  Cuomo spoke with de Blasio and announced an independent review by Attorney General Letitia James of actions taken during the protests that occurred on May 29.[73] The following day, the mayor announced another investigation of police actions to be carried out by Corporation Counsel Jim Johnson and Department of Investigation Commissioner Margaret Garnett.[23] Cuomo and de Blasio, along with other public officials have largely condemned looting and violence which has taken place while supporting the right to peacefully protest.[20]",
            "loc": "June 11"
        },
        {
            "description": "As of June 9, prosecutors are considering charges against up to 40 officers related to their actions during the protests.[19] As of June 12, police department officials have declined to specify how many complaints it has received about police actions during the protests.[74]",
            "loc": "June 12"
        },
        {
            "description": "A Black Lives Matter mural, which volunteers began painting the day before, was finished on June 14. The words \"Black Lives Matter\" are written in large yellow letters along Fulton Street in the Bedford-Stuyvesant neighborhood of Brooklyn, accompanied by the names of people killed by racial violence like George Floyd.[69][70][71]",
            "loc": "June 14"
        },
        {
            "description": "After the South Bronx kettling incident on June 4, Commissioner Dermot Shea said the demonstration was led by \"outside agitators\" who coordinated bringing guns and gasoline to use in the demonstration, \"advertising that they were going to burn things down, that they were going to injure cops, that they were going to cause mayhem\".[53] Gothamist reported on the lack of evidence for claims of outside agitators. The NYPD had mentioned a gun and gasoline, but the gun was taken from a gang member hours earlier a half mile away and there was no evidence of gasoline.[54] The South Bronx protests were organized by Shannon Jones of Bronxites for NYPD Accountability and Shellyne Rodriguez of Take Back the Bronx, both of whom were arrested.[81]",
            "loc": "Government response"
        },
        {
            "description": "The Guardian criticized comments by the Police Benevolent Association, which described its members as being \"under attack by violent, organized terrorists\", as well as Sergeants Benevolent Association president Ed Mullins, who told his members \"to report for duty with your helmet and baton and do not hesitate to utilize that equipment in securing your personal safety\".[8]",
            "loc": "Curfew"
        }
    ]
},
{
    "North Carolina": [
        {
            "description": "A peaceful protest was held in Goldsboro on the evening of May 31 until roughly 10 p.m. The protest started on Center Street before moving to the Wayne County, North Carolina courthouse and then the local police station. \"Hands Up, Don't Shoot,\" \"Black Lives Matter\" and \"no Justice, No Peace\" were the most common chants made among protesters. No vandalism was reported.[24]",
            "loc": "Asheville"
        },
        {
            "description": "Hundreds of protestors were reported in downtown Greensboro on May 30. They marched from the downtown area to I-40, forcing the closure of that interstate highway. Police reported using pepper spray after some individuals threw rocks at officers. A reporter from WFMY News also reported the use of tear gas.[25] There were reports of damage to businesses and some looting later in the evening.[26] There were no reports of injuries. The mayor enacted a city-wide curfew on Monday, June 1.[27] A virtual town hall has been scheduled for June 18 to discuss policing and law enforcement.[28]",
            "loc": "Beaufort"
        },
        {
            "description": "Police estimated more than 1000 people participated in a demonstration on May 31.[29] The protest later turned violent, with 31 businesses damaged, 13 police and sheriff cars damaged, two small vegetation fires set, flags overturned, and damage to the courthouse. Officers were injured by rocks and bottles that were thrown.[30] Police used tear gas to help disperse the crowd. Two individuals were arrested.[29] The city issued a curfew for the next two nights.[31]",
            "loc": "Boone"
        },
        {
            "description": "Protesters blocked roads and broke glass on May 31. Police used tear gas to disperse the crowd.[32] On June 1, the city issued a state of emergency and a curfew that will continue indefinitely.[33]",
            "loc": "Burnsville"
        },
        {
            "description": "A peaceful protest took place on June 7, 2020. Congresswoman Alma Adams spoke at the rally.[34]",
            "loc": "Chapel Hill"
        },
        {
            "description": "Peaceful protests have been taking place most days from 11am to 7pm since May 31, 2020. They initially took place on Arendell Street between 6th street and 7th street and moved to Arendell Street between 10th and 11th starting June 5. The protests are organized by the newly formed group, Black Lives Matter - Carteret County.[35] About 20-25 protesters attended on May 31.[36] On June 13, the group moved back to 7th Street and Arendell Street so that about 100 people gathered on and lay facedown for 8 minutes and 46 seconds in honor of George Floyd.[37] Protests continue. The group has no planned end date for the daily demonstrations.[35]",
            "loc": "Charlotte"
        },
        {
            "description": "About 40 protestors gathered on May 30.[38]",
            "loc": "Clinton"
        },
        {
            "description": "More than 100 protesters gathered at the Newton Police Department and then marched through the small town on June 1.[39][40]",
            "loc": "Dunn"
        },
        {
            "description": "On May 30, a peaceful protest event named \"A National Day of Action — Justice for George Floyd, Breonna Taylor, Ahmaud Arbery and lives cut short by Raleigh and Durham police departments,\" was organized, with crowds gathering by the Wake County Justice Center before marching up Fayetteville Street. By 6 p.m., the number of protesters had grown to around 1,000 people. Around 6:45, the protests descended into chaos as people began throwing objects at Raleigh police officers,[41] resulting in officers using tear gas and pepper spray on the crowds.[42] Officers continued to deploy tear gas through the evening. Nearly every storefront along Fayetteville street was vandalized.[41] From 11:30 p.m. on May 30 through 2 a.m. May 31, people looted and vandalized downtown businesses, including breaking windows and setting fires, causing police to deploy tear gas in heavier amounts. By 6 a.m., Raleigh police reported protests in the city had ceased. 12 people were arrested and five officers were sent to hospitals, including one with a broken jaw.[43] On June 1, the mayor of Raleigh issued a city-wide curfew from 8 p.m. to 5 a.m. in an attempt to end the riots.[44]  Police also fired on employees of a gay bar who were operating a first aid station in their parking lot.[45]",
            "loc": "Durham"
        },
        {
            "description": "On May 30, a peaceful protest event named \"A National Day of Action — Justice for George Floyd, Breonna Taylor, Ahmaud Arbery and lives cut short by Raleigh and Durham police departments,\" was organized, with crowds gathering by the Wake County Justice Center before marching up Fayetteville Street. By 6 p.m., the number of protesters had grown to around 1,000 people. Around 6:45, the protests descended into chaos as people began throwing objects at Raleigh police officers,[41] resulting in officers using tear gas and pepper spray on the crowds.[42] Officers continued to deploy tear gas through the evening. Nearly every storefront along Fayetteville street was vandalized.[41] From 11:30 p.m. on May 30 through 2 a.m. May 31, people looted and vandalized downtown businesses, including breaking windows and setting fires, causing police to deploy tear gas in heavier amounts. By 6 a.m., Raleigh police reported protests in the city had ceased. 12 people were arrested and five officers were sent to hospitals, including one with a broken jaw.[43] On June 1, the mayor of Raleigh issued a city-wide curfew from 8 p.m. to 5 a.m. in an attempt to end the riots.[44]  Police also fired on employees of a gay bar who were operating a first aid station in their parking lot.[45]",
            "loc": "Fayetteville"
        }
    ]
},
{
    "New York (state)": [
        {
            "description": "There have been a series of George Floyd protests in New York.",
            "loc": "Central New York"
        },
        {
            "description": "Nearly 100 protesters assembled in Union Square on May 28; in addition, 72 protesters were arrested[98] and several police officers were lightly injured. Protesters marched to City Hall and shut down traffic in Lower Manhattan.[99][100][101] The following day, May 29, peaceful protests resumed around Foley Square in Manhattan, but later protesters clashed with police at Barclays Center in Brooklyn and demolished two police vehicles in the Fort Greene neighborhood.[98] Governor Andrew Cuomo spoke with New York City Mayor Bill de Blasio and announced an independent review, done by Attorney General Letitia James, of actions taken during the protests that occurred on May 29.[102] In Brooklyn, a video of a crowd of protesters clashing with two NYPD vehicles that appeared to accelerate and push a number of people was released.[103][104]",
            "loc": "Hudson Valley"
        },
        {
            "description": "In the borough of Staten Island, Reverend Al Sharpton, Gwen Carr—the mother of Eric Garner, who was killed in 2014 from being chokeholded by police—and other community activists held a vigil for George Floyd on May 30.[105]",
            "loc": "Long Island"
        },
        {
            "description": "On June 1, Governor Cuomo and Mayor de Blasio declared an 11 pm curfew for New York City, to last until 5 a.m. the next morning, the first since the Harlem riot of 1943, which followed a white police officer shooting an African American soldier.[106] The next day, a curfew from 8 p.m. to 5 a.m. was announced, until June 7.[107]",
            "loc": "New York City"
        }
    ]
},
{
    "New Mexico": [
        {
            "description": "Hundreds of people protested May 28, and tear gas was deployed, but no one was injured.[1] Part of the city was shut down. Several shots were fired from a vehicle in the area of Wisconsin and Central, while a female sergeant was approached by several people and had her vehicle damaged. Four people were taken into custody. Several rioters were seen on camera approaching vehicles and were attempting to damage the vehicles and drag civilians out of their cars. One vehicle in particular was driving around firing shots. It is unclear how many shots were fired by that specific vehicle, though shot spotter technology determined that there were about 33 total registered reports of shots fired in the area. Police were able to initiate a traffic stop and take four individuals into custody, including one who initially fled on foot. While officers were trying to process the scene, a group of people started to cause problems for the officers. One person allegedly used a baseball bat to hit several police vehicles, breaking the windows.[2]",
            "loc": "Albuquerque"
        },
        {
            "description": "About 80 protesters demonstrated peacefully at the Eddy County Courthouse in the early evening of May 30.[3]",
            "loc": "Carlsbad"
        },
        {
            "description": "On June 5, around 200 protesters stood at the Clovis-Carver Public Library parking lot to protest the death of George Floyd.[4]",
            "loc": "Clovis"
        },
        {
            "description": "On June 1, More than 400 people shouted \"I Can't Breathe\" at a protest organized by the San Juan College Young Democratic Socialists of America in front of the Animas Valley Mall.[5]",
            "loc": "Farmington"
        },
        {
            "description": "On June 3, Some 150 protesters marched from the north side of town to downtown Gallup.[6]",
            "loc": "Gallup"
        },
        {
            "description": "On May 30, About 40 people protested peacefully at the intersection of Main Street and Picacho Avenue in the afternoon.[7] June 1: Hundreds of protesters, including a number of NMSU basketball players,  held signs that said \"I Can't Breathe\" and \"Get Off My Neck\" in Las Cruces.[8]",
            "loc": "Las Cruces"
        },
        {
            "description": "This town of 19,000 people recorded three protests: “about 200 people” on May 31,[9] “more than 300” on June 4[10] and “more than 200” on June 6.[11]",
            "loc": "Los Alamos"
        },
        {
            "description": "On June 6, about 100 people held a protest outside Rio Rancho City Hall to support Black Lives Matter.[12]",
            "loc": "Rio Rancho"
        }
    ]
},
{
    "Kansas": [
        {
            "description": "About 200 people attended a protest on the campus of Coffeyville Community College on June 4.[3]",
            "loc": "Coffeyville"
        },
        {
            "description": "On June 3, around 150 people held a peaceful protest at the intersection of Madison and Rock to support Black Lives Matter raise awareness of racial injustice and police brutality.[4]",
            "loc": "Derby"
        },
        {
            "description": "On May 31, several people protested at the intersection of National Avenue and U.S. Highway 69, and the following day a larger protest was held on the front steps of Memorial Hall.[5]",
            "loc": "Fort Scott"
        },
        {
            "description": "On June 1, a group of young people organized a protest at the courthouse square.[6]",
            "loc": "Great Bend"
        },
        {
            "description": "On May 31, around 120 people gathered near 27th and Vine St. for a peaceful protest.[7]",
            "loc": "Hays"
        },
        {
            "description": "On May 31, several hundred people gathered in front of the court house for a peaceful protest.[8]",
            "loc": "Hutchinson"
        },
        {
            "description": "On May 31, several hundreds of people peacefully marched down Massachusetts Street.[9]",
            "loc": "Lawrence"
        },
        {
            "description": "On June 6, residents gathered for a Unity Walk that started at the Richard Allen Cultural Center and ended at Bob Dougherty Park.[10]",
            "loc": "Leavenworth"
        },
        {
            "description": "On May 30 and 31 protests took place in Kansas City, Kansas as well as nearby Kansas City, Missouri.[11] As of June 7, protesters had been gathering in Kansas for ten consecutive days.[12]",
            "loc": "Kansas City"
        },
        {
            "description": "On May 30, protesters marched down Bluemont Avenue. A second protest at Triangle Park in Aggieville occurred June 1.[13]",
            "loc": "Manhattan"
        },
        {
            "description": "On June 5, residents gathered at Olathe City Hall to remember George Floyd.[14] A second protest took place on June 6 at the intersection of Santa Fe and Mur-Len Roads in honor of George Floyd.[15]",
            "loc": "Olathe"
        },
        {
            "description": "On June 6, the community of Parsons held a peaceful protest and prayer vigil.[16]",
            "loc": "Parsons"
        },
        {
            "description": "On May 30, about 500 people peacefully protested in front of the Kansas State Capitol.[17]",
            "loc": "Topeka"
        },
        {
            "description": "On May 30, nearly two thousand peaceful protesters marched around parts of Wichita before dispersing by the end of the day.[18]",
            "loc": "Wichita"
        },
        {
            "description": "On May 30, twenty-five people protested in Winfield, and a second protest was organized for Friday June 5. Reportedly many black people stayed home out of fear.[19]",
            "loc": "Winfield"
        }
    ]
},
{
    "Iowa": [
        {
            "description": "Roughly 300 people gathered the evening of May 30 to march around Ames' City Hall.[1]",
            "loc": "Ames"
        },
        {
            "description": "Protestors gathered at the Linn County Courthouse on May 29, 2020.[2]",
            "loc": "Cedar Rapids"
        },
        {
            "description": "May 30: More than 500 people in LaClaire Park to protest.[3] Rocks were thrown during part of the protest.[4] May 31: Dozens of shots were fired all over the city. At midnight, a 22-year-old female protester was shot in the back and died. A police officer injured in a drive-by shooting was recovering and in \"good spirits.\"[5][6] On June 1, at around 3:00 a.m., three Davenport police officers were ambushed by gunfire while on patrol. Two of the officers were injured while the third returned fire.[7]",
            "loc": "Davenport"
        },
        {
            "description": "About 200 people gathered on Water Street on the afternoon of May 31 to protest.[8]",
            "loc": "Decorah"
        },
        {
            "description": "Hundreds of protesters clashed with police outside of the city's police headquarters on May 29. Some protesters threw bottles, rocks, bricks, and fire crackers at officers and windows were smashed at nearby buildings in the city's East Village neighborhood. Tear gas and pepper spray were used.[9] A protest and march on May 30 spilled to Iowa State Capitol steps and the city's Court Avenue entertainment district, where windows were broken at the Polk County Courthouse and several businesses were vandalized.[10]",
            "loc": "Des Moines"
        },
        {
            "description": "About 100 protesters lay on the ground to honor George Floyd in Jackson Park on June 1. Speakers included the President of the Dubuque chapter of the NAACP and a woman who sued the city for injuring her with a Taser in 2019.[11]",
            "loc": "Dubuque"
        },
        {
            "description": "Hundreds protested the afternoon of May 30 at the Pentacrest on the University of Iowa campus. Streets were blocked to allow protesters to maintain social distance due to the COVID-19 pandemic.[12]",
            "loc": "Iowa City"
        },
        {
            "description": "May 31: About 30 people held signs along North Washington Street near Central Park around 9:30pm Sunday Night.[13]",
            "loc": "Mason City"
        },
        {
            "description": "On June 5, over 100 protestors rallied in Central Park and marched through downtown.[14]",
            "loc": "Ottumwa"
        },
        {
            "description": "On May 29, about 100 protesters marched to the Sioux City Police/Fire Headquarters building.[15][16] June 5: Hundreds gathered at 3pm for a protest at Cook Park.[17]",
            "loc": "Sioux City"
        }
    ]
},
{
    "Indiana": [
        {
            "description": "More than 100 people attended a march through downtown and congregated at the Anderson Police Department headquarters on May 30. After midnight, a car window was broken and water bottles were thrown at police, but no injuries were reported.[1][2]",
            "loc": "Anderson"
        },
        {
            "description": "Nearly 500 people gathered on June 11 for a peaceful protest organized by recent grads and current high school students outside Avon Town Hall. Roughly a dozen speakers spoke at the event.[3][4]",
            "loc": "Avon"
        },
        {
            "description": "More than 100 protesters gathered at the Lawrence County Courthouse Square for a rally on June 7. Some passersby attempted to drown out the rally with music, but the gathering was peaceful.[5]",
            "loc": "Bedford"
        },
        {
            "description": "Thousands attended a rally that began on the Indiana University campus and ended in downtown Bloomington on June 5.[6]",
            "loc": "Bloomington"
        },
        {
            "description": "Several hundred people gathered on June 11 for a peaceful protest that included a lineup of speakers on the lawn outside the Brownsburg town hall. The crowd was bigger than expected.[7][8]",
            "loc": "Brownsburg"
        },
        {
            "description": "Hundreds of protesters attended a peaceful march downtown on June 1.[9]",
            "loc": "Carmel"
        },
        {
            "description": "More than 100 demonstrators met to protest racial injustice on June 6. The protesters performed a lie-in for eight minutes and 46 seconds before marching through downtown Crawfordsville. The gathering remained peaceful.[10]",
            "loc": "Crawfordsville"
        },
        {
            "description": "On June 11, over 100 protesters sang the Michael Jackson song \"Man in the Mirror\" as they marched through downtown Elkhart to Civic Plaza to show solidarity with Black Lives Matter and George Floyd.[11]",
            "loc": "Elkhart"
        },
        {
            "description": "On May 30, a rally being held downtown gathered a crowd of 300. The rally was mostly peaceful, but four protesters were arrested in the evening.[12]",
            "loc": "Evansville"
        },
        {
            "description": "On May 29, hundreds gathered outside the Allen County Courthouse in a peaceful demonstration that turned violent after police fired off tear gas in response to protesters blocking traffic by sitting in the road at Clinton and Main Street, refusing to move. Some establishments were vandalized.[13][14]",
            "loc": "Fort Wayne"
        },
        {
            "description": "On May 31, demonstrators marched from the Elkhart County Courthouse down Main Street to honor George Floyd and David McAtee. No violence or injuries were reported.[15]",
            "loc": "Goshen"
        },
        {
            "description": "A few hundred people came together at a park in Greenwood on Friday, June 12.[16]",
            "loc": "Greenwood"
        },
        {
            "description": "Several hundred people attended a rally organized by \"Black Lives Matter-Gary\" outside the Hammond Police Station on May 30.[17]",
            "loc": "Hammond"
        },
        {
            "description": "As of June 11, Indianapolis had seen 14 consecutive days of demonstrations.[18] As of June 16, smaller daily protests were still occurring downtown.[19] On May 29, protesters and police clashed downtown. Some protesters broke windows of businesses. Several officers were injured.[20] Tear gas and rubber bullets were used to disperse crowds.[20] During the night of May 30, three people were killed and two more injured in several shootings.[21][22]",
            "loc": "Indianapolis"
        },
        {
            "description": "A former correctional officer injured two people in a hit-and-run against a group of protesters on May 30. Protesters blocked streets on June 1 and demanded consequences for the driver, who was arrested and charged with three counts the next day.[23][24]",
            "loc": "Kokomo"
        },
        {
            "description": "Around 1,200 protested at a peaceful march on May 31. Despite a largely peaceful protest, minor vandalism occurred and tear gas and rubber bullets were fired without warning.[25] Protests in following days were smaller and more unruly, with five arrests and significantly more police force being used.[26]",
            "loc": "Lafayette"
        },
        {
            "description": "Two high school students joined nation protest on Friday, May 29. By Saturday May 30, 40 other protestors had jointed them. By Sunday, May 31 more than 100 protestors gathered outside the courthouse.[27]",
            "loc": "Marion"
        },
        {
            "description": "Around 80 people met at the Morgan County courthouse square to protest in support of Black Lives Matter on June 7. The group was met by at least 30 counter-protesters, some of whom were armed.[28]",
            "loc": "Martinsville"
        },
        {
            "description": "Thousands marched from the Ball State University campus to Muncie City Hall on June 4, forming one of the largest protests in city history.[29]",
            "loc": "Muncie"
        },
        {
            "description": "Hundreds gathered for a rally and march through downtown Richmond on May 31. Organizers spoke about experiences with policing and the protest remained peaceful.[30]",
            "loc": "Richmond"
        }
    ]
},
{
    "Chicago": [
        {
            "description": "The George Floyd protests in Chicago are a series of civil disturbances currently occurring since May 26 in the city of Chicago, Illinois. Unrest in the city began as a response to the killing of George Floyd in police custody in Minneapolis on May 25, 2020, and numerous protests, rallies and marches have taken place in Chicago ever since. The demonstrations, supporting justice for Floyd and protesting police brutality, are occurring simultaneously with those of over 100 other cities in the United States. Chicago is among 12 major cities that declared curfews in order to prevent looting and vandalism.[4] On May 31, Mayor Lori Lightfoot asked Illinois Governor J.B. Pritzker to send the Illinois National Guard to Chicago for the first time in 52 years since the 1968 riots in Chicago.[5]",
            "loc": "Events"
        },
        {
            "description": "On May 28, Chicago Mayor Lori Lightfoot compared Floyd's death to the murder of Laquan McDonald, saying \"there but for the grace of God goes Chicago.\"[6] Chicago Police Department Superintendent David Brown required officers to watch the video of Floyd's death and undergo training on positional asphyxiation.[7]",
            "loc": "May 28"
        },
        {
            "description": "Protesters gathered on May 29 in Millennium Park and marched through the Loop chanting Floyd's name.[8] Demonstrators shut down several downtown streets and blocked traffic on the Eisenhower Expressway.  Near the intersection of State and Harrison streets, several protesters were seen throwing bottles and climbing onto cars.[9][10] One individual was arrested while carrying a gun.[10] A small group of protesters demonstrated in front of Trump Tower near midnight.[10] The protesters eventually broke up once they reached the Near North Side neighborhood, and protests eventually died down by the early-morning hours.",
            "loc": "May 29"
        },
        {
            "description": "During protests on Saturday, May 30, one person died and six were shot.[11] The Chicago Police reported multiple arrests and damaged property.[12] About a dozen officers were injured, including one who suffered a broken wrist.[13] Around 108 arrests were confirmed on the night of May 29–30,[14] and Mayor Lightfoot called on protesters to remain peaceful, stating that \"it's not easy when we have a president who is inciting violence. Let's be better than him.\"",
            "loc": "May 30"
        },
        {
            "description": "Almost every storefront on Michigan Avenue saw some form of damage on Saturday evening, including the Loop locations of Zara, Nike, CVS, Walgreens, Neiman Marcus, and the Macy's storefront on State Street.[21] Several shootings occurred well into the night: 2 males were shot at 9:30 pm on the 0 west block of Jackson Boulevard, and a 19-year-old man was shot an hour later on the 200 north block of Michigan Avenue. At 11 pm, another two males were shot at, this time  on the 100 west block of Hubbard Street. One of them was pronounced dead at the scene, and the other suffered injuries.[19][18] Shortly after 11:30 pm, the Chicago Fire Department responded to a fire at the Central Camera Company store on the 200 south block of Wabash Avenue. As a result of protests, the CTA temporarily suspended its services in the downtown area, and the northbound lanes of Lake Shore Drive at Roosevelt Road were closed. By the morning of May 31, most of the drawbridges spanning the Loop and River North remained up.[18] The Chicago Police Department announced that 204 arrests were made on Saturday the 30th.[22] 20 officers were confirmed to have been injured.[23]",
            "loc": "May 31"
        },
        {
            "description": "Multiple stores in Washington Park were looted during the evening, and another wave of looting appeared in the Wicker Park neighborhood, starting on Sunday night and lasting well into the early hours of Monday, June 1. Dozens of people were seen near a Foot Locker in the vicinity of the Milwaukee and Ashland Avenues intersection in Wicker Park.[31]  Firefighters responded early Monday to a fire at the 95th Street shopping center in the Jeffery Manor neighborhood.[24] According to initial reports, 82 people were shot, 19 fatally, in Chicago over the May 30–31 weekend. The weekend surpassed the previous May 23–24 weekend, which was the most deadly Memorial Day weekend in Chicago since 2015 with 49 individuals shot in total and 9 deaths, becoming the most deadly weekend of the year to that date. Over half of the May 30–31 weekend victims were shot on Sunday.[30]",
            "loc": "June 1"
        }
    ]
},
{
    "Illinois": [
        {
            "description": "On the night of May 31, rioters in Aurora looted shops and set a series of fires throughout the suburb's downtown area, already financially debilitated by the COVID-19 lockdown. Police responded by firing tear gas and shooting rubber bullets at the crowd, which reached about 500 people in size at its height. The demonstrators, in turn, hurled pieces of concrete and other items at officers. Besides plundering local businesses, the crowds set fire to 3 police vehicles, a bank drive-thru, and a Family Dollar location. A gas tank on one squad car exploded, and flames consumed the entire vehicle.[3]",
            "loc": "Aurora"
        },
        {
            "description": "On June 6, hundreds gathered in Citizens Park to protest police brutality and other issues in the black community.[4]",
            "loc": "Barrington"
        },
        {
            "description": "On June 3, around 175 people marched to the St. Clair County Building in support of Black Lives Matter and called for justice for George Floyd.[5]",
            "loc": "Belleville"
        },
        {
            "description": "On May 29, a group of around 10 to 15 protesters gathered during the evening and demonstrated at the median of the intersection of Veterans Parkway and Clearwater Avenue. Protesters stated that the event initially consisted of a small group of people, but others eventually joined the demonstration.[6]",
            "loc": "Bloomington"
        },
        {
            "description": "The Kankakee County sheriff department encouraged residents and motorists to avoid the Northfield Square Mall after reports of looting on May 31.[7]",
            "loc": "Bradley"
        },
        {
            "description": "Following reports of looting and damaged buildings at River Oaks Mall the evening of May 31, a mandatory curfew was implemented.[7]",
            "loc": "Calumet City"
        },
        {
            "description": "On June 2, dozens of protesters gathered at Jones Park for the Stop the Hate protest. The event remained peaceful with no arrests or violent acts made. There were no reports of looting during the protest, and there have been no reports made thus far.[8]",
            "loc": "Canton"
        },
        {
            "description": "Hundreds of protesters organized by Champaign–Urbana Black Lives Matter gathered at the Champaign County Courthouse in Urbana on June 1. Speakers and city officials were heard and then the crowd took to the streets. At one point, a road was unblocked so a vehicle could get to Carle Foundation Hospital.[9][10] The protesters marched to the Urbana Police Department for more speeches, particularly concerning the April arrest in Urbana of Aleyah Lewis, and then continued towards downtown Champaign, ending at the Champaign Police Department.[11] A second march through Champaign on June 6, primarily organized by high school students and recent graduates, drew thousands of protesters.[12]",
            "loc": "Champaign–Urbana"
        },
        {
            "description": "Numerous protests occurred over the course of five days[which?] in Chicago.[failed verification]",
            "loc": "Chicago"
        },
        {
            "description": "Authorities were responding to reports of looting at a Best Buy location on the 1400 block of Butterfield Road. Village officials encouraged residents to remain in their homes and for establishments to close immediately.[7]",
            "loc": "Downers Grove"
        },
        {
            "description": "Elgin police officer busts a move, and the protest audience loves it.[13]",
            "loc": "Elgin"
        },
        {
            "description": "On May 29, a Black Lives Matter protest began at 2:00 p.m. at the intersection of Caton Farm Road and Route 59. The event was scheduled to end at 4:30 p.m., and around 100 protesters had gathered by 3:00 p.m.. The demonstration remained peaceful, and one group consisted of local high school students.[14]",
            "loc": "Joliet"
        },
        {
            "description": "On the afternoon of June 1,  hundreds of peaceful protesters in LaSalle marched from the LaSalle Fire Station to City Hall and observed nine minutes of silence. Many local residents threatened to bring guns to the protest in case it turned violent, but no violence occurred.[15]",
            "loc": "LaSalle"
        },
        {
            "description": "About 500 protesters gathered at the Piatt County Courthouse in Monticello on June 6 for speeches, then marched around the business district and concluded the protest back at the courthouse.[16]",
            "loc": "Monticello"
        },
        {
            "description": "An estimated 40-60+ marched against brutality on Broadway. No arrests were made.[17]",
            "loc": "Mount Vernon"
        },
        {
            "description": "Hundreds of protesters gathered outside the Naperville Police Department on June 1. The Mayor and other officials \"took a knee\" with the protesters.[18]",
            "loc": "Naperville"
        },
        {
            "description": "Residents received an alert on May 31 warning them to “stay close to home and remain vigilant,” as protesters were traveling during the afternoon near the stretch of the Lincoln Highway in the area.[7]",
            "loc": "New Lenox"
        },
        {
            "description": "About 300 protesters gathered and marched peaceful around the Ogle County Courthouse Square on June 12, 2020. The protestors held a moment of silence for 8:46 in honor of Floyd at the end of the march.  Money was also raised through donations and the sale of goods to fund various BLM causes.",
            "loc": "Oregon"
        },
        {
            "description": "Protests took place near Orland Square Mall as well as near 159th Street and LaGrange Road, according to the Orland Park Police Department.[7]",
            "loc": "Orland Park"
        },
        {
            "description": "Thousands of protesters marched from the Gateway Building to the Peoria Police Department on May 30; the crowd was peaceful and people from a variety of races and ages, including children, attended.[19]  Protests also started at a Walmart in Peoria, then appeared at the Walmart in East Peoria.  The East Peoria police chief said that the protests were mostly peaceful, but that the police responded with pepper balls in instances when projectiles were thrown at the police line, and the side of a nearby Lowe's hardware store was set on fire.[20]  No one was injured in those incidents.[21]",
            "loc": "Peoria"
        },
        {
            "description": "On May 30, about 1,000 protesters gathered in Rockford to protest the death of George Floyd. The protests soon turned violent and the Rockford Police Department District 1 building was vandalized with damaged signs and broken windows.[25]",
            "loc": "Rockford"
        },
        {
            "description": "Peaceful protesters gathered at the town square at the corner of Schaumburg Road and Roselle Road.[26]",
            "loc": "Schaumburg"
        }
    ]
},
{
    "Idaho": [
        {
            "description": "A handful of people protested in front of the Idaho State Capitol on May 30.[1] Hundreds more gathered on the same steps on May 31.[2] On Monday night, June 1, 100 to 150 protesters gathered at the Capitol again; two opposing groups were present, according to one report.  A single gunshot was fired during the protest; Boise Police subsequently arrested an 18-year-old man and said the incident was being investigated as accidental or unintentional.[3]",
            "loc": "Boise"
        },
        {
            "description": "A group of around 25 protesters, mostly young people in their teens and 20s, gathered June 2, in the city's downtown. Over 1000 armed spectators looked on and the event remained peaceful.[4] On June 4, a group of 150 walked downtown followed by another group of \"peacekeepers.\"[5]",
            "loc": "Coeur d’Alene"
        },
        {
            "description": "On June 2, over 800 people marched down Main Street to protest the death of George Floyd. Police officers joined the demonstrators as they took a knee and held an eight-minute, forty-six-second moment of silence to honor Floyd.[6]",
            "loc": "Hailey"
        },
        {
            "description": "About 70 people protested on the Broadway Bridge on May 30.[7]",
            "loc": "Idaho Falls"
        },
        {
            "description": "On June 2, hundreds of protesters marched to protest police brutality and held a moment of silence for eight minutes and forty-six seconds in honor of George Floyd.[8]",
            "loc": "Ketchum"
        },
        {
            "description": "On June 6, approximately 1,000 people gathered in Kiwanis Park to support Black Lives Matter and George Floyd. A 10-minute moment of silence was held before the protesters began marching through the streets.[9] Armed members of the counter-protest group Protect LC Valley marched through downtown Lewiston, a mile away from the Black Lives Matter protest, to prevent riots and lootings. Both protests were peaceful.[10]",
            "loc": "Lewiston"
        },
        {
            "description": "On June 3, 2020, hundreds gathered in the Portneuf Wellness Complex in Pocatello for the “Kneel For Nine Unity March.” The event was a tribute to George Floyd.[11] Idaho State's student athletes also lead protests of their own, several hundred people marched in support.[12]",
            "loc": "Pocatello"
        }
    ]
},
{
    "Hawaii": [
        {
            "description": "On June 6, around 400 people held a \"paddle out\" around Hanalei Pier at Black Pot Beach Park to support Black Lives Matter and protest the death of George Floyd and others who had died from police violence.[1]",
            "loc": "Hanalei"
        },
        {
            "description": "On June 3, at least 200 protesters gathered in Hilo, in memory of Floyd.[2]",
            "loc": "Hilo"
        },
        {
            "description": "On June 3, at least 200 people gathered outside of the Hawaii State Capitol in Urban Honolulu protesting the death of George Floyd. Protesters, many of whom were Native Hawaiians, Pacific Islanders, and Asian Americans expressed solidarity with Floyd given the racial injustices they have felt also being minorities in the United States.[3]",
            "loc": "Honolulu"
        },
        {
            "description": "On May 30, about 150 protesters gathered at the intersection of Hāna Highway and Haleakalā Highway near downtown Kahului protesting the death of Floyd.[4]",
            "loc": "Kahului"
        },
        {
            "description": "On June 2 and June 3, protests occurred in and around Kailua-Kona.[5]",
            "loc": "Kailua-Kona"
        },
        {
            "description": "On May 31, a peaceful paddle out and vigil was held for George Floyd off the beaches of West Maui.[6]",
            "loc": "Kaanapali"
        },
        {
            "description": "On May 31, over 300 people took part in a \"paddle out\" on Launiupoko Beach to honor George Floyd.[7]",
            "loc": "Launiupoko"
        },
        {
            "description": "On June 3, over 100 people gathered at the Lihue Civic Center to protest the death of George Floyd. They walked through the streets and posed with police officers at the Historic County Building.[8]",
            "loc": "Lihue"
        },
        {
            "description": "On June 5, a student-led protest in Waikiki was held, with some protesters calling to defund the Honolulu Police Department.[9]",
            "loc": "Waikiki"
        }
    ]
},
{
    "Georgia": [
        {
            "description": "On May 30, about 40 or 50 protesters peaceably demonstrated with signs and chants. They lined up along Slappey Boulevard on a vacant lot, where they were joined by local officials and supplied with bottled water by Albany police.[4]",
            "loc": "Albany"
        },
        {
            "description": "Protesters blocked Broad Street starting around lunchtime on May 29 at the University of Georgia.[5] On May 31, several hundred protesters marched through downtown for several hours ending at the Arch. By midnight, a group of 100 would not leave, and police subsequently used tear gas to disperse it.[6]",
            "loc": "Athens"
        },
        {
            "description": "A peaceful march occurred on May 29 at Centennial Olympic Park and was attended by hundreds. At around 6:00 p.m., protesters marched to the CNN Center, which was then vandalized by protesters starting at around 7:00 p.m. Specifically, some protesters vandalized the CNN logo outside its offices, broke the building's glass, and entered the center at around 9:00 p.m. and destroyed its interior.[7] As tensions between protesters and police escalated, police began using tear gas on protesters. Protesters threw water bottles, eggs, and other objects at officers, burned police cars, and defaced businesses. The College Football Hall of Fame's gift shop was looted; Hall of Fame CEO Kimberly Beaudin told ESPN that \"no artifacts or displays were damaged.\"[8] Three officers were injured in the clashes, including one who was run over by an ATV.[9][10] At midnight, Governor Brian Kemp declared a state of emergency in Fulton County and authorized 500 National Guard members to aid law enforcement in the city.[11] Local black leaders, including Mayor Keisha Lance Bottoms and rapper and activist Killer Mike, decried the riots.[12] By Saturday, May 30 at 5:30, 71 arrests had been made in Atlanta, and one demonstrator was reported shot.[13][14]",
            "loc": "Atlanta"
        },
        {
            "description": "On May 30, about 60 people marched on Wrightsboro Road. The event was organized on Facebook.[20] On May 31, hundreds of demonstrators marched down Washington Road chanting and holding signs. Richmond County Sheriff Richard Roundtree spoke and deputies marched with the group. On June 6, 2,000 demonstrators marched through Downtown Augusta chanting and holding up signs that said “Black Lives Matter”. Augusta-Richmond County Mayor Hardie Davis spoke to demonstrators at the Augusta Riverwalk and expressed how happy he was that the protests in Augusta were peaceful and he said “We will get change”. Ahmaud Arbery’s mother, Wanda Cooper-Jones was a special guest and one of few who spoke to protesters about the deaths of Ahmaud Arbery, George Floyd, and Breonna Taylor and how they are smiling down from heaven knowing there will be change. [21]",
            "loc": "Augusta"
        },
        {
            "description": "On Sunday, June 7, one week after the first protest, demonstrators again gathered in Adamson Square. The protestors marched to Courthouse Park to stand in front of the Reverend Dr. Martin Luther King Jr. Monument, erected in January 2020,[24] and next to the Carroll County Confederate Monument, erected in April 1910.[25]",
            "loc": "Carrollton"
        },
        {
            "description": "About 200 protesters demonstrated peacefully on the steps of the Bartow County Courthouse for an hour on Saturday, May 30.[26] Some stayed afterwards to pick up litter from the courthouse grounds.[27]",
            "loc": "Cartersville"
        },
        {
            "description": "Over 200 protesters walked peacefully along Broadway through downtown Columbus on Sunday afternoon, May 31, with a police escort under the supervision of the mayor and the county sheriff. After the march ended about 3 p.m., some protesters regrouped and walked up 13th Street, blocking traffic; 22 of them were arrested for failing to disperse, a misdemeanor.[28]",
            "loc": "Columbus"
        },
        {
            "description": "On Monday, June 1, several dozen demonstrators marched peacefully, escorted by city police, from Harmon Field to the Whitfield County Courthouse and then to City Hall.[29]",
            "loc": "Dalton"
        },
        {
            "description": "On Thursday, June 4, hundreds of protestors marched in a peaceful protest that included speeches from Congressman Buddy Carter and State Representative Al Williams.[30][31]",
            "loc": "Hinesville"
        },
        {
            "description": "Over 100 protesters rallied on campus at Kennesaw State University and marched to downtown Kennesaw on June 1. Protesters met with Kennesaw Police and peacefully discussed their concerns.[32]",
            "loc": "Kennesaw"
        },
        {
            "description": "Hundreds gathered on Sunday, May 31, in Rosa Parks Square downtown for an \"Ecumenical Day of Solidarity\" organized by local clergy to honor the memories of George Floyd, Ahmaud Arbery, and Breonna Taylor with songs, chants, and prayers. The event was attended by Bibb County Sheriff David Davis and two of his deputies.[33]",
            "loc": "Macon"
        },
        {
            "description": "On June 1, over 100 protesters marched from Laurel Park to Marietta Square. Officers of the Marietta Police Department worked with protest organizers on the event.[34]",
            "loc": "Marietta"
        },
        {
            "description": "Dozens of protesters gathered for a peaceful rally at the Coweta County Courthouse on the evening of May 30.[35]",
            "loc": "Newnan"
        },
        {
            "description": "A group of about 100 demonstrators[36] protested peacefully at the Rome City Hall on Sunday afternoon, May 31.[37]",
            "loc": "Rome"
        },
        {
            "description": "On June 6, around 250 demonstrated along Mount Vernon Highway, outside Sandy Springs City Hall. Mayor Rusty Paul attended the event and expressed his support for the protesters.[38] On June 8, another protest took place outside City Hall, where around 50 people demonstrated against police violence.[39]",
            "loc": "Sandy Springs"
        }
    ]
},
{
    "Florida": [
        {
            "description": "There have been a series of George Floyd protests  in Florida.",
            "loc": "South Florida"
        },
        {
            "description": "Florida Governor Ron DeSantis activated the Florida National Guard on May 31, 2020, and deployed 700 soldiers to assist law enforcement agencies across the state. Additionally, DeSantis instructed the Florida Highway Patrol to mobilize 1,300 troopers to assist in policing actions.[3]",
            "loc": "Palm Beach County"
        },
        {
            "description": "Starting May 31, Broward County was placed under a 9 PM – 6 AM curfew for seven days.[34]",
            "loc": "Broward County"
        }
    ]
},
{
    "Washington, D.C.": [
        {
            "description": "Washington, the capital of the United States, has seen a series of protests following the killing of George Floyd in Minneapolis, particularly centered around the White House.",
            "loc": "Timeline"
        },
        {
            "description": "The White House was on lockdown the night of May 29 in response to protests reaching the gates.[1] The protests begun at 7:00 p.m.[2] By 8:30 p.m. the White House lockdown was lifted as protesters began to leave.[2] At 10:00 p.m. the protesters returned however by 3:30 am Saturday the protesters were more subdued.[2] The protesters came into conflict with the United States Secret Service.[2] At times the protesters got close enough to inflict minor injuries on certain officers.[2] At one point the protesters were pepper sprayed.[2] Several Secret Service agents reportedly suffered broken bones due to rocks and bottles of urine and alcohol thrown at them by rioters.[3][4]",
            "loc": "May 29"
        },
        {
            "description": "On May 30, the Secret Service reported that six people were arrested in Lafayette Park, the previous night. This contradicts an earlier tweet from President Trump in which he criticized D.C. Mayor Muriel Bowser for lack of involvement.[12]",
            "loc": "May 30"
        },
        {
            "description": "On May 31, dozens of businesses in CityCenter, Georgetown and Farragut Square were looted.[16]",
            "loc": "May 31"
        },
        {
            "description": "Amid ongoing protests sparked by the killing of George Floyd, on June 1, U.S. Park Police and National Guard troops used tear gas, rubber bullets, pepper spray, stingball grenades, horses, shields and batons to clear demonstrators from Lafayette Square and surrounding streets, to create a path for President Trump to walk to St. John's Episcopal Church.[19][20] Trump held a bible and posed for photos in front of the church, which was damaged in a fire during protests on May 31.[21][22] The enforcement was seen by many as excessive and an affront to First Amendment rights of peaceful  protesters.[23] The U.S. Park Police disputes this interpretation of events.[24]",
            "loc": "June 1"
        },
        {
            "description": "Former Democratic candidates for the 2020 United States presidential election have appeared at the protests. Sen. Elizabeth Warren made an appearance at the protest outside the White House on June 2. [48] Sen. Kamala Harris appeared at Black Lives Matter Plaza on June 5.[49] Congressman John Lewis, the last surviving speaker from the March on Washington who was being treated for Stage 4 pancreatic cancer, visited Black Lives Matter Plaza on June 7, declaring it \"very moving.\" [50]",
            "loc": "June 2"
        },
        {
            "description": "Mayor Bowser announced a citywide curfew from 7pm to 6am, which would be in place until at least the morning of June 3.[25] In response to  protesters gathering near the White House to protest, Attorney General William Barr deployed federal riot teams from the Bureau of Prisons and the FBI's Hostage Rescue Team.[26]",
            "loc": "June 3"
        },
        {
            "description": "Thursday was the first day the municipal government did not impose a curfew since Sunday.[38] Protests on June 4 were peaceful and D.C. police did not make a single arrest.[39]",
            "loc": "June 4"
        },
        {
            "description": "On June 5 muralists painted the words \"Black Lives Matter\" in 35-foot letters on 16th Street NW leading up to the White House and Lafayette Square with the assistance of the city government, which gave the section of the street the honorary name Black Lives Matter Plaza.[42][43][44]",
            "loc": "June 5"
        }
    ]
},
{
    "Delaware": [
        {
            "description": "On June 9, a group of protesters marched along U.S. Route 13, blocking traffic and defying police orders. 21 protesters were detained, including Dover Post reporter Andre Lamar.[3]",
            "loc": "Camden"
        },
        {
            "description": "On May 31, over 200 protesters gathered outside the Dover Police Department and Delaware Legislative Hall before marching north along U.S. Route 13, causing portions of the road to be closed. Looting took place at two stores at the Dover Mall before police secured the mall. The protesters then made their way to the Delaware State Police headquarters. Mayor Robin Christiansen declared a state of emergency and issued a curfew going into effect at 9pm on Sunday night.[4][5]",
            "loc": "Dover"
        },
        {
            "description": "On June 3, approximately 200 people gathered at the Georgetown Circle to peacefully protest police brutality.[7]",
            "loc": "Georgetown"
        },
        {
            "description": "On June 4, hundreds of people marched from Food Lion to Louis L. Redding Middle School, with a rally being held there and later at the Middletown Police Station.[8] On June 7, hundreds of protesters held a march to protest police brutality and honor the memory of George Floyd. The event began with nine prayers to represent the amount of time Derek Chauvin's knee was on Floyd's neck, then the protesters marched from Broad and Main Street through downtown Middletown.[9]",
            "loc": "Middletown"
        },
        {
            "description": "On June 13, protestors gathered at Lumbrook Parkm and marched down Main Street and Delaware Avenue with an additional protest planned on June 14. The protest on the 14th would be the fourth protest in the city.[10]",
            "loc": "Newark"
        },
        {
            "description": "About 30 protesters gathered at the Rehoboth Beach Bandstand on June 1. The protesters then marched to Rehoboth City Hall, with the crowd growing to 50 protesters.[11] A protest took place June 5 at 4 pm along Delaware Route 1 (Coastal Highway) by Southern Delaware Alliance for Racial Justice and Women's March Sussex, with up to 500 people in attendance.[12][13]",
            "loc": "Rehoboth Beach"
        },
        {
            "description": "On May 31, Joe Biden and U.S. Representative Lisa Blunt Rochester toured the areas damaged in the protest and spoke with residents.[19]",
            "loc": "Seaford"
        },
        {
            "description": "On June 5, another protest was held in the Tubman-Garrett Riverfront park, and a march to the New Castle County Courthouse to inspire reform and honor the death of Jeremy \"Bam Bam\" McDole. McDole was a wheelchair bound man, killed in 2015 by Wilmington Police.[20] Demonstrators also marched onto Interstate 95 and kneeled. Protesters were joined by several police officers, who walked with the group for 8 minutes. The protests were also attended by politicians including Governor John Carney, State Senator Darius Brown, Mayor Mike Purzycki, and U.S. Representative Blunt Rochester.[21]",
            "loc": "Wilmington"
        }
    ]
},
{
    "Connecticut": [
        {
            "description": "A demonstration on June 6 for women of Connecticut occurred to peacefully demonstrate against the systematic abuse of police power perpetrated against the black community. The demonstration convened through six locations throughout the state including Stamford, Norwalk, Bridgeport, New Haven, Meriden, and Hartford. It ended with a presentation at the State Capitol.NBC News",
            "loc": "Bridgeport"
        },
        {
            "description": "Around 500 people attended a protest march on June 7. Several members of the town committee were in attendance.[4]",
            "loc": "Cheshire"
        },
        {
            "description": "On June 3, a protest march consumed downtown city streets in the early afternoon, and later spilled over onto Interstate 84.[5]",
            "loc": "Danbury"
        },
        {
            "description": "There was a Black Lives Matter Peaceful Protest in East Granby on June 6.",
            "loc": "East Granby"
        },
        {
            "description": "A march for justice was held in East Hartford on June 6.",
            "loc": "East Hartford"
        },
        {
            "description": "On June 4, more than 300 people protested on Enfield's town green while a large contingent of protestors marched to the local police headquarters.[6]",
            "loc": "Enfield"
        },
        {
            "description": "On June 2, hundreds of students marched throughout the town. The demonstrators, wearing black, filled Sherman Green at about 11:30 a.m., lying across Post Road in Downtown to block traffic. They also made a 3-mile march downtown, through the beach area and up to Old Town Hall, where they formed a speaking circle. The protest lasted well into the afternoon.[7] There were also a few people standing outside Fairfield Police Department.[8]",
            "loc": "Fairfield"
        },
        {
            "description": "A peaceful march was held in Glastonbury on June 6.",
            "loc": "Glastonbury"
        },
        {
            "description": "Several dozen protesters rallied near the Greenwich Police Department on June 1. The police chief and a selectman spoke to the crowd.[9] Roads were closed and businesses were boarded up.[10]",
            "loc": "Greenwich"
        },
        {
            "description": "A peaceful protest was held in Groton on June 6.",
            "loc": "Groton"
        },
        {
            "description": "A protest and a march was held in Hamden on June 6. Demonstrators stood in solidarity with cities protesting the police murder of George Floyd, event officials said. The protest started at the police station. After the protest, demonstrators marched southbound on Dixwell Avenue. NBC News",
            "loc": "Hamden"
        },
        {
            "description": "On May 29, hundreds of people protested in front of the Capitol.[11] On May 30, 2020, more than 1,000 people participated Hartford, marching to the Hartford Police Department and Connecticut State Capitol.[3] June 6: Hundreds of protesters attended multiple events in Hartford. The first one, called \"No Lives Matter Until Black Lives Matter: Protest for Our Future\", marched from ope Park to the Capitol Building.[12]",
            "loc": "Hartford"
        },
        {
            "description": "June 6: Demonstrators marched from Manchester City Hall to the police station at noon.[12]",
            "loc": "Manchester"
        },
        {
            "description": "A peaceful march across main street was attended by a few hundred people on Saturday night, May 30.[13]",
            "loc": "Middletown"
        },
        {
            "description": "A demonstration on June 6 for women of Connecticut occurred to peacefully demonstrate against the systematic abuse of police power perpetrated against the black community. The demonstration convened through six locations throughout the state including Stamford, Norwalk, Bridgeport, New Haven, Meriden, and Hartford. It ended with a presentation at the State Capitol.NBC News",
            "loc": "Meriden"
        },
        {
            "description": "A peaceful march across main street was attended by a few hundred people on Saturday night, May 30.[13]",
            "loc": "New Canaan"
        },
        {
            "description": "A demonstration on June 6 for women of Connecticut occurred to peacefully demonstrate against the systematic abuse of police power perpetrated against the black community. The demonstration convened through six locations throughout the state including Stamford, Norwalk, Bridgeport, New Haven, Meriden, and Hartford. It ended with a presentation at the State Capitol.NBC News",
            "loc": "New Haven"
        },
        {
            "description": "Dozens of protesters gathered along Bank Street on May 30.[17]",
            "loc": "New London"
        },
        {
            "description": "A Peaceful protest / march was held on June 6 in Old Saybrook in solidarity with all of the victims of police brutality,\" event organizers posted on Facebook.",
            "loc": "Old Saybrook"
        },
        {
            "description": "A demonstration on June 6 for women of Connecticut occurred to peacefully demonstrate against the systematic abuse of police power perpetrated against the black community. The demonstration convened through six locations throughout the state including Stamford, Norwalk, Bridgeport, New Haven, Meriden, and Hartford. It ended with a presentation at the State Capitol.NBC News",
            "loc": "Stamford"
        },
        {
            "description": "A peaceful protest was held in front of town hall on May 30, with a few hundred protesters.[19]",
            "loc": "Stratford"
        },
        {
            "description": "June 6: A protest occurred at the gazebo at Trumbull Town Hall at 11am.[12]",
            "loc": "Trumbull"
        },
        {
            "description": "A peaceful protest was held in two places, when the police told everyone to get back but, some didn't so 28 people were arrested across from the police station on East Main Street[20]",
            "loc": "Waterbury"
        },
        {
            "description": "On June 2, several hundred families and individuals gathered outside of West Hartford City Hall.[21]",
            "loc": "West Hartford"
        },
        {
            "description": "A protest took place in Weston at the Weston Library from 1 p.m. to 3 p.m on June 6.NBC News",
            "loc": "Weston"
        },
        {
            "description": "On May 31, a hundred people rallied in downtown Westport.[22]",
            "loc": "Westport"
        },
        {
            "description": "The Town of Windsor held a vigil on June 6 in memory of George Floyd and other black lives and people of color, according to event organizers.",
            "loc": "Windsor"
        }
    ]
},
{
    "Colorado": [
        {
            "description": "On June 4, a protest was held in downtown Alamosa. While the protest was peaceful, before 6 p.m., a man shot someone in a truck, wounding him. The truck later stopped in the middle of the intersection. The suspect, a 27-year-old defense attorney, was a protester.[3]",
            "loc": "Alamosa"
        },
        {
            "description": "Dozens of residents attended a candle-light vigil on May 30. Participants repeated the words \"I can't breathe\" for nine minutes, the length of time that Derek Chauvin's knee was on George Floyd's neck.[4]",
            "loc": "Aspen"
        },
        {
            "description": "On June 2, Interim Police Chief Vanessa Wilson marched with community members to Aurora's Municipal Center, where they knelt for eight minutes and 46 seconds during a peaceful protest against police brutality.[5][6][7]",
            "loc": "Aurora"
        },
        {
            "description": "About 50 people organized a modified sit-in style protest where demonstrators peacefully took a knee for one hour on May 29.[8] Hundreds walked three miles through a \"Boulder in Solidarity\" march on May 30.[9]",
            "loc": "Boulder"
        },
        {
            "description": "About 300 protesters demonstrated by lying on their stomachs in front of City Hall on May 30. Dozens were arrested on May 30.[10] More protests took place on May 31.[11][12]",
            "loc": "Colorado Springs"
        },
        {
            "description": "On May 28, protesters marched for four hours, blocking traffic on Interstate 25 and demonstrating at the Colorado State Capitol.[13] Multiple gunshots were fired there, and police also fired rubber bullets and shot gas canisters at the crowd.[14] Several properties were damaged. Some protesters also crowded onto 16th Street Mall and toward Interstate 25 via 20th Street and blocked traffic.[15] One video appears to show a vehicle intentionally hitting a protester who had gotten onto the hood of the car. It is not clear what occurred before this—according to the woman who filmed the incident, the man jumped on top of the vehicle before she began filming.[16] Three police officers were injured in clashes with protesters, one of whom had to go to a hospital. Protests continued throughout the city over the next three days, with protests generally being peaceful during the day followed by more violent clashes between protesters and police later in the evenings.[17] On May 30, Mayor Michael Hancock implemented a citywide curfew from 8:00 p.m. to 5:00 a.m.[18] By the evening of May 31, the Denver Police Department had arrested over 120 people during the protests over the past four days.[17][19] On June 2, The Denver Police Department announced the arrest of a man suspected to be the perpetrator behind the vehicular attack of three police which left one officer with a fractured leg and the other two with a \"substantial risk of protracted loss or impairment of the function of any part or organ of the body.\"[20] A fifth night of protests in Denver remained more peaceful on Monday night, June 1, after the previous four nights had seen riotous behavior among smaller elements of the much larger protest gathering.[21][22] A federal judge stopped Denver police from using teargas on peaceful protesters. [23]",
            "loc": "Denver"
        },
        {
            "description": "About 100 protesters chanted \"No Justice, No Peace!\" the Fort Collins Police Services headquarters on May 28.[25] On June 1, about 150 protesters gathered at the same place while about 10 people attended a vigil at Civic Center Park.[26]",
            "loc": "Fort Collins"
        },
        {
            "description": "On June 1, dozens protested in front of Glenwood Springs City Hall at a rally organized by \"Western Slope Anti-Racist Action.\"[27]",
            "loc": "Glenwood Springs"
        },
        {
            "description": "On June 1, around 400 people marched through the Riverwalk and Union Avenue district to voice support for George Floyd despite rainfall. The chief of the Pueblo Police Department spoke in support of the protest.[28]",
            "loc": "Pueblo"
        }
    ]
},
{
    "Arkansas": [
        {
            "description": "On June 1, protesters gathered at the Bentonville Town Square; the protest was originally postponed from the original date after receiving online threats, however, over 1,000 individuals still showed up to protest. Initially, the protest was peaceful; however, agitators began throwing damaging police vehicles, threatening officers, throwing rocks, glass bottles, chains and fireworks at officers as the sun set. The Benton County Sheriff's Office warned the agitators to disperse. After a couple minutes of further assault by the agitators, Benton County Sheriff's Office began releasing tear gas and firing beanbag rounds at the agitators after having being struck by thrown objects and having \"threatening language\" thrown their way in the form of \"fuck the police\" as well as public calls for \"bagging a cop.\" Immediately following the initial round of teargas, on individual in the crowd fired rounds in the air from a pistol. It is unknown if this individual was identified or located. Most protesters left following this, but the agitators continuously returned to confront officers resulting in multiple surrounding agencies being called in to support the BCSO.[3]",
            "loc": "Bentonville"
        },
        {
            "description": "On May 31, protestors in Conway marched from downtown Conway towards the Faulkner County Courthouse. The protests eventually spilled onto Interstate 40 at the exit on Oak Street. Authorities made arrests and used tear gas to remove protestors from the interstate. Protestors largely remained on Oak Street close to the interstate for the remainder of the night.[4]",
            "loc": "Conway"
        },
        {
            "description": "Dozens of protesters demonstrated peacefully at the corner of College Avenue and Lafayette Street from 1 to 6 p.m. on May 30.[5] Around 4,000 people attended a peaceful protest at the Fayetteville Square on June 2.[6]",
            "loc": "Fayetteville"
        },
        {
            "description": "Hundreds of protesters were on Rogers Avenue and Garrison Avenue on May 31, 2020.[7][8]",
            "loc": "Fort Smith"
        },
        {
            "description": "On May 31 and June 1, hundreds of protesters demonstrated in Jonesboro, shutting down roads.[9][10][11]",
            "loc": "Jonesboro"
        },
        {
            "description": "On May 30 about 400 to 500 people took part in a peaceful protest on the steps of the Arkansas State Capitol.[12] During the evening, protesters clashed with police as protesters shot fireworks at police, police fired tear gas at protesters, some windows were broken in businesses across the street, and Interstate 630 was briefly blocked on two occasions.[13] A new mural was also added on West 7th Street.[14]",
            "loc": "Little Rock"
        },
        {
            "description": "On June 4, a \"drive-in rally\" took place at the Pine Bluff Civic Center, where 300 people turned up but remained in their cars to avoid spreading the coronavirus. A group of speakers implored attendees to involve themselves in the political process in order to make change happen.[15]",
            "loc": "Pine Bluff"
        }
    ]
},
{
    "Arizona": [
        {
            "description": "On June 6, dozens of protesters demonstrated at the intersection of Florence Boulevard and Cameron Avenue, in front of City Hall, in support of Black Lives Matter and George Floyd. Another group marched from Peart Park to join the City Hall protesters.[3]",
            "loc": "Casa Grande"
        },
        {
            "description": "On May 29, approximately 100 protesters gathered at Flagstaff City Hall, then marched to Heritage Square and back.[4] Similar protests occurred on May 30.[5]",
            "loc": "Flagstaff"
        },
        {
            "description": "A protest took place at Locomotive Park, which gathered at least 40 people.[6] One person was arrest for aggravated assault with a deadly weapon for pointing a gun at protesters.[7]",
            "loc": "Kingman"
        },
        {
            "description": "Black Lives Matter protests have taken place, Wednesday, June 3, a candle light walk from Rotary park to London Bridge was held.[8] On June 6, a Black Lives Matter protest of roughly 150 people condemned police brutality and racial injustice.[9]",
            "loc": "Lake Havasu City"
        },
        {
            "description": "On May 29, the NAACP held a candlelight vigil at Copper Sky Regional Park to honor George Floyd. On June 1, around 30 protesters demonstrated at Edison Road and State Route 347 to protest Floyd's death and support Black Lives Matter. At day's end, the protesters, along with Maricopa Police Chief Steve Stahl, took a knee in honor of Floyd before the 8:00 pm curfew.[10]",
            "loc": "Maricopa"
        },
        {
            "description": "Phoenix saw demonstrations for four straight nights. Hundreds protested on May 28, with the police using pepper spray and tear gas.[11] Protesters allegedly destroyed windows and doors to the Arizona Federal Theater and a City of Phoenix government building, as well as several other municipal and private businesses and parked cars. Some lit fireworks and fired shots into the air.[12][13] On May 29 a separate vigil was held outside the Arizona Department of Public Safety in honor of Dion Johnson, a 28-year-old man who was shot and killed by a DPS trooper on May 25.[14] Protests continued for three more nights.[15]",
            "loc": "Phoenix"
        },
        {
            "description": "More than 150 protesters demonstrated in front of the Prescott Valley Police Department.[16] Minor skirmishes with a pro-law enforcement group were reported on May 30.[17]",
            "loc": "Prescott"
        },
        {
            "description": "Hundreds of people protested downtown on May 30.[18] Rioters caused millions in damage to the Scottsdale Fashion Square area and 12 arrests were made.[18] No officers were injured.[18]",
            "loc": "Scottsdale"
        },
        {
            "description": "On June 3, a few dozen protesters held a demonstration near the Surprise Police Department building and raised their fists when a police officer stopped in front of them to show solidarity.[19]",
            "loc": "Surprise"
        },
        {
            "description": "Hundreds of protesters protested in downtown Tucson on May 30. The protests included multiple downtown businesses’ windows being broken as well as a dumpster being set on fire. By the end of the protest, protesters peacefully stood in front of police, who were in full riot gear.[20] It was estimated that rioters caused more than US$200,000 of damage, and at least four arrests were made. Tucson Chief of Police, Chris Magnus, said that many of the people who incited the violence were not from the area.[21] The following night, more protests occurred. The protest began downtown, and eventually made its way to the University of Arizona campus, where police appeared to push into the crowd of protesters. Eight people were arrested during the second night of protests.[22] On June 2, hundreds of people gathered for a candlelight vigil to honor George Floyd at the Dunbar Pavilion. This event was widely regarded as peaceful.[23] On Friday, June 5, around 2,000 people gathered at the University of Arizona's campus for a March for Justice Rally. The event was characterized as a \"peaceful and healing space.\".[24] On Saturday, June 6, thousands gathered to affirm that Black Lives matter. The event featured local Black artists and musicians and speakers called for defunding the police and encouraged attendees to denounce white supremacy.[25]",
            "loc": "Tucson"
        }
    ]
},
{
    "California": []
},
{
    "Alaska": [
        {
            "description": "Two peaceful demonstrations were held on May 30. A march, organized by a high school student via Instagram, began at Town Square. About a hundred protesters marched for about 45 minutes while chanting and holding signs.[3] A rally, organized separately and attended by hundreds of people, took place in midtown where pastors and community activists spoke in solidarity for justice.[4][3]",
            "loc": "Anchorage"
        },
        {
            "description": "On June 2, a crowd of over 100 residents gathered at the Bethel Cultural Center and peacefully protested the killing of George Floyd.[5] Protesters marched, carried signs and chanted, \"I can't breathe\" in support of the Black Lives Matter Movement.[6]",
            "loc": "Bethel"
        },
        {
            "description": "On May 30, over 400 peaceful protesters took part in a rally and march from Veteran's Memorial Park to Golden Heart Plaza organized by the Fairbanks NAACP and the statewide group Native Movement.[7]",
            "loc": "Fairbanks"
        },
        {
            "description": "On June 2, an event drew approximately 200 people, where a moment of silence lasting eight minutes and 46 seconds was held, among other activities.[8]",
            "loc": "Haines"
        },
        {
            "description": "More than 80 people attended a gathering on Monday, June 1 and 40 on Tuesday, June 2. One young mother, whose children were in attendance, held a sign that read \"Mama\", one of George Floyd's last words. The event was held at Wisdom, Knowledge, Faith & Love Park on Pioneer Avenue.[9]",
            "loc": "Homer"
        },
        {
            "description": "May 30: People held signs decrying violence against black people and calling out institutional racism, many supporting the Black Lives Matter movement.[10] June 6: Hundreds of vocal protesters gathered in Marine Park for a Black Lives Matter rally followed by a march to Douglas Bridge to drop flowers in the water.[11]",
            "loc": "Juneau"
        },
        {
            "description": "Protesters demonstrated at the corner of Tongass Avenue and Jefferson Street on June 3, 2020.[10]",
            "loc": "Ketchikan"
        },
        {
            "description": "In Kodiak on June 4, 2020, dozens of people gathered, carrying signs and showing support for George Floyd and the Black Lives Matter movement.[12]",
            "loc": "Kodiak"
        },
        {
            "description": "At least 20 people marched through Kotzebue on June 2, 2020.[10]",
            "loc": "Kotzebue"
        },
        {
            "description": "1,400 people peacefully gathered and marched in the town's historic downtown on June 6 with a call to end racism and to protest the killing of George Floyd.[13]",
            "loc": "Palmer"
        },
        {
            "description": "Around 250 local residents gathered in Totem Square on June 1, the attendees shared in a seven-minute moment of silence and two traditional Tlingit songs of peace.[14]",
            "loc": "Sitka"
        },
        {
            "description": "People  met at the whale bone h near the Top of the World Hotel in Utqiaġvik to protest the death of Floyd and police brutality.[15]  Protestors raised their fists in solidarity and observed a moment of silence for eight minutes.[15]  One of the organizers also expressed hope for police reform, including demilitarizing the police and banning the use of chokeholds such as the knee-on-neck choke.[15]",
            "loc": "Utqiaġvik"
        }
    ]
}
]